FeatureList.org
* DONE HacknetExtension
  Each categorized entry represents a child element of HacknetExtension.
  Any included options are text inside of the element.
** General Info
*** Language
    The language of the extension.
    + English: en-us
    + German: de-de
    + French: fr-be
    + Russian: ru-ru
    + Spanish: es-ar
    + Korean: ko-kr
    + Japanese: ja-jp
    + Chinese, simplified: zh-cn
*** Name
    The name of the extension, as displayed in-game.
*** Description
    The description of the extension as displayed in Hacknet - multi-line is allowed.
*** AllowSaves
    Whether or not the player can choose to save.
** Initial Setup
*** StartingVisibleNodes
    A comma-separated list of nodes representing the visible nodes at the start.
*** StartingMission
    An (optional) filepath to the starting mission xml file.
*** StartingActions
    A filepath to the actions performed at the start of the extension.
*** IntroStartupSong
    The name of the song played at the start of the game.
    Original songs need only their name (e.g. "The_Quickening").
    Custom songs need Path/Name
*** StartsWithTutorial
    Whether or not the tutorial runs at the start of the extension.
*** StartingTheme
    A filepath to the theme that the player starts with. 
**** Built-In Theme Names
     + TerminalOnlyBlack
     + HacknetBlue
     + HacknetTeal
     + HacknetYellow
     + HacknetGreen
     + HacknetWhite
     + HacknetPurple
     + HacknetMint
*** HasIntroStartup
    Whether or not the computer boot sequence occur at the start of the extension.
*** Faction
    A filepath to the faction files involved in the extension.
    Multiple factions tags are supported.
** Sequencer Flags
   When run, ExtensionSequencer.exe activates if player has SequencerFlagRequiredForStart.
   The player autoconnects to SequencerTargetID after SequencerSpinUpTime seconds.
   It will load in the conditional action file in ActionsToRunOnSequencerStart.
   However, the ActionsToRunOnSequencerStart activate instantly.
   Remember to delay any relevant actions in the set specified by the song intro you define!
*** SequencerFlagRequiredForStart
    The flag that the player must have for the sequencer to be able to start.
*** SequencerTargetID
    The computer that running the sequencer will connect to.
*** SequencerSpinUpTime
    How long the sequencer must spin up before connecting to the computer.
*** ActionsToRunOnSequencerStart
    A filepath to an xml file containing actions run *when sequencer starts to run*, not when it connects.
** Workshop
*** WorkshopDescription
    The description of the extension in the Steam workshop.
    Maximum of 8000 characters
    Newlines supported
*** WorkshopLanguage
    What language it is in the workshop.
    List of options unknown - "English" is definitely one, though.
*** WorkshopVisibility
    The visibility of the extension in the workshop.
    0: Public
    1: Friends Only  
    2: Private (Self Only)  
*** WorkshopTags
    A comma-separated list of workshop tags supported for the extension.
    The only existing tag is Extension, so use that.
*** WorkshopPreviewImagePath
    The image used for the extension in the workshop.
    It must be square, in extension folder, and <1MB. Steam will auto-resize the provided image.
    Steam supports .png, .jpg, and .gif
*** WorkshopPublishID
    The ID of the extension on the workshop.
    Start this with the value of NONE
    After you first publish, this is auto-filled by the Steam ID.
    Make sure to use that same ID afterwards to update the extension rather than creating a copy!
