index.html
<div id="outline-container-orgbfb5b0f" class="outline-2">
<h2 id="orgbfb5b0f">HacknetExtension</h2>
<div class="outline-text-2" id="text-orgbfb5b0f">
<p>
Each categorized entry represents a child element of HacknetExtension.<br />
Any included options are text inside of the element.<br />
</p>
</div>
<div id="outline-container-orgf358bb0" class="outline-3">
<h3 id="orgf358bb0">General Info</h3>
<div class="outline-text-3" id="text-orgf358bb0">
</div>
<div id="outline-container-org4d72dd8" class="outline-4">
<h4 id="org4d72dd8">Language</h4>
<div class="outline-text-4" id="text-org4d72dd8">
<p>
The language of the extension.<br />
</p>
<ul class="org-ul">
<li>English: en-us<br /></li>
<li>German: de-de<br /></li>
<li>French: fr-be<br /></li>
<li>Russian: ru-ru<br /></li>
<li>Spanish: es-ar<br /></li>
<li>Korean: ko-kr<br /></li>
<li>Japanese: ja-jp<br /></li>
<li>Chinese, simplified: zh-cn<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org08e83fc" class="outline-4">
<h4 id="org08e83fc">Name</h4>
<div class="outline-text-4" id="text-org08e83fc">
<p>
The name of the extension, as displayed in-game.<br />
</p>
</div>
</div>
<div id="outline-container-org00be0fd" class="outline-4">
<h4 id="org00be0fd">Description</h4>
<div class="outline-text-4" id="text-org00be0fd">
<p>
The description of the extension as displayed in Hacknet - multi-line is allowed.<br />
</p>
</div>
</div>
<div id="outline-container-org0c1b8e8" class="outline-4">
<h4 id="org0c1b8e8">AllowSaves</h4>
<div class="outline-text-4" id="text-org0c1b8e8">
<p>
Whether or not the player can choose to save.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org9fa2bc6" class="outline-3">
<h3 id="org9fa2bc6">Initial Setup</h3>
<div class="outline-text-3" id="text-org9fa2bc6">
</div>
<div id="outline-container-orgb2bd501" class="outline-4">
<h4 id="orgb2bd501">StartingVisibleNodes</h4>
<div class="outline-text-4" id="text-orgb2bd501">
<p>
A comma-separated list of nodes representing the visible nodes at the start.<br />
</p>
</div>
</div>
<div id="outline-container-org0256e12" class="outline-4">
<h4 id="org0256e12">StartingMission</h4>
<div class="outline-text-4" id="text-org0256e12">
<p>
An (optional) filepath to the starting mission xml file.<br />
</p>
</div>
</div>
<div id="outline-container-orgecdf339" class="outline-4">
<h4 id="orgecdf339">StartingActions</h4>
<div class="outline-text-4" id="text-orgecdf339">
<p>
A filepath to the actions performed at the start of the extension.<br />
</p>
</div>
</div>
<div id="outline-container-org708d8f5" class="outline-4">
<h4 id="org708d8f5">IntroStartupSong</h4>
<div class="outline-text-4" id="text-org708d8f5">
<p>
The name of the song played at the start of the game.<br />
Original songs need only their name (e.g. "The_Quickening").<br />
Custom songs need Path/Name<br />
</p>
</div>
</div>
<div id="outline-container-orgaa7524a" class="outline-4">
<h4 id="orgaa7524a">StartsWithTutorial</h4>
<div class="outline-text-4" id="text-orgaa7524a">
<p>
Whether or not the tutorial runs at the start of the extension.<br />
</p>
</div>
</div>
<div id="outline-container-orgc9eaaad" class="outline-4">
<h4 id="orgc9eaaad">StartingTheme</h4>
<div class="outline-text-4" id="text-orgc9eaaad">
<p>
A filepath to the theme that the player starts with.<br />
</p>
</div>
<div id="outline-container-orgd5bfd6d" class="outline-5">
<h5 id="orgd5bfd6d">Built-In Theme Names</h5>
<div class="outline-text-5" id="text-orgd5bfd6d">
<ul class="org-ul">
<li>TerminalOnlyBlack<br /></li>
<li>HacknetBlue<br /></li>
<li>HacknetTeal<br /></li>
<li>HacknetYellow<br /></li>
<li>HacknetGreen<br /></li>
<li>HacknetWhite<br /></li>
<li>HacknetPurple<br /></li>
<li>HacknetMint<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4fae641" class="outline-4">
<h4 id="org4fae641">HasIntroStartup</h4>
<div class="outline-text-4" id="text-org4fae641">
<p>
Whether or not the computer boot sequence occur at the start of the extension.<br />
</p>
</div>
</div>
<div id="outline-container-org1f3eb08" class="outline-4">
<h4 id="org1f3eb08">Faction</h4>
<div class="outline-text-4" id="text-org1f3eb08">
<p>
A filepath to the faction files involved in the extension.<br />
Multiple factions tags are supported.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orge5084fb" class="outline-3">
<h3 id="orge5084fb">Sequencer Flags</h3>
<div class="outline-text-3" id="text-orge5084fb">
<p>
When run, ExtensionSequencer.exe activates if player has SequencerFlagRequiredForStart.<br />
The player autoconnects to SequencerTargetID after SequencerSpinUpTime seconds.<br />
It will load in the conditional action file in ActionsToRunOnSequencerStart.<br />
However, the ActionsToRunOnSequencerStart activate instantly.<br />
Remember to delay any relevant actions in the set specified by the song intro you define!<br />
</p>
</div>
<div id="outline-container-org250e9ef" class="outline-4">
<h4 id="org250e9ef">SequencerFlagRequiredForStart</h4>
<div class="outline-text-4" id="text-org250e9ef">
<p>
The flag that the player must have for the sequencer to be able to start.<br />
</p>
</div>
</div>
<div id="outline-container-orga8a8a51" class="outline-4">
<h4 id="orga8a8a51">SequencerTargetID</h4>
<div class="outline-text-4" id="text-orga8a8a51">
<p>
The computer that running the sequencer will connect to.<br />
</p>
</div>
</div>
<div id="outline-container-org734fefe" class="outline-4">
<h4 id="org734fefe">SequencerSpinUpTime</h4>
<div class="outline-text-4" id="text-org734fefe">
<p>
How long the sequencer must spin up before connecting to the computer.<br />
</p>
</div>
</div>
<div id="outline-container-orgadd073a" class="outline-4">
<h4 id="orgadd073a">ActionsToRunOnSequencerStart</h4>
<div class="outline-text-4" id="text-orgadd073a">
<p>
A filepath to an xml file containing actions run <b>when sequencer starts to run</b>, not when it connects.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org2495204" class="outline-3">
<h3 id="org2495204">Workshop</h3>
<div class="outline-text-3" id="text-org2495204">
</div>
<div id="outline-container-org187dffb" class="outline-4">
<h4 id="org187dffb">WorkshopDescription</h4>
<div class="outline-text-4" id="text-org187dffb">
<p>
The description of the extension in the Steam workshop.<br />
Maximum of 8000 characters<br />
Newlines supported<br />
</p>
</div>
</div>
<div id="outline-container-orgadc42f3" class="outline-4">
<h4 id="orgadc42f3">WorkshopLanguage</h4>
<div class="outline-text-4" id="text-orgadc42f3">
<p>
What language it is in the workshop.<br />
List of options unknown - "English" is definitely one, though.<br />
</p>
</div>
</div>
<div id="outline-container-org17ed2fe" class="outline-4">
<h4 id="org17ed2fe">WorkshopVisibility</h4>
<div class="outline-text-4" id="text-org17ed2fe">
<p>
The visibility of the extension in the workshop.<br />
0: Public<br />
1: Friends Only<br />
2: Private (Self Only)<br />
</p>
</div>
</div>
<div id="outline-container-orgc440605" class="outline-4">
<h4 id="orgc440605">WorkshopTags</h4>
<div class="outline-text-4" id="text-orgc440605">
<p>
A comma-separated list of workshop tags supported for the extension.<br />
The only existing tag is Extension, so use that.<br />
</p>
</div>
</div>
<div id="outline-container-org7b78285" class="outline-4">
<h4 id="org7b78285">WorkshopPreviewImagePath</h4>
<div class="outline-text-4" id="text-org7b78285">
<p>
The image used for the extension in the workshop.<br />
It must be square, in extension folder, and &lt;1MB. Steam will auto-resize the provided image.<br />
Steam supports .png, .jpg, and .gif<br />
</p>
</div>
</div>
<div id="outline-container-orge31d092" class="outline-4">
<h4 id="orge31d092">WorkshopPublishID</h4>
<div class="outline-text-4" id="text-orge31d092">
<p>
The ID of the extension on the workshop.<br />
Start this with the value of NONE<br />
After you first publish, this is auto-filled by the Steam ID.<br />
Make sure to use that same ID afterwards to update the extension rather than creating a copy!<br />
</p>
</div>
</div>
</div>
