FeatureList.org
** Example
   Pastebin Link: https://pastebin.com/6fc1fpJn
   Simplified Contents:
   #+BEGIN_SRC nxml
     <HacknetExtension>
       <Language>en-us</Language>

       <!-- Max name length is 128 characters -->
       <Name>Intro Extension</Name>
       <AllowSaves>true</AllowSaves>

       <!-- a comma separated list of notes that start out as being visible-->
       <StartingVisibleNodes>advExamplePC</StartingVisibleNodes>

       <!-- Optional -->
       <StartingMission>Missions/Intro/IntroMission1.xml</StartingMission>

       <!--
       Conditional action set that is loaded in as soon as a new session is created
       This is useful to do setup stuff, like giving the player programs, assigning
       them a faction etc.
       If you don't need this, set it to "NONE", or just delete the tag.-->
       <StartingActions>Actions/StartingActions.xml</StartingActions>

       <!-- Description that appears within Hacknet -->
       <Description> --- Intro Extension ---
     This example extension will teach the basics of building a Hacknet Extension.
     Descriptions can be multiple lines, so, we're learning already!</Description>

       <!-- Factions involved in this extension!
	    You can define as many or as few as you like -->
       <Faction>Factions/ExampleFaction.xml</Faction>
       <Faction>Factions/IntroFaction.xml</Faction>

       <StartsWithTutorial>False</StartsWithTutorial>

       <!-- Makes the extension start with the standard restart bootup sequence -->
       <HasIntroStartup>true</HasIntroStartup>

       <!-- 
       Base Themes are named: TerminalOnlyBlack, HacknetBlue, HacknetTeal,
       HacknetYellow, HackerGreen, HacknetWhite, HacknetPurple, HacknetMint
       -->
       <StartingTheme>Themes/ExampleTheme.xml</StartingTheme>

       <!-- You can reference songs from the original game here, or your
	    own .ogg files by path.
	    To reference original songs, use their name in the files! You
	    don't need the path, just the filename. This works for any songs in
	    these folders: Content/Music Content/DLC/Music

	    To play your own songs, use the path to that song in your
	    extension.  For example, try changing the song name below to
	    "Music/Chemical_Burns.ogg" - it'll start with that instead for
	    new saves! -->
       <IntroStartupSong>The_Quickening</IntroStartupSong>

       <!-- For use with the Sequencer. -->
       <SequencerTargetID>advExamplePC</SequencerTargetID>
       <SequencerSpinUpTime>10.5</SequencerSpinUpTime>
       <SequencerFlagRequiredForStart>testFlag</SequencerFlagRequiredForStart>
       <ActionsToRunOnSequencerStart>Actions/ThemeSwapActions.xml
         </ActionsToRunOnSequencerStart>


       <!-- Steam workshop fields -->

       <WorkshopDescription>This is the description of the extension that
     will appear in Steam Workshop and any other mod platforms this gets
     ported to. Max 8000 characters.
     You can use newlines in this as normal etc.</WorkshopDescription>

       <WorkshopLanguage>English</WorkshopLanguage>

       <!-- Sets the visibility of this item on the workshop.
       0 = public
       1 = friends only
       2 = private (self only)-->
       <WorkshopVisibility>2</WorkshopVisibility>

       <WorkshopTags>Extension</WorkshopTags>

       <WorkshopPreviewImagePath>WorkshopLogo.png</WorkshopPreviewImagePath>

       <!-- After first publish, this will be auto-filled.
	    Use that ID to update your extension. -->
       <WorkshopPublishID>NONE</WorkshopPublishID>

     </HacknetExtension>
   #+END_SRC
* DONE Computer
** Computer Tag Attributes
*** id
    The id of the computer. Used to reference it elsewhere.
*** name
    The name of the computer. Displayed to the player.
*** ip
    The ip address of the computer. Can be used to connect by the player. 
*** security
    Determines the default security on the computer. 
    Value Options: 0-5
    The value is the number of ports needed to open the computer for when <4.
    For 4 or 5, other security is added.
*** allowsDefaultBootModule
    Whether it launches the final daemon defined at startup/connect (rather than the filesystem). By default, this is true.
*** icon
    The icon displayed for the computer.
    Possible values for just the base game and for DLC-included are below.
    + Base Game
     - laptop
     - chip
     - kellis
     - tablet
     - ePhone
     - ePhone2
    + Labyrinths
     - Psylance
     - PacificAir
     - Alchemist
     - DLCLaptop
     - DLCPC1
     - DLCPC2
     - DLCServer
*** type
    The type of computer, numeric.
    + 1: corporate
    + 2: Home
    + 3: server
    + 4: empty
    + "empty" also works to generate no junk/IRC
*** Example
    #+BEGIN_SRC nxml
	  <Computer
	      id="advExamplePC" 
	      name="Extension Example PC" 
	      ip="167.194.132.7"
	      security="2"
	      allowsDefaultBootModule="false"
	      icon="chip" 
	      type="1" > 
    #+END_SRC
