index.html
<div id="outline-container-org629c766" class="outline-3">
<h3 id="org629c766">Example</h3>
<div class="outline-text-3" id="text-org629c766">
<p>
Pastebin Link: <a href="https://pastebin.com/6fc1fpJn">https://pastebin.com/6fc1fpJn</a><br />
Simplified Contents:<br />
</p>
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">HacknetExtension</span>&gt;
  &lt;<span style="color: #cae682;">Language</span>&gt;en-us&lt;/<span style="color: #cae682;">Language</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Max name length is 128 characters </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">Name</span>&gt;Intro Extension&lt;/<span style="color: #cae682;">Name</span>&gt;
  &lt;<span style="color: #cae682;">AllowSaves</span>&gt;true&lt;/<span style="color: #cae682;">AllowSaves</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">a comma separated list of notes that start out as being visible</span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">StartingVisibleNodes</span>&gt;advExamplePC&lt;/<span style="color: #cae682;">StartingVisibleNodes</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Optional </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">StartingMission</span>&gt;Missions/Intro/IntroMission1.xml&lt;/<span style="color: #cae682;">StartingMission</span>&gt;

  <span style="color: #99968b;">&lt;!--</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">Conditional action set that is loaded in as soon as a new session is created</span>
<span style="color: #99968b;">  This is useful to do setup stuff, like giving the player programs, assigning</span>
<span style="color: #99968b;">  them a faction etc.</span>
<span style="color: #99968b;">  If you don't need this, set it to "NONE", or just delete the tag.</span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">StartingActions</span>&gt;Actions/StartingActions.xml&lt;/<span style="color: #cae682;">StartingActions</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Description that appears within Hacknet </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">Description</span>&gt; --- Intro Extension ---
This example extension will teach the basics of building a Hacknet Extension.
Descriptions can be multiple lines, so, we're learning already!&lt;/<span style="color: #cae682;">Description</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Factions involved in this extension!</span>
<span style="color: #99968b;">       You can define as many or as few as you like </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">Faction</span>&gt;Factions/ExampleFaction.xml&lt;/<span style="color: #cae682;">Faction</span>&gt;
  &lt;<span style="color: #cae682;">Faction</span>&gt;Factions/IntroFaction.xml&lt;/<span style="color: #cae682;">Faction</span>&gt;

  &lt;<span style="color: #cae682;">StartsWithTutorial</span>&gt;False&lt;/<span style="color: #cae682;">StartsWithTutorial</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Makes the extension start with the standard restart bootup sequence </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">HasIntroStartup</span>&gt;true&lt;/<span style="color: #cae682;">HasIntroStartup</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">Base Themes are named: TerminalOnlyBlack, HacknetBlue, HacknetTeal,</span>
<span style="color: #99968b;">  HacknetYellow, HackerGreen, HacknetWhite, HacknetPurple, HacknetMint</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">StartingTheme</span>&gt;Themes/ExampleTheme.xml&lt;/<span style="color: #cae682;">StartingTheme</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">You can reference songs from the original game here, or your</span>
<span style="color: #99968b;">       own .ogg files by path.</span>
<span style="color: #99968b;">       To reference original songs, use their name in the files! You</span>
<span style="color: #99968b;">       don't need the path, just the filename. This works for any songs in</span>
<span style="color: #99968b;">       these folders: Content/Music Content/DLC/Music</span>

<span style="color: #99968b;">       To play your own songs, use the path to that song in your</span>
<span style="color: #99968b;">       extension.  For example, try changing the song name below to</span>
<span style="color: #99968b;">       "Music/Chemical_Burns.ogg" - it'll start with that instead for</span>
<span style="color: #99968b;">       new saves! </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">IntroStartupSong</span>&gt;The_Quickening&lt;/<span style="color: #cae682;">IntroStartupSong</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">For use with the Sequencer. </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">SequencerTargetID</span>&gt;advExamplePC&lt;/<span style="color: #cae682;">SequencerTargetID</span>&gt;
  &lt;<span style="color: #cae682;">SequencerSpinUpTime</span>&gt;10.5&lt;/<span style="color: #cae682;">SequencerSpinUpTime</span>&gt;
  &lt;<span style="color: #cae682;">SequencerFlagRequiredForStart</span>&gt;testFlag&lt;/<span style="color: #cae682;">SequencerFlagRequiredForStart</span>&gt;
  &lt;<span style="color: #cae682;">ActionsToRunOnSequencerStart</span>&gt;Actions/ThemeSwapActions.xml
    &lt;/<span style="color: #cae682;">ActionsToRunOnSequencerStart</span>&gt;


  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Steam workshop fields </span><span style="color: #99968b;">--&gt;</span>

  &lt;<span style="color: #cae682;">WorkshopDescription</span>&gt;This is the description of the extension that
will appear in Steam Workshop and any other mod platforms this gets
ported to. Max 8000 characters.
You can use newlines in this as normal etc.&lt;/<span style="color: #cae682;">WorkshopDescription</span>&gt;

  &lt;<span style="color: #cae682;">WorkshopLanguage</span>&gt;English&lt;/<span style="color: #cae682;">WorkshopLanguage</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Sets the visibility of this item on the workshop.</span>
<span style="color: #99968b;">  0 = public</span>
<span style="color: #99968b;">  1 = friends only</span>
<span style="color: #99968b;">  2 = private (self only)</span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">WorkshopVisibility</span>&gt;2&lt;/<span style="color: #cae682;">WorkshopVisibility</span>&gt;

  &lt;<span style="color: #cae682;">WorkshopTags</span>&gt;Extension&lt;/<span style="color: #cae682;">WorkshopTags</span>&gt;

  &lt;<span style="color: #cae682;">WorkshopPreviewImagePath</span>&gt;WorkshopLogo.png&lt;/<span style="color: #cae682;">WorkshopPreviewImagePath</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">After first publish, this will be auto-filled.</span>
<span style="color: #99968b;">       Use that ID to update your extension. </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">WorkshopPublishID</span>&gt;NONE&lt;/<span style="color: #cae682;">WorkshopPublishID</span>&gt;

&lt;/<span style="color: #cae682;">HacknetExtension</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7014d06" class="outline-2">
<h2 id="org7014d06">Computer</h2>
<div class="outline-text-2" id="text-org7014d06">
</div>
<div id="outline-container-org0a783f1" class="outline-3">
<h3 id="org0a783f1">Computer Tag Attributes</h3>
<div class="outline-text-3" id="text-org0a783f1">
</div>
<div id="outline-container-orgc4e9e1f" class="outline-4">
<h4 id="orgc4e9e1f">id</h4>
<div class="outline-text-4" id="text-orgc4e9e1f">
<p>
The id of the computer. Used to reference it elsewhere.<br />
</p>
</div>
</div>
<div id="outline-container-org55b9abe" class="outline-4">
<h4 id="org55b9abe">name</h4>
<div class="outline-text-4" id="text-org55b9abe">
<p>
The name of the computer. Displayed to the player.<br />
</p>
</div>
</div>
<div id="outline-container-org4083dea" class="outline-4">
<h4 id="org4083dea">ip</h4>
<div class="outline-text-4" id="text-org4083dea">
<p>
The ip address of the computer. Can be used to connect by the player.<br />
</p>
</div>
</div>
<div id="outline-container-org1de1416" class="outline-4">
<h4 id="org1de1416">security</h4>
<div class="outline-text-4" id="text-org1de1416">
<p>
Determines the default security on the computer.<br />
Value Options: 0-5<br />
The value is the number of ports needed to open the computer for when &lt;4.<br />
For 4 or 5, other security is added.<br />
</p>
</div>
</div>
<div id="outline-container-org0a26998" class="outline-4">
<h4 id="org0a26998">allowsDefaultBootModule</h4>
<div class="outline-text-4" id="text-org0a26998">
<p>
Whether it launches the final daemon defined at startup/connect (rather than the filesystem). By default, this is true.<br />
</p>
</div>
</div>
<div id="outline-container-org14bee32" class="outline-4">
<h4 id="org14bee32">icon</h4>
<div class="outline-text-4" id="text-org14bee32">
<p>
The icon displayed for the computer.<br />
Possible values for just the base game and for DLC-included are below.<br />
</p>
<ul class="org-ul">
<li>Base Game<br />
<ul class="org-ul">
<li>laptop<br /></li>
<li>chip<br /></li>
<li>kellis<br /></li>
<li>tablet<br /></li>
<li>ePhone<br /></li>
<li>ePhone2<br /></li>
</ul></li>
<li>Labyrinths<br />
<ul class="org-ul">
<li>Psylance<br /></li>
<li>PacificAir<br /></li>
<li>Alchemist<br /></li>
<li>DLCLaptop<br /></li>
<li>DLCPC1<br /></li>
<li>DLCPC2<br /></li>
<li>DLCServer<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc4523a" class="outline-4">
<h4 id="orgbc4523a">type</h4>
<div class="outline-text-4" id="text-orgbc4523a">
<p>
The type of computer, numeric.<br />
</p>
<ul class="org-ul">
<li>1: corporate<br /></li>
<li>2: Home<br /></li>
<li>3: server<br /></li>
<li>4: empty<br /></li>
<li>"empty" also works to generate no junk/IRC<br /></li>
</ul>
</div>
</div>
