FeatureList.org
** Security Features
*** adminPass
    The password to the admin account.
**** Attributes
     + pass
**** Example
     #+BEGIN_SRC nxml
       <adminPass pass="password"/>
     #+END_SRC
*** account
    Create secondary accounts for the computer.
    Multiple account tags permitted.
**** Attributes
     + username
     + password
     + type
       - Name or number works
       - 0: ADMIN
       - 1: ALL (Delete priviliges)
       - 2: MAIL (For mail accounts)
       - 3: MISSIONLIST (For mission listing server accounts)
**** Example
     #+BEGIN_SRC nxml
       <account
	   username="Matt"
	   password="testpass"
	   type="ALL" />
       <account
	   username="mailGuy"
	   password="mailPass"
	   type="2" />
     #+END_SRC
*** TODO ports
    Comma-separated list of port numbers
    Valid options: 21, 22, 25, 80, 1433, 104, 6881, 443, 192
**** Example
     #+BEGIN_SRC nxml
       <ports>21, 22, 25, 80, 1433, 104, 6881, 443, 192, 554</ports>
     #+END_SRC
*** portsForCrack
    The number of ports needed to run PortHack.
    If >100, "INVIOLABILITY ERROR" message appears.
**** Attributes
     + val
**** Example
     #+BEGIN_SRC nxml
       <portsForCrack val="0" />
     #+END_SRC
*** proxy
    Creates (or negates) a proxy on the computer.
**** Attributes
     + time
       - Base time 30s, value is a multiplier (1 = normal, 2 = long). Experiment!
       - Set to -1 to remove.
**** Example
     #+BEGIN_SRC nxml
       <proxy time="2" />
     #+END_SRC
*** firewall
    Creates (or negates) a firewall on the computer
**** Attributes
     + level
       - Ideally same as solution length, must be at least as long. Number representing input length
     + solution
       - The string that solves the firewall
     + additionalTime
       - How much time is added at each analyze step
**** Example
     #+BEGIN_SRC nxml
       <firewall
	   level="6"
	   solution="Scypio"
	   additionalTime="1.0"/>
     #+END_SRC
*** trace
    Creates (or negates) a trace.
**** Attributes
     + time
       - The length of the trace in seconds, -1 to remove
**** Example
     #+BEGIN_SRC nxml
       <trace time="5678" />
     #+END_SRC
*** admin
    Creates an admin who monitors the computer.
**** Attributes
     + type
       - none: Remove auto-generated admin by security
       - basic: Resets everything after ~15 seconds
       - progress: Resets if the player is not admin
       - fast: Resets always? Unsure, unspecified
     + resetPassword
     + isSuper
       - Whether or not the player gets admin removed once achieving admin.
**** Example
     #+BEGIN_SRC nxml
       <admin
	   type="fast"
	   resetPassword="false"
	   isSuper="false"/>
       <admin
	   type="fast"
	   resetPassword="true"
	   isSuper="true" />
       <admin type="progress" />
       <admin type="none"/>
     #+END_SRC
*** portRemap
    Remaps default port values to custom values.
    Comma-separated list of remappings
    Left-hand side is default port value or name (ssh,ftp,web,torrent,medical,smtp,sql)
**** Example
     #+BEGIN_SRC nxml
       <portRemap>web=1234,22=2</portRemap>
     #+END_SRC
*** tracker
    Does the player get hacked if they leave logs downloading/deleting files?
    Empty tag, no attributes or elements (<tracker />)
    Attempts to reset player by default, or ETAS if "CSEC_Member" flag is attached.
**** Example
     #+BEGIN_SRC nxml
       <tracker />
     #+END_SRC
** Links and Positioning
*** dlink
    Represents a direct link towards another computer (for scanning)
    Multiple dlink tags supported
**** Attributes
     + target
       - The ID of the target computer
**** Example
     #+BEGIN_SRC nxml
       <dlink target="advExamplePC2" />
     #+END_SRC
