index.html
<div id="outline-container-org1fd9b6e" class="outline-4">
<h4 id="org1fd9b6e">Example</h4>
<div class="outline-text-4" id="text-org1fd9b6e">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">Computer</span>
    <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"advExamplePC"</span> 
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Extension Example PC"</span> 
    <span style="color: #cae682;">ip</span>=<span style="color: #95e454;">"167.194.132.7"</span>
    <span style="color: #cae682;">security</span>=<span style="color: #95e454;">"2"</span>
    <span style="color: #cae682;">allowsDefaultBootModule</span>=<span style="color: #95e454;">"false"</span>
    <span style="color: #cae682;">icon</span>=<span style="color: #95e454;">"chip"</span> 
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"1"</span> &gt; 
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org38c1607" class="outline-3">
<h3 id="org38c1607">Security Features</h3>
<div class="outline-text-3" id="text-org38c1607">
</div>
<div id="outline-container-org6f348ae" class="outline-4">
<h4 id="org6f348ae">adminPass</h4>
<div class="outline-text-4" id="text-org6f348ae">
<p>
The password to the admin account.<br />
</p>
</div>
<div id="outline-container-org27cf4ba" class="outline-5">
<h5 id="org27cf4ba">Attributes</h5>
<div class="outline-text-5" id="text-org27cf4ba">
<ul class="org-ul">
<li>pass<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgccbccda" class="outline-5">
<h5 id="orgccbccda">Example</h5>
<div class="outline-text-5" id="text-orgccbccda">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">adminPass</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"password"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5d93630" class="outline-4">
<h4 id="org5d93630">account</h4>
<div class="outline-text-4" id="text-org5d93630">
<p>
Create secondary accounts for the computer.<br />
Multiple account tags permitted.<br />
</p>
</div>
<div id="outline-container-orgd83453e" class="outline-5">
<h5 id="orgd83453e">Attributes</h5>
<div class="outline-text-5" id="text-orgd83453e">
<ul class="org-ul">
<li>username<br /></li>
<li>password<br /></li>
<li>type<br />
<ul class="org-ul">
<li>Name or number works<br /></li>
<li>0: ADMIN<br /></li>
<li>1: ALL (Delete priviliges)<br /></li>
<li>2: MAIL (For mail accounts)<br /></li>
<li>3: MISSIONLIST (For mission listing server accounts)<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4825773" class="outline-5">
<h5 id="org4825773">Example</h5>
<div class="outline-text-5" id="text-org4825773">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">account</span>
    <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"Matt"</span>
    <span style="color: #cae682;">password</span>=<span style="color: #95e454;">"testpass"</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"ALL"</span> /&gt;
&lt;<span style="color: #cae682;">account</span>
    <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"mailGuy"</span>
    <span style="color: #cae682;">password</span>=<span style="color: #95e454;">"mailPass"</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"2"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org16e452e" class="outline-4">
<h4 id="org16e452e">ports</h4>
<div class="outline-text-4" id="text-org16e452e">
<p>
Comma-separated list of port numbers<br />
Valid options: 21, 22, 25, 80, 1433, 104, 6881, 443, 192<br />
</p>
</div>
<div id="outline-container-orgdb2d0b6" class="outline-5">
<h5 id="orgdb2d0b6">Example</h5>
<div class="outline-text-5" id="text-orgdb2d0b6">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">ports</span>&gt;21, 22, 25, 80, 1433, 104, 6881, 443, 192, 554&lt;/<span style="color: #cae682;">ports</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcec2d0f" class="outline-4">
<h4 id="orgcec2d0f">portsForCrack</h4>
<div class="outline-text-4" id="text-orgcec2d0f">
<p>
The number of ports needed to run PortHack.<br />
If &gt;100, "INVIOLABILITY ERROR" message appears.<br />
</p>
</div>
<div id="outline-container-org14e8b75" class="outline-5">
<h5 id="org14e8b75">Attributes</h5>
<div class="outline-text-5" id="text-org14e8b75">
<ul class="org-ul">
<li>val<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org1ba6e00" class="outline-5">
<h5 id="org1ba6e00">Example</h5>
<div class="outline-text-5" id="text-org1ba6e00">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">portsForCrack</span> <span style="color: #cae682;">val</span>=<span style="color: #95e454;">"0"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4f77a1c" class="outline-4">
<h4 id="org4f77a1c">proxy</h4>
<div class="outline-text-4" id="text-org4f77a1c">
<p>
Creates (or negates) a proxy on the computer.<br />
</p>
</div>
<div id="outline-container-orgf5c72d5" class="outline-5">
<h5 id="orgf5c72d5">Attributes</h5>
<div class="outline-text-5" id="text-orgf5c72d5">
<ul class="org-ul">
<li>time<br />
<ul class="org-ul">
<li>Base time 30s, value is a multiplier (1 = normal, 2 = long). Experiment!<br /></li>
<li>Set to -1 to remove.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga539173" class="outline-5">
<h5 id="orga539173">Example</h5>
<div class="outline-text-5" id="text-orga539173">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">proxy</span> <span style="color: #cae682;">time</span>=<span style="color: #95e454;">"2"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1020537" class="outline-4">
<h4 id="org1020537">firewall</h4>
<div class="outline-text-4" id="text-org1020537">
<p>
Creates (or negates) a firewall on the computer<br />
</p>
</div>
<div id="outline-container-orga831211" class="outline-5">
<h5 id="orga831211">Attributes</h5>
<div class="outline-text-5" id="text-orga831211">
<ul class="org-ul">
<li>level<br />
<ul class="org-ul">
<li>Ideally same as solution length, must be at least as long. Number representing input length<br /></li>
</ul></li>
<li>solution<br />
<ul class="org-ul">
<li>The string that solves the firewall<br /></li>
</ul></li>
<li>additionalTime<br />
<ul class="org-ul">
<li>How much time is added at each analyze step<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9471379" class="outline-5">
<h5 id="org9471379">Example</h5>
<div class="outline-text-5" id="text-org9471379">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">firewall</span>
    <span style="color: #cae682;">level</span>=<span style="color: #95e454;">"6"</span>
    <span style="color: #cae682;">solution</span>=<span style="color: #95e454;">"Scypio"</span>
    <span style="color: #cae682;">additionalTime</span>=<span style="color: #95e454;">"1.0"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org503b0bb" class="outline-4">
<h4 id="org503b0bb">trace</h4>
<div class="outline-text-4" id="text-org503b0bb">
<p>
Creates (or negates) a trace.<br />
</p>
</div>
<div id="outline-container-org47c1f49" class="outline-5">
<h5 id="org47c1f49">Attributes</h5>
<div class="outline-text-5" id="text-org47c1f49">
<ul class="org-ul">
<li>time<br />
<ul class="org-ul">
<li>The length of the trace in seconds, -1 to remove<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org379d93c" class="outline-5">
<h5 id="org379d93c">Example</h5>
<div class="outline-text-5" id="text-org379d93c">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">trace</span> <span style="color: #cae682;">time</span>=<span style="color: #95e454;">"5678"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4dd98d4" class="outline-4">
<h4 id="org4dd98d4">admin</h4>
<div class="outline-text-4" id="text-org4dd98d4">
<p>
Creates an admin who monitors the computer.<br />
</p>
</div>
<div id="outline-container-org5bb44f9" class="outline-5">
<h5 id="org5bb44f9">Attributes</h5>
<div class="outline-text-5" id="text-org5bb44f9">
<ul class="org-ul">
<li>type<br />
<ul class="org-ul">
<li>none: Remove auto-generated admin by security<br /></li>
<li>basic: Resets everything after ~15 seconds<br /></li>
<li>progress: Resets if the player is not admin<br /></li>
<li>fast: Resets always? Unsure, unspecified<br /></li>
</ul></li>
<li>resetPassword<br /></li>
<li>isSuper<br />
<ul class="org-ul">
<li>Whether or not the player gets admin removed once achieving admin.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc0ebe47" class="outline-5">
<h5 id="orgc0ebe47">Example</h5>
<div class="outline-text-5" id="text-orgc0ebe47">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">admin</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fast"</span>
    <span style="color: #cae682;">resetPassword</span>=<span style="color: #95e454;">"false"</span>
    <span style="color: #cae682;">isSuper</span>=<span style="color: #95e454;">"false"</span>/&gt;
&lt;<span style="color: #cae682;">admin</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fast"</span>
    <span style="color: #cae682;">resetPassword</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">isSuper</span>=<span style="color: #95e454;">"true"</span> /&gt;
&lt;<span style="color: #cae682;">admin</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"progress"</span> /&gt;
&lt;<span style="color: #cae682;">admin</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"none"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org857c031" class="outline-4">
<h4 id="org857c031">portRemap</h4>
<div class="outline-text-4" id="text-org857c031">
<p>
Remaps default port values to custom values.<br />
Comma-separated list of remappings<br />
Left-hand side is default port value or name (ssh,ftp,web,torrent,medical,smtp,sql)<br />
</p>
</div>
<div id="outline-container-orgf9eed0d" class="outline-5">
<h5 id="orgf9eed0d">Example</h5>
<div class="outline-text-5" id="text-orgf9eed0d">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">portRemap</span>&gt;web=1234,22=2&lt;/<span style="color: #cae682;">portRemap</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc7c0d45" class="outline-4">
<h4 id="orgc7c0d45">tracker</h4>
<div class="outline-text-4" id="text-orgc7c0d45">
<p>
Does the player get hacked if they leave logs downloading/deleting files?<br />
Empty tag, no attributes or elements (&lt;tracker /&gt;)<br />
Attempts to reset player by default, or ETAS if "CSEC_Member" flag is attached.<br />
</p>
</div>
<div id="outline-container-orgd37b642" class="outline-5">
<h5 id="orgd37b642">Example</h5>
<div class="outline-text-5" id="text-orgd37b642">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">tracker</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org1c4cc5e" class="outline-3">
<h3 id="org1c4cc5e">Links and Positioning</h3>
<div class="outline-text-3" id="text-org1c4cc5e">
</div>
<div id="outline-container-org76ea11c" class="outline-4">
<h4 id="org76ea11c">dlink</h4>
<div class="outline-text-4" id="text-org76ea11c">
<p>
Represents a direct link towards another computer (for scanning)<br />
Multiple dlink tags supported<br />
</p>
</div>
