FeatureList.org
*** eosDevice
    An EOS device can have internal note, mail, and file tags.
    Note filenames are generated automatically by taking the first line of the file and replacing spaces with underscores.
    Mail tags have no contents - just the user information.
    Files are meant for jailbroken phones, with notes for ordinary usage.
**** Attributes
     + name
       - The name of the EOS device. Displayed to the player.
     + id
       - The id of the EOS device. Used to reference it elsewhere.
     + icon
       - The icon displayed for the EOS device. Reasonable options are "tablet", "ePhone", and "ePhone2".
     + empty
       - Whether or not junk files are generated for the phone
     + passOverride
       - A custom password that isn't "alpine"
**** <mail> attributes
     + username
       - The username of the email account
     + pass
       - The password to the email account
**** Example
     #+BEGIN_SRC nxml
       <eosDevice
	   name="Deliliah's ePhone 4S"
	   id="eosIntroPhone"
	   icon="ePhone2"
	   empty="true"
	   passOverride="notAlpine">

	 <note>TestNote
       More text</note>

	 <note>Note filenames
       Note filenames are generated automatically by taking the first line of the file
       (in this case "Note Filenames") and replacing spaces with underscores.</note>

	 <mail
	     username="test@jmail.com"
	     pass="thisIstheaccountpass" />
	 <mail
	     username="test2@jmail.com"
	     pass="YouCanHaveLotsOfThese" />
  
	 <file
	     path="eos/test"
	     name="crackedFile.txt">This is mostly useful forjailbroken phones</file>
       </eosDevice>
#+END_SRC
*** positionNear
    Positions the computer near the target for cool networks.
**** Attributes
     + target
       - The ID of the target computer
     + position
       - Which position out of the total radially positioned options it fills
     + total
       - How many radially surrounding nodes are possible
     + extraDistance
       - Recommended between -0.6 and 0.3
     + force
       - Prevents stability check to ensure that it is placed close.
**** Example
     #+BEGIN_SRC nxml
       <positionNear
	   target="advExamplePC2"
	   position="1"
	   total="3"
	   extraDistance="0.1"
	   force="false"/>
     #+END_SRC
** Files
*** file
   Contents of the file are internal text.
**** Attributes
     + path
       - The path to the file
       - Can create subfolders like home/sub1/sub2
     + name
       - The name of the file
**** Example
     #+BEGIN_SRC nxml
       <file
	   path="home/NewDirectory"
	   name="Test_File">
       This is a longer file that also creates a new directory
       by adding something to path.

	   #BINARY#

	   test test
	 </file>
     #+END_SRC
*** customthemefile
    Link to a custom theme file found on the computer.
**** Attributes
     + path
       - The path to the file
     + name
       - The name of the file
       - Traditionally ends in .sys
     + themePath
       - A filepath to the custom theme xml file
**** Example
     #+BEGIN_SRC nxml
       <customthemefile
	   path="sys"
	   name="Custom_x-server.sys"
	   themePath="Themes/TestTheme2.xml"/>
     #+END_SRC
*** encryptedFile
    Encrypted files can be deciphered DECHead and Decypher
**** Attributes
     + path
       - The path to the file
       - Can create subfolders like home/sub1/sub2
     + name
       - The name of the file
       - End with .dec
     + extension
       - The extension the encrypted file will have once decrypted
     + ip
       - The ip address at which the file was created/encrypted
       - 192.168.1.1 or localhost are good defaults
     + header
       - The header of the file revealed by DECHead
     + pass
       - The password for the encrypted file.
       - If omitted, decryption requires no password.
**** Example
     #+BEGIN_SRC nxml
       <encryptedFile
	   path="home"
	   name="encrypted_File.dec"
	   extension=".txt"
	   ip="192.168.1.1"
	   header="This is the header"
	   pass="decryptionPassword"> This generates an encrypted file that can be
	   decrypted using the password above. It decrypts to have the extension .txt
       </encryptedFile>

       <encryptedFile
	   path="home"
	   name="easy_encrypted_File.dec"
	   ip="192.168.1.1"
	   header="This is the header"> By simply not providing a password like
       this one, it can be decrypted without a password
       </encryptedFile>

       <encryptedFile
	   path="home"
	   name="asdf2.dec"
	   ip="192.168.1.1"
	   header="This is the header"
	   pass="password"> This is an encrypted file referenced in ExampleMission.xml
       </encryptedFile>
     #+END_SRC
