index.html
<div id="outline-container-org5bab146" class="outline-5">
<h5 id="org5bab146">Attributes</h5>
<div class="outline-text-5" id="text-org5bab146">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf9c0630" class="outline-5">
<h5 id="orgf9c0630">Example</h5>
<div class="outline-text-5" id="text-orgf9c0630">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">dlink</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC2"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org79b1cf4" class="outline-4">
<h4 id="org79b1cf4">eosDevice</h4>
<div class="outline-text-4" id="text-org79b1cf4">
<p>
An EOS device can have internal note, mail, and file tags.<br />
Note filenames are generated automatically by taking the first line of the file and replacing spaces with underscores.<br />
Mail tags have no contents - just the user information.<br />
Files are meant for jailbroken phones, with notes for ordinary usage.<br />
</p>
</div>
<div id="outline-container-org8afaaab" class="outline-5">
<h5 id="org8afaaab">Attributes</h5>
<div class="outline-text-5" id="text-org8afaaab">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The name of the EOS device. Displayed to the player.<br /></li>
</ul></li>
<li>id<br />
<ul class="org-ul">
<li>The id of the EOS device. Used to reference it elsewhere.<br /></li>
</ul></li>
<li>icon<br />
<ul class="org-ul">
<li>The icon displayed for the EOS device. Reasonable options are "tablet", "ePhone", and "ePhone2".<br /></li>
</ul></li>
<li>empty<br />
<ul class="org-ul">
<li>Whether or not junk files are generated for the phone<br /></li>
</ul></li>
<li>passOverride<br />
<ul class="org-ul">
<li>A custom password that isn't "alpine"<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3a1675b" class="outline-5">
<h5 id="org3a1675b">&lt;mail&gt; attributes</h5>
<div class="outline-text-5" id="text-org3a1675b">
<ul class="org-ul">
<li>username<br />
<ul class="org-ul">
<li>The username of the email account<br /></li>
</ul></li>
<li>pass<br />
<ul class="org-ul">
<li>The password to the email account<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org89b66e9" class="outline-5">
<h5 id="org89b66e9">Example</h5>
<div class="outline-text-5" id="text-org89b66e9">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">eosDevice</span>
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Deliliah's ePhone 4S"</span>
    <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"eosIntroPhone"</span>
    <span style="color: #cae682;">icon</span>=<span style="color: #95e454;">"ePhone2"</span>
    <span style="color: #cae682;">empty</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">passOverride</span>=<span style="color: #95e454;">"notAlpine"</span>&gt;

  &lt;<span style="color: #cae682;">note</span>&gt;TestNote
More text&lt;/<span style="color: #cae682;">note</span>&gt;

  &lt;<span style="color: #cae682;">note</span>&gt;Note filenames
Note filenames are generated automatically by taking the first line of the file
(in this case "Note Filenames") and replacing spaces with underscores.&lt;/<span style="color: #cae682;">note</span>&gt;

  &lt;<span style="color: #cae682;">mail</span>
      <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"test@jmail.com"</span>
      <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"thisIstheaccountpass"</span> /&gt;
  &lt;<span style="color: #cae682;">mail</span>
      <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"test2@jmail.com"</span>
      <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"YouCanHaveLotsOfThese"</span> /&gt;

  &lt;<span style="color: #cae682;">file</span>
      <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"eos/test"</span>
      <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"crackedFile.txt"</span>&gt;This is mostly useful forjailbroken phones&lt;/<span style="color: #cae682;">file</span>&gt;
&lt;/<span style="color: #cae682;">eosDevice</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org41085e0" class="outline-4">
<h4 id="org41085e0">positionNear</h4>
<div class="outline-text-4" id="text-org41085e0">
<p>
Positions the computer near the target for cool networks.<br />
</p>
</div>
<div id="outline-container-org068a945" class="outline-5">
<h5 id="org068a945">Attributes</h5>
<div class="outline-text-5" id="text-org068a945">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>position<br />
<ul class="org-ul">
<li>Which position out of the total radially positioned options it fills<br /></li>
</ul></li>
<li>total<br />
<ul class="org-ul">
<li>How many radially surrounding nodes are possible<br /></li>
</ul></li>
<li>extraDistance<br />
<ul class="org-ul">
<li>Recommended between -0.6 and 0.3<br /></li>
</ul></li>
<li>force<br />
<ul class="org-ul">
<li>Prevents stability check to ensure that it is placed close.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org47330cf" class="outline-5">
<h5 id="org47330cf">Example</h5>
<div class="outline-text-5" id="text-org47330cf">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">positionNear</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC2"</span>
    <span style="color: #cae682;">position</span>=<span style="color: #95e454;">"1"</span>
    <span style="color: #cae682;">total</span>=<span style="color: #95e454;">"3"</span>
    <span style="color: #cae682;">extraDistance</span>=<span style="color: #95e454;">"0.1"</span>
    <span style="color: #cae682;">force</span>=<span style="color: #95e454;">"false"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbde2ba6" class="outline-3">
<h3 id="orgbde2ba6">Files</h3>
<div class="outline-text-3" id="text-orgbde2ba6">
</div>
<div id="outline-container-org4f95803" class="outline-4">
<h4 id="org4f95803">file</h4>
<div class="outline-text-4" id="text-org4f95803">
<p>
Contents of the file are internal text.<br />
</p>
</div>
<div id="outline-container-org3b3a02e" class="outline-5">
<h5 id="org3b3a02e">Attributes</h5>
<div class="outline-text-5" id="text-org3b3a02e">
<ul class="org-ul">
<li>path<br />
<ul class="org-ul">
<li>The path to the file<br /></li>
<li>Can create subfolders like home/sub1/sub2<br /></li>
</ul></li>
<li>name<br />
<ul class="org-ul">
<li>The name of the file<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org25821b3" class="outline-5">
<h5 id="org25821b3">Example</h5>
<div class="outline-text-5" id="text-org25821b3">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">file</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home/NewDirectory"</span>
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Test_File"</span>&gt;
This is a longer file that also creates a new directory
by adding something to path.

    #BINARY#

    test test
  &lt;/<span style="color: #cae682;">file</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8228a69" class="outline-4">
<h4 id="org8228a69">customthemefile</h4>
<div class="outline-text-4" id="text-org8228a69">
<p>
Link to a custom theme file found on the computer.<br />
</p>
</div>
<div id="outline-container-org9b84d33" class="outline-5">
<h5 id="org9b84d33">Attributes</h5>
<div class="outline-text-5" id="text-org9b84d33">
<ul class="org-ul">
<li>path<br />
<ul class="org-ul">
<li>The path to the file<br /></li>
</ul></li>
<li>name<br />
<ul class="org-ul">
<li>The name of the file<br /></li>
<li>Traditionally ends in .sys<br /></li>
</ul></li>
<li>themePath<br />
<ul class="org-ul">
<li>A filepath to the custom theme xml file<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2994ca7" class="outline-5">
<h5 id="org2994ca7">Example</h5>
<div class="outline-text-5" id="text-org2994ca7">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">customthemefile</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span>
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Custom_x-server.sys"</span>
    <span style="color: #cae682;">themePath</span>=<span style="color: #95e454;">"Themes/TestTheme2.xml"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc402b48" class="outline-4">
<h4 id="orgc402b48">encryptedFile</h4>
<div class="outline-text-4" id="text-orgc402b48">
<p>
Encrypted files can be deciphered DECHead and Decypher<br />
</p>
</div>
<div id="outline-container-orgbe5ec9c" class="outline-5">
<h5 id="orgbe5ec9c">Attributes</h5>
<div class="outline-text-5" id="text-orgbe5ec9c">
<ul class="org-ul">
<li>path<br />
<ul class="org-ul">
<li>The path to the file<br /></li>
<li>Can create subfolders like home/sub1/sub2<br /></li>
</ul></li>
<li>name<br />
<ul class="org-ul">
<li>The name of the file<br /></li>
<li>End with .dec<br /></li>
</ul></li>
<li>extension<br />
<ul class="org-ul">
<li>The extension the encrypted file will have once decrypted<br /></li>
</ul></li>
<li>ip<br />
<ul class="org-ul">
<li>The ip address at which the file was created/encrypted<br /></li>
<li>192.168.1.1 or localhost are good defaults<br /></li>
</ul></li>
<li>header<br />
<ul class="org-ul">
<li>The header of the file revealed by DECHead<br /></li>
</ul></li>
<li>pass<br />
<ul class="org-ul">
<li>The password for the encrypted file.<br /></li>
<li>If omitted, decryption requires no password.<br /></li>
</ul></li>
</ul>
</div>
</div>
