FeatureList.org
**** Attributes
     + name
       - The name of the website displayed to the user
     + url
       - Can be either a local path or even an actual URL to the website
       - Real URLs are jank and may not work for everyone, so beware.
**** Example
     #+BEGIN_SRC nxml
       <addWebServer
	   name="Website Server"
	   url="Web/ExampleWebsite/ExampleWebsite.html" />
     #+END_SRC
*** messageBoard
    Creates a \el-style message board hosted on the computer
**** Attributes
     + name
       - The name of the message board
**** thread
     + Contains the filepath of the thread
     + Multiple threads supported
     + Create threads from the template thread, it's quite finicky
     + Thread File Details
       - Threads start with the threadID on their own line
       - > can be used to make the line of text quoted
       - Certain images are supported at the start of posts
	 * #Academic
	 * #Sun
	 * #Snake
	 * #Circle
	 * #Duck
	 * #Page
	 * #Speech
	 * #Mod
	 * #Chip
       - Lines separated by 42 dashes, including at end of file
**** Example
     #+BEGIN_SRC nxml
       <messageBoard name="Custom Board Name!">
	 <thread>Docs/MessageBoardThreads/ExampleThread1.txt</thread>
	 <thread>Docs/MessageBoardThreads/ExampleThread2.txt</thread>
       </messageBoard>
     #+END_SRC
*** mailServer
    Hosts a mail server on the computer.
    Populate with <email> tags as explained below, with the body as the contents of the tag
**** Attributes
     + name
       - The name of the mail server
     + color
       - An R,G,B string for the color
     + generateJunk
       - A true/false flag determining whether junk emails are generated
**** <email> attributes
     + recipient
       - The account receiving the email
     + sender
       - The account sending the email
     + subject
       - The subject of the email
**** Example
     #+BEGIN_SRC nxml
       <mailServer
	   name="Example Mail Server"
	   color="50,237,212"
	   generateJunk="true">

	   <email
	       recipient="mailGuy"
	       sender="Sender Guy"
	       subject="Adding an email!">
       This is how you add emails to the mail server - logging in with someone's account
       will show these just like the way the player gets emails.
	   </email>
    
	   <email
	       recipient="mailGuy"
	       sender="Spam"
	       subject="amazing features">
       You can have as many of these as you want
	   </email>
    
	   <email
	       recipient="Matt"
	       sender="Spam"
	       subject="re: amazing features">
       Different users too
	   </email>

	   <email
	       recipient="Matt"
	       sender="Spam"
	       subject="re: re: amazing features">
       The generateJunk flag will specify if this server will generate junk emails
       for non-player accounts on it.
	   </email>
       </mailServer>
     #+END_SRC
*** HeartMonitor
    If killed, flag PatientID:DEAD is added. But don't kill anyone - that is a basegame thing.
**** Attributes
     + Patient
       - Patient ID: firstname initial underscore
**** Example
     #+BEGIN_SRC nxml
       <HeartMonitor patient="J_Stalvern"/>
     #+END_SRC
*** PointClicker
    Creates a PointClicker game from the People.All list
**** Example
     #+BEGIN_SRC nxml
       <PointClicker />
     #+END_SRC
*** SongChangerDaemon
    Allows the user to interactively change their current song
**** Example
     #+BEGIN_SRC nxml
       <SongChangerDaemon />
     #+END_SRC
*** variableMissionListingServer
    This can be used for mission listing (e.g. Entropy) or other news sites (e.g. SlashBot)
**** Attributes
     + name
       - The name of the server
     + iconPath
       - A filepath to the icon for the server
     + articleFolderPath
       - A path to the folder containing the articles for this server
     + color
       - An R,G,B string for the color
     + assigner
       - When true, missions can be accepted
       - When false, missions cannot be accepted (e.g. news articles)
     + public
       - Whether user permission is necessary to view
     + title
       - The rendered title of the server
**** Example
     #+BEGIN_SRC nxml
       <variableMissionListingServer
	   name="example listing server"
	   iconPath="Logo.png"
	   articleFolderPath="Docs/ListingServerArticles"
	   color="120,200,2"
	   assigner="false"
	   public="true"
	   title="This is the rendered title of the server" />
     #+END_SRC
