index.html
<div id="outline-container-org17da9cc" class="outline-5">
<h5 id="org17da9cc">Attributes</h5>
<div class="outline-text-5" id="text-org17da9cc">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The name of the website displayed to the user<br /></li>
</ul></li>
<li>url<br />
<ul class="org-ul">
<li>Can be either a local path or even an actual URL to the website<br /></li>
<li>Real URLs are jank and may not work for everyone, so beware.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2768e91" class="outline-5">
<h5 id="org2768e91">Example</h5>
<div class="outline-text-5" id="text-org2768e91">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">addWebServer</span>
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Website Server"</span>
    <span style="color: #cae682;">url</span>=<span style="color: #95e454;">"Web/ExampleWebsite/ExampleWebsite.html"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org82c652e" class="outline-4">
<h4 id="org82c652e">messageBoard</h4>
<div class="outline-text-4" id="text-org82c652e">
<p>
Creates a \el-style message board hosted on the computer<br />
</p>
</div>
<div id="outline-container-orgd4048d6" class="outline-5">
<h5 id="orgd4048d6">Attributes</h5>
<div class="outline-text-5" id="text-orgd4048d6">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The name of the message board<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9605794" class="outline-5">
<h5 id="org9605794">thread</h5>
<div class="outline-text-5" id="text-org9605794">
<ul class="org-ul">
<li>Contains the filepath of the thread<br /></li>
<li>Multiple threads supported<br /></li>
<li>Create threads from the template thread, it's quite finicky<br /></li>
<li>Thread File Details<br />
<ul class="org-ul">
<li>Threads start with the threadID on their own line<br /></li>
<li>&gt; can be used to make the line of text quoted<br /></li>
<li>Certain images are supported at the start of posts<br />
<ul class="org-ul">
<li>#Academic<br /></li>
<li>#Sun<br /></li>
<li>#Snake<br /></li>
<li>#Circle<br /></li>
<li>#Duck<br /></li>
<li>#Page<br /></li>
<li>#Speech<br /></li>
<li>#Mod<br /></li>
<li>#Chip<br /></li>
</ul></li>
<li>Lines separated by 42 dashes, including at end of file<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org99d414f" class="outline-5">
<h5 id="org99d414f">Example</h5>
<div class="outline-text-5" id="text-org99d414f">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">messageBoard</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Custom Board Name!"</span>&gt;
  &lt;<span style="color: #cae682;">thread</span>&gt;Docs/MessageBoardThreads/ExampleThread1.txt&lt;/<span style="color: #cae682;">thread</span>&gt;
  &lt;<span style="color: #cae682;">thread</span>&gt;Docs/MessageBoardThreads/ExampleThread2.txt&lt;/<span style="color: #cae682;">thread</span>&gt;
&lt;/<span style="color: #cae682;">messageBoard</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcd66200" class="outline-4">
<h4 id="orgcd66200">mailServer</h4>
<div class="outline-text-4" id="text-orgcd66200">
<p>
Hosts a mail server on the computer.<br />
Populate with &lt;email&gt; tags as explained below, with the body as the contents of the tag<br />
</p>
</div>
<div id="outline-container-orgdf8c93a" class="outline-5">
<h5 id="orgdf8c93a">Attributes</h5>
<div class="outline-text-5" id="text-orgdf8c93a">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The name of the mail server<br /></li>
</ul></li>
<li>color<br />
<ul class="org-ul">
<li>An R,G,B string for the color<br /></li>
</ul></li>
<li>generateJunk<br />
<ul class="org-ul">
<li>A true/false flag determining whether junk emails are generated<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7ca2b03" class="outline-5">
<h5 id="org7ca2b03">&lt;email&gt; attributes</h5>
<div class="outline-text-5" id="text-org7ca2b03">
<ul class="org-ul">
<li>recipient<br />
<ul class="org-ul">
<li>The account receiving the email<br /></li>
</ul></li>
<li>sender<br />
<ul class="org-ul">
<li>The account sending the email<br /></li>
</ul></li>
<li>subject<br />
<ul class="org-ul">
<li>The subject of the email<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org258bfb7" class="outline-5">
<h5 id="org258bfb7">Example</h5>
<div class="outline-text-5" id="text-org258bfb7">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">mailServer</span>
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Example Mail Server"</span>
    <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"50,237,212"</span>
    <span style="color: #cae682;">generateJunk</span>=<span style="color: #95e454;">"true"</span>&gt;

    &lt;<span style="color: #cae682;">email</span>
        <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"mailGuy"</span>
        <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Sender Guy"</span>
        <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"Adding an email!"</span>&gt;
This is how you add emails to the mail server - logging in with someone's account
will show these just like the way the player gets emails.
    &lt;/<span style="color: #cae682;">email</span>&gt;

    &lt;<span style="color: #cae682;">email</span>
        <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"mailGuy"</span>
        <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Spam"</span>
        <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"amazing features"</span>&gt;
You can have as many of these as you want
    &lt;/<span style="color: #cae682;">email</span>&gt;

    &lt;<span style="color: #cae682;">email</span>
        <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"Matt"</span>
        <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Spam"</span>
        <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"re: amazing features"</span>&gt;
Different users too
    &lt;/<span style="color: #cae682;">email</span>&gt;

    &lt;<span style="color: #cae682;">email</span>
        <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"Matt"</span>
        <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Spam"</span>
        <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"re: re: amazing features"</span>&gt;
The generateJunk flag will specify if this server will generate junk emails
for non-player accounts on it.
    &lt;/<span style="color: #cae682;">email</span>&gt;
&lt;/<span style="color: #cae682;">mailServer</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0cd8ae5" class="outline-4">
<h4 id="org0cd8ae5">HeartMonitor</h4>
<div class="outline-text-4" id="text-org0cd8ae5">
<p>
If killed, flag PatientID:DEAD is added. But don't kill anyone - that is a basegame thing.<br />
</p>
</div>
<div id="outline-container-orgdbc0684" class="outline-5">
<h5 id="orgdbc0684">Attributes</h5>
<div class="outline-text-5" id="text-orgdbc0684">
<ul class="org-ul">
<li>Patient<br />
<ul class="org-ul">
<li>Patient ID: firstname initial underscore<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb6b3562" class="outline-5">
<h5 id="orgb6b3562">Example</h5>
<div class="outline-text-5" id="text-orgb6b3562">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">HeartMonitor</span> <span style="color: #cae682;">patient</span>=<span style="color: #95e454;">"J_Stalvern"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1a25cc8" class="outline-4">
<h4 id="org1a25cc8">PointClicker</h4>
<div class="outline-text-4" id="text-org1a25cc8">
<p>
Creates a PointClicker game from the People.All list<br />
</p>
</div>
<div id="outline-container-org2a8d55a" class="outline-5">
<h5 id="org2a8d55a">Example</h5>
<div class="outline-text-5" id="text-org2a8d55a">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">PointClicker</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3a59272" class="outline-4">
<h4 id="org3a59272">SongChangerDaemon</h4>
<div class="outline-text-4" id="text-org3a59272">
<p>
Allows the user to interactively change their current song<br />
</p>
</div>
<div id="outline-container-orgc13a89e" class="outline-5">
<h5 id="orgc13a89e">Example</h5>
<div class="outline-text-5" id="text-orgc13a89e">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">SongChangerDaemon</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2baadfa" class="outline-4">
<h4 id="org2baadfa">variableMissionListingServer</h4>
<div class="outline-text-4" id="text-org2baadfa">
<p>
This can be used for mission listing (e.g. Entropy) or other news sites (e.g. SlashBot)<br />
</p>
</div>
<div id="outline-container-org1ad4282" class="outline-5">
<h5 id="org1ad4282">Attributes</h5>
<div class="outline-text-5" id="text-org1ad4282">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The name of the server<br /></li>
</ul></li>
<li>iconPath<br />
<ul class="org-ul">
<li>A filepath to the icon for the server<br /></li>
</ul></li>
<li>articleFolderPath<br />
<ul class="org-ul">
<li>A path to the folder containing the articles for this server<br /></li>
</ul></li>
<li>color<br />
<ul class="org-ul">
<li>An R,G,B string for the color<br /></li>
</ul></li>
<li>assigner<br />
<ul class="org-ul">
<li>When true, missions can be accepted<br /></li>
<li>When false, missions cannot be accepted (e.g. news articles)<br /></li>
</ul></li>
<li>public<br />
<ul class="org-ul">
<li>Whether user permission is necessary to view<br /></li>
</ul></li>
<li>title<br />
<ul class="org-ul">
<li>The rendered title of the server<br /></li>
</ul></li>
</ul>
</div>
</div>
