FeatureList.org
*** missionHubServer
    Creates a CSEC-style mission board
**** Attributes
     + groupName
       - The name of the group associated with the mission hub
     + serviceName
       - The displayed name of the server
     + missionFolderPath
       - A filepath to the folder containing the missions for this hub
     + themeColor
       - An R,G,B string for the general color
     + lineColor
       - An R,G,B string for the color of the selected line
     + backgroundColor
       - An R,G,B string for the background color
     + allowAbandon
       - Whether the player can abandon taken missions
**** Example
     #+BEGIN_SRC nxml
       <missionHubServer
	   groupName="ExTech"
	   serviceName="Example Tech Contract Hub"
	   missionFolderPath="Missions/Misc"
	   themeColor="200,10,10"
	   lineColor="255,80,80"
	   backgroundColor="20,20,20"
	   allowAbandon="false"/>
     #+END_SRC
*** CreditsDaemon
    Loads the credits defined in home/CreditsData.txt
    %Super large text
    ^Kind of large text
**** Attributes
     + Title
       - The title of the credits daemon
     + ButtonText
       - The text on the button
     + ConditionalActionSetToRunOnButtonPressPath
       - A filepath to the action to perform on button press
**** Example
     #+BEGIN_SRC nxml
       <CreditsDaemon
	   Title="intro Extension Ending Credits"
	   ButtonText="Complete"
	   ConditionalActionSetToRunOnButtonPressPath="Actions/CreditsRunActions.xml"/>
     #+END_SRC
*** FastActionHost
    Optimized specifically for hosting delayable actions
    Use if performance issues arise, and *make sure this tag is first* under <Computer>!
**** Example
     #+BEGIN_SRC nxml
       <FastActionHost />
     #+END_SRC
** Labyrinths Daemons
*** DHSDaemon
    An IRC message board which can support missions and messages via factions.
    Has internal agent tags for other users
**** Attributes
     + groupName
       - The displayed name of the IRC server
     + addsFactionPointOnMissionComplete
       - Whether the player gains faction points on mission completion
     + autoClearMissionsOnPlayerComplete
       - Whether the missions get cleared after the player finishes theirs
     + themeColor
       - R,G,B string for the color of the selected line
     + allowContractAbbandon
       - Whether contracts can be abandoned
	 - Yes, it's misspelled.
**** <agent> attributes
     + name
       - The displayed name of the agent
     + pass
       - The password to sign in as the agent
     + color
       - R,G,B string for the username color
**** Example
     #+BEGIN_SRC nxml
       <DHSDaemon
	   groupName="NewFaction Hub"
	   addsFactionPointOnMissionComplete="true"
	   autoClearMissionsOanPlayerComplete="true"
	   themeColor="255, 255, 161"
	   allowContractAbbandon="false">

	 <agent
	     name="Tyson"
	     pass="rockemsockem"
	     color="209,74,48"/>

	 <agent
	     name="DependableSkeleton"
	     pass="d832n3msad"
	     color="112,198,255"/>

	 <agent
	     name="HA0"
	     pass="kolgateryu"
	     color="58,202,146"/>
       </DHSDaemon>
     #+END_SRC
*** CustomConnectDisplayDaemon
    Changes the default display to be similar to "ricer" in Labyrinths
**** Example
     #+BEGIN_SRC nxml
       <CustomConnectDisplayDaemon />
     #+END_SRC
*** LogoDaemon
    Displays a big, fancy logo with optional messages. Spinner as logo by default.
**** Attributes
     + Name
       - The name of the LogoDaemon
     + ShowsTitle
       - Whether the name of the LogoDaemon is displayed
     + TextColor
       - Transparency?,R,G,B string for the text color
     + LogoImagePath
       - A filepath to the image used for the logo
**** Example
     #+BEGIN_SRC nxml
       <LogoDaemon
	   Name="Logo Display Test"
	   ShowsTitle="true"
	   TextColor="0, 220, 220, 200"
	   LogoImagePath="Logo.png">
       Lines
       Here
       Appear under
       The Logo
       </LogoDaemon>
     #+END_SRC
*** LogoCustomConnectDisplayDaemon
    A custom connect display also with a nameplate logo and title image
