index.html
<div id="outline-container-org13a873a" class="outline-5">
<h5 id="org13a873a">Example</h5>
<div class="outline-text-5" id="text-org13a873a">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">variableMissionListingServer</span>
    <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"example listing server"</span>
    <span style="color: #cae682;">iconPath</span>=<span style="color: #95e454;">"Logo.png"</span>
    <span style="color: #cae682;">articleFolderPath</span>=<span style="color: #95e454;">"Docs/ListingServerArticles"</span>
    <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"120,200,2"</span>
    <span style="color: #cae682;">assigner</span>=<span style="color: #95e454;">"false"</span>
    <span style="color: #cae682;">public</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"This is the rendered title of the server"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org39ebb53" class="outline-4">
<h4 id="org39ebb53">missionHubServer</h4>
<div class="outline-text-4" id="text-org39ebb53">
<p>
Creates a CSEC-style mission board<br />
</p>
</div>
<div id="outline-container-org7f1609a" class="outline-5">
<h5 id="org7f1609a">Attributes</h5>
<div class="outline-text-5" id="text-org7f1609a">
<ul class="org-ul">
<li>groupName<br />
<ul class="org-ul">
<li>The name of the group associated with the mission hub<br /></li>
</ul></li>
<li>serviceName<br />
<ul class="org-ul">
<li>The displayed name of the server<br /></li>
</ul></li>
<li>missionFolderPath<br />
<ul class="org-ul">
<li>A filepath to the folder containing the missions for this hub<br /></li>
</ul></li>
<li>themeColor<br />
<ul class="org-ul">
<li>An R,G,B string for the general color<br /></li>
</ul></li>
<li>lineColor<br />
<ul class="org-ul">
<li>An R,G,B string for the color of the selected line<br /></li>
</ul></li>
<li>backgroundColor<br />
<ul class="org-ul">
<li>An R,G,B string for the background color<br /></li>
</ul></li>
<li>allowAbandon<br />
<ul class="org-ul">
<li>Whether the player can abandon taken missions<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org68cfd50" class="outline-5">
<h5 id="org68cfd50">Example</h5>
<div class="outline-text-5" id="text-org68cfd50">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">missionHubServer</span>
    <span style="color: #cae682;">groupName</span>=<span style="color: #95e454;">"ExTech"</span>
    <span style="color: #cae682;">serviceName</span>=<span style="color: #95e454;">"Example Tech Contract Hub"</span>
    <span style="color: #cae682;">missionFolderPath</span>=<span style="color: #95e454;">"Missions/Misc"</span>
    <span style="color: #cae682;">themeColor</span>=<span style="color: #95e454;">"200,10,10"</span>
    <span style="color: #cae682;">lineColor</span>=<span style="color: #95e454;">"255,80,80"</span>
    <span style="color: #cae682;">backgroundColor</span>=<span style="color: #95e454;">"20,20,20"</span>
    <span style="color: #cae682;">allowAbandon</span>=<span style="color: #95e454;">"false"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdfec55b" class="outline-4">
<h4 id="orgdfec55b">CreditsDaemon</h4>
<div class="outline-text-4" id="text-orgdfec55b">
<p>
Loads the credits defined in home/CreditsData.txt<br />
%Super large text<br />
^Kind of large text<br />
</p>
</div>
<div id="outline-container-orgb17efad" class="outline-5">
<h5 id="orgb17efad">Attributes</h5>
<div class="outline-text-5" id="text-orgb17efad">
<ul class="org-ul">
<li>Title<br />
<ul class="org-ul">
<li>The title of the credits daemon<br /></li>
</ul></li>
<li>ButtonText<br />
<ul class="org-ul">
<li>The text on the button<br /></li>
</ul></li>
<li>ConditionalActionSetToRunOnButtonPressPath<br />
<ul class="org-ul">
<li>A filepath to the action to perform on button press<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org02219bb" class="outline-5">
<h5 id="org02219bb">Example</h5>
<div class="outline-text-5" id="text-org02219bb">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">CreditsDaemon</span>
    <span style="color: #cae682;">Title</span>=<span style="color: #95e454;">"intro Extension Ending Credits"</span>
    <span style="color: #cae682;">ButtonText</span>=<span style="color: #95e454;">"Complete"</span>
    <span style="color: #cae682;">ConditionalActionSetToRunOnButtonPressPath</span>=<span style="color: #95e454;">"Actions/CreditsRunActions.xml"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfb673cd" class="outline-4">
<h4 id="orgfb673cd">FastActionHost</h4>
<div class="outline-text-4" id="text-orgfb673cd">
<p>
Optimized specifically for hosting delayable actions<br />
Use if performance issues arise, and <b>make sure this tag is first</b> under &lt;Computer&gt;!<br />
</p>
</div>
<div id="outline-container-org26207f7" class="outline-5">
<h5 id="org26207f7">Example</h5>
<div class="outline-text-5" id="text-org26207f7">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">FastActionHost</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org3172179" class="outline-3">
<h3 id="org3172179">Labyrinths Daemons</h3>
<div class="outline-text-3" id="text-org3172179">
</div>
<div id="outline-container-orgf0d614f" class="outline-4">
<h4 id="orgf0d614f">DHSDaemon</h4>
<div class="outline-text-4" id="text-orgf0d614f">
<p>
An IRC message board which can support missions and messages via factions.<br />
Has internal agent tags for other users<br />
</p>
</div>
<div id="outline-container-orgc0a2aa8" class="outline-5">
<h5 id="orgc0a2aa8">Attributes</h5>
<div class="outline-text-5" id="text-orgc0a2aa8">
<ul class="org-ul">
<li>groupName<br />
<ul class="org-ul">
<li>The displayed name of the IRC server<br /></li>
</ul></li>
<li>addsFactionPointOnMissionComplete<br />
<ul class="org-ul">
<li>Whether the player gains faction points on mission completion<br /></li>
</ul></li>
<li>autoClearMissionsOnPlayerComplete<br />
<ul class="org-ul">
<li>Whether the missions get cleared after the player finishes theirs<br /></li>
</ul></li>
<li>themeColor<br />
<ul class="org-ul">
<li>R,G,B string for the color of the selected line<br /></li>
</ul></li>
<li>allowContractAbbandon<br />
<ul class="org-ul">
<li>Whether contracts can be abandoned<br />
<ul class="org-ul">
<li>Yes, it's misspelled.<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga188ec2" class="outline-5">
<h5 id="orga188ec2">&lt;agent&gt; attributes</h5>
<div class="outline-text-5" id="text-orga188ec2">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The displayed name of the agent<br /></li>
</ul></li>
<li>pass<br />
<ul class="org-ul">
<li>The password to sign in as the agent<br /></li>
</ul></li>
<li>color<br />
<ul class="org-ul">
<li>R,G,B string for the username color<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8c7fb69" class="outline-5">
<h5 id="org8c7fb69">Example</h5>
<div class="outline-text-5" id="text-org8c7fb69">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">DHSDaemon</span>
    <span style="color: #cae682;">groupName</span>=<span style="color: #95e454;">"NewFaction Hub"</span>
    <span style="color: #cae682;">addsFactionPointOnMissionComplete</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">autoClearMissionsOanPlayerComplete</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">themeColor</span>=<span style="color: #95e454;">"255, 255, 161"</span>
    <span style="color: #cae682;">allowContractAbbandon</span>=<span style="color: #95e454;">"false"</span>&gt;

  &lt;<span style="color: #cae682;">agent</span>
      <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Tyson"</span>
      <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"rockemsockem"</span>
      <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"209,74,48"</span>/&gt;

  &lt;<span style="color: #cae682;">agent</span>
      <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
      <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"d832n3msad"</span>
      <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"112,198,255"</span>/&gt;

  &lt;<span style="color: #cae682;">agent</span>
      <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"HA0"</span>
      <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"kolgateryu"</span>
      <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"58,202,146"</span>/&gt;
&lt;/<span style="color: #cae682;">DHSDaemon</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf893cc2" class="outline-4">
<h4 id="orgf893cc2">CustomConnectDisplayDaemon</h4>
<div class="outline-text-4" id="text-orgf893cc2">
<p>
Changes the default display to be similar to "ricer" in Labyrinths<br />
</p>
</div>
<div id="outline-container-orgb40d340" class="outline-5">
<h5 id="orgb40d340">Example</h5>
<div class="outline-text-5" id="text-orgb40d340">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">CustomConnectDisplayDaemon</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9faee83" class="outline-4">
<h4 id="org9faee83">LogoDaemon</h4>
<div class="outline-text-4" id="text-org9faee83">
<p>
Displays a big, fancy logo with optional messages. Spinner as logo by default.<br />
</p>
</div>
<div id="outline-container-org918e5de" class="outline-5">
<h5 id="org918e5de">Attributes</h5>
<div class="outline-text-5" id="text-org918e5de">
<ul class="org-ul">
<li>Name<br />
<ul class="org-ul">
<li>The name of the LogoDaemon<br /></li>
</ul></li>
<li>ShowsTitle<br />
<ul class="org-ul">
<li>Whether the name of the LogoDaemon is displayed<br /></li>
</ul></li>
<li>TextColor<br />
<ul class="org-ul">
<li>Transparency?,R,G,B string for the text color<br /></li>
</ul></li>
<li>LogoImagePath<br />
<ul class="org-ul">
<li>A filepath to the image used for the logo<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7a00aa4" class="outline-5">
<h5 id="org7a00aa4">Example</h5>
<div class="outline-text-5" id="text-org7a00aa4">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">LogoDaemon</span>
    <span style="color: #cae682;">Name</span>=<span style="color: #95e454;">"Logo Display Test"</span>
    <span style="color: #cae682;">ShowsTitle</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">TextColor</span>=<span style="color: #95e454;">"0, 220, 220, 200"</span>
    <span style="color: #cae682;">LogoImagePath</span>=<span style="color: #95e454;">"Logo.png"</span>&gt;
Lines
Here
Appear under
The Logo
&lt;/<span style="color: #cae682;">LogoDaemon</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga214510" class="outline-4">
<h4 id="orga214510">LogoCustomConnectDisplayDaemon</h4>
<div class="outline-text-4" id="text-orga214510">
<p>
A custom connect display also with a nameplate logo and title image<br />
</p>
</div>
