FeatureList.org
**** Attributes
     + logo
       - A filepath to the logo image
     + title
       - A filepath to a title image?
     + overdrawLogo
       - No idea, test it out and update this
     + buttonAlignment
       - Where the button is aligned; options of "left", "middle", and "right"
**** Example
     #+BEGIN_SRC nxml
       <LogoCustomConnectDisplayDaemon
	   logo="Logo.png"
	   title="Logo.png"
	   overdrawLogo="true"
	   buttonAlignment="left" />
     #+END_SRC
*** IRCDaemon
    Used for an IRC daemon without associated missions.
**** Attributes
     + themeColor
       - R,G,B string for the color of the selected line
     + name
       - The displayed name of the IRC channel
     + needsLogin
       - Whether the player must login to use the IRC
**** <user> attributes
     + name
       - The displayed name of the user
     + color
       - R,G,B string for the color of the user's displayed name
**** <post> attributes
     + user
       - Which user made the IRC post
**** Example
     #+BEGIN_SRC nxml
       <IRCDaemon themeColor="67,204,148" name="Misc IRC Channel" needsLogin="false">
	 <user name="Vegas" color="0,209,232"/>
	 <user name="bprm" color="202,98,0"/>
	 <user name="Care_ey" color="0,196,82"/>

	 <post user="Vegas">Post IRC Messages here!</post>
	 <post user="bprm">dont forget to set the users</post>
	 <post user="Care_ey">Yep, this can also be used in the faction scripts to
	 add messages etc to.</post>
	 <post user="Vegas">That's so cool!</post>
       </IRCDaemon>
     #+END_SRC
*** WhitelistAuthenticatorDaemon
    A server that protects either itself or other servers.
**** Attributes
     + SelfAuthenticating
       - Whether or not it protects itself with its own whitelist
       - If set to true, then it's pretty much unbreakable w/o scripts
     + Remote
       - The ID of the computer whose whitelist you check against
**** Example
     #+BEGIN_SRC nxml
       <WhitelistAuthenticatorDaemon SelfAuthenticating="false" />
       <WhitelistAuthenticatorDaemon Remote="RemoteServerID"/>
       <WhitelistAuthenticatorDaemon SelfAuthenticating="true"/>
     #+END_SRC
*** DatabaseDaemon
   Represents a database able to be read through by the player.
   No quotes are necessary for values of any element.
**** Attributes
     + Permissions
       - The permission access of the database
       - "private" is allowed, presumably "public" as well
     + DataType
       - The type of record that the database holds.
       - Supported types
	 * GitCommitEntry
	 * TextRecord
	 * OnlineAccount
	 * CAROData
	 * Account
	 * SurveillanceProfile
     + Foldername
       - The folder under which data entries are stored
     + Color
       - R,G,B string for the color of the database
     + AdminEmailAccount
       - The email address of the database admin
     + AdminEmailHostID
       - The email computer that hosts the admin's email account
     + Name
       - The name of the database
**** Supported Type Formats
     + GitCommitEntry
       - EntryNumber
	 * Integral value representing the commit number
       - ChangedFiles
	 * Format as <String>Filename.ext</String> representing the names of changed files
       - Message
	 * Commit message explaining what was changed
	 * Can start with REMOTE COMMIT: to represent from other IP (Not necessary but done in example
       - Username
	 * Who made the change
       - SourceIP
	 * IP of the computer committing the change
	 * 192.168.1.1 (Localhost) or something similar for local computer having made the change
     + TextRecord
       - Title
	 * The title of the record
       - Data
	 * The data associated with the record
     + OnlineAccount
       - ID
	 * The ID of the associated account
       - Username
	 * The username of the associated account
       - BanStatus
	 * A string representing whether the user is banned (e.g. "very yes")
       - Notes
	 * A string representing other notes about the account
     + CAROData
       - UserID
       - Headshots
       - Rank
       - Crowbars
       - InventoryID
       - BanStatus
     + Account
       - ID
       - Cash
       - Bank
       - Apartments
       - Vehicles
       - PegasusVehicles
       - Rank
       - RP
       - Kills
     + SurveillanceProfile
       - Name
       - Age
       - HomeCity
       - Notes
       - CriminalRecord
**** Example
     #+BEGIN_SRC nxml
       <DatabaseDaemon
	   Permissions="private"
	   DataType="GitCommitEntry"
	   Foldername="database"
	   Color="85,0,150"
	   AdminEmailAccount="Matt@TestExtensionMail.com"
	   AdminEmailHostID="advExamplePC"
	   Name="Test database">

	 <GitCommitEntry>
	   <EntryNumber>8613</EntryNumber>
	   <ChangedFiles>
	     <String>Neopals.php</String>
	   </ChangedFiles>
	   <Message>Reverted Minor updates because it broke everything</Message>
	   <UserName>T.Champer</UserName>
	   <SourceIP>192.168.1.1 (Localhost)</SourceIP>
	 </GitCommitEntry>

	 <GitCommitEntry>
	   <EntryNumber>8611</EntryNumber>
	   <ChangedFiles>
	     <String>Content.pak</String>
	   </ChangedFiles>
	   <Message>REMOTE COMMIT: Decreased pelvis bulge on Sparkle costume set :(</Message>
	   <UserName>A.Wallin</UserName>
	   <SourceIP>54.192.234.65</SourceIP>
	 </GitCommitEntry>

       </DatabaseDaemon>
     #+END_SRC
