index.html
<div id="outline-container-org6dc339c" class="outline-5">
<h5 id="org6dc339c">Attributes</h5>
<div class="outline-text-5" id="text-org6dc339c">
<ul class="org-ul">
<li>logo<br />
<ul class="org-ul">
<li>A filepath to the logo image<br /></li>
</ul></li>
<li>title<br />
<ul class="org-ul">
<li>A filepath to a title image?<br /></li>
</ul></li>
<li>overdrawLogo<br />
<ul class="org-ul">
<li>No idea, test it out and update this<br /></li>
</ul></li>
<li>buttonAlignment<br />
<ul class="org-ul">
<li>Where the button is aligned; options of "left", "middle", and "right"<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc87e4fa" class="outline-5">
<h5 id="orgc87e4fa">Example</h5>
<div class="outline-text-5" id="text-orgc87e4fa">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">LogoCustomConnectDisplayDaemon</span>
    <span style="color: #cae682;">logo</span>=<span style="color: #95e454;">"Logo.png"</span>
    <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"Logo.png"</span>
    <span style="color: #cae682;">overdrawLogo</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">buttonAlignment</span>=<span style="color: #95e454;">"left"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3c933a8" class="outline-4">
<h4 id="org3c933a8">IRCDaemon</h4>
<div class="outline-text-4" id="text-org3c933a8">
<p>
Used for an IRC daemon without associated missions.<br />
</p>
</div>
<div id="outline-container-org37c2858" class="outline-5">
<h5 id="org37c2858">Attributes</h5>
<div class="outline-text-5" id="text-org37c2858">
<ul class="org-ul">
<li>themeColor<br />
<ul class="org-ul">
<li>R,G,B string for the color of the selected line<br /></li>
</ul></li>
<li>name<br />
<ul class="org-ul">
<li>The displayed name of the IRC channel<br /></li>
</ul></li>
<li>needsLogin<br />
<ul class="org-ul">
<li>Whether the player must login to use the IRC<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6b12463" class="outline-5">
<h5 id="org6b12463">&lt;user&gt; attributes</h5>
<div class="outline-text-5" id="text-org6b12463">
<ul class="org-ul">
<li>name<br />
<ul class="org-ul">
<li>The displayed name of the user<br /></li>
</ul></li>
<li>color<br />
<ul class="org-ul">
<li>R,G,B string for the color of the user's displayed name<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc069618" class="outline-5">
<h5 id="orgc069618">&lt;post&gt; attributes</h5>
<div class="outline-text-5" id="text-orgc069618">
<ul class="org-ul">
<li>user<br />
<ul class="org-ul">
<li>Which user made the IRC post<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0f7a308" class="outline-5">
<h5 id="org0f7a308">Example</h5>
<div class="outline-text-5" id="text-org0f7a308">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">IRCDaemon</span> <span style="color: #cae682;">themeColor</span>=<span style="color: #95e454;">"67,204,148"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Misc IRC Channel"</span> <span style="color: #cae682;">needsLogin</span>=<span style="color: #95e454;">"false"</span>&gt;
  &lt;<span style="color: #cae682;">user</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Vegas"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"0,209,232"</span>/&gt;
  &lt;<span style="color: #cae682;">user</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"bprm"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"202,98,0"</span>/&gt;
  &lt;<span style="color: #cae682;">user</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Care_ey"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"0,196,82"</span>/&gt;

  &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"Vegas"</span>&gt;Post IRC Messages here!&lt;/<span style="color: #cae682;">post</span>&gt;
  &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"bprm"</span>&gt;dont forget to set the users&lt;/<span style="color: #cae682;">post</span>&gt;
  &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"Care_ey"</span>&gt;Yep, this can also be used in the faction scripts to
  add messages etc to.&lt;/<span style="color: #cae682;">post</span>&gt;
  &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"Vegas"</span>&gt;That's so cool!&lt;/<span style="color: #cae682;">post</span>&gt;
&lt;/<span style="color: #cae682;">IRCDaemon</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org194454c" class="outline-4">
<h4 id="org194454c">WhitelistAuthenticatorDaemon</h4>
<div class="outline-text-4" id="text-org194454c">
<p>
A server that protects either itself or other servers.<br />
</p>
</div>
<div id="outline-container-orgd0d5f6f" class="outline-5">
<h5 id="orgd0d5f6f">Attributes</h5>
<div class="outline-text-5" id="text-orgd0d5f6f">
<ul class="org-ul">
<li>SelfAuthenticating<br />
<ul class="org-ul">
<li>Whether or not it protects itself with its own whitelist<br /></li>
<li>If set to true, then it's pretty much unbreakable w/o scripts<br /></li>
</ul></li>
<li>Remote<br />
<ul class="org-ul">
<li>The ID of the computer whose whitelist you check against<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcde1cd6" class="outline-5">
<h5 id="orgcde1cd6">Example</h5>
<div class="outline-text-5" id="text-orgcde1cd6">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">WhitelistAuthenticatorDaemon</span> <span style="color: #cae682;">SelfAuthenticating</span>=<span style="color: #95e454;">"false"</span> /&gt;
&lt;<span style="color: #cae682;">WhitelistAuthenticatorDaemon</span> <span style="color: #cae682;">Remote</span>=<span style="color: #95e454;">"RemoteServerID"</span>/&gt;
&lt;<span style="color: #cae682;">WhitelistAuthenticatorDaemon</span> <span style="color: #cae682;">SelfAuthenticating</span>=<span style="color: #95e454;">"true"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5556d74" class="outline-4">
<h4 id="org5556d74">DatabaseDaemon</h4>
<div class="outline-text-4" id="text-org5556d74">
<p>
Represents a database able to be read through by the player.<br />
No quotes are necessary for values of any element.<br />
</p>
</div>
<div id="outline-container-org7f10348" class="outline-5">
<h5 id="org7f10348">Attributes</h5>
<div class="outline-text-5" id="text-org7f10348">
<ul class="org-ul">
<li>Permissions<br />
<ul class="org-ul">
<li>The permission access of the database<br /></li>
<li>"private" is allowed, presumably "public" as well<br /></li>
</ul></li>
<li>DataType<br />
<ul class="org-ul">
<li>The type of record that the database holds.<br /></li>
<li>Supported types<br />
<ul class="org-ul">
<li>GitCommitEntry<br /></li>
<li>TextRecord<br /></li>
<li>OnlineAccount<br /></li>
<li>CAROData<br /></li>
<li>Account<br /></li>
<li>SurveillanceProfile<br /></li>
</ul></li>
</ul></li>
<li>Foldername<br />
<ul class="org-ul">
<li>The folder under which data entries are stored<br /></li>
</ul></li>
<li>Color<br />
<ul class="org-ul">
<li>R,G,B string for the color of the database<br /></li>
</ul></li>
<li>AdminEmailAccount<br />
<ul class="org-ul">
<li>The email address of the database admin<br /></li>
</ul></li>
<li>AdminEmailHostID<br />
<ul class="org-ul">
<li>The email computer that hosts the admin's email account<br /></li>
</ul></li>
<li>Name<br />
<ul class="org-ul">
<li>The name of the database<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0d7f436" class="outline-5">
<h5 id="org0d7f436">Supported Type Formats</h5>
<div class="outline-text-5" id="text-org0d7f436">
<ul class="org-ul">
<li>GitCommitEntry<br />
<ul class="org-ul">
<li>EntryNumber<br />
<ul class="org-ul">
<li>Integral value representing the commit number<br /></li>
</ul></li>
<li>ChangedFiles<br />
<ul class="org-ul">
<li>Format as &lt;String&gt;Filename.ext&lt;/String&gt; representing the names of changed files<br /></li>
</ul></li>
<li>Message<br />
<ul class="org-ul">
<li>Commit message explaining what was changed<br /></li>
<li>Can start with REMOTE COMMIT: to represent from other IP (Not necessary but done in example<br /></li>
</ul></li>
<li>Username<br />
<ul class="org-ul">
<li>Who made the change<br /></li>
</ul></li>
<li>SourceIP<br />
<ul class="org-ul">
<li>IP of the computer committing the change<br /></li>
<li>192.168.1.1 (Localhost) or something similar for local computer having made the change<br /></li>
</ul></li>
</ul></li>
<li>TextRecord<br />
<ul class="org-ul">
<li>Title<br />
<ul class="org-ul">
<li>The title of the record<br /></li>
</ul></li>
<li>Data<br />
<ul class="org-ul">
<li>The data associated with the record<br /></li>
</ul></li>
</ul></li>
<li>OnlineAccount<br />
<ul class="org-ul">
<li>ID<br />
<ul class="org-ul">
<li>The ID of the associated account<br /></li>
</ul></li>
<li>Username<br />
<ul class="org-ul">
<li>The username of the associated account<br /></li>
</ul></li>
<li>BanStatus<br />
<ul class="org-ul">
<li>A string representing whether the user is banned (e.g. "very yes")<br /></li>
</ul></li>
<li>Notes<br />
<ul class="org-ul">
<li>A string representing other notes about the account<br /></li>
</ul></li>
</ul></li>
<li>CAROData<br />
<ul class="org-ul">
<li>UserID<br /></li>
<li>Headshots<br /></li>
<li>Rank<br /></li>
<li>Crowbars<br /></li>
<li>InventoryID<br /></li>
<li>BanStatus<br /></li>
</ul></li>
<li>Account<br />
<ul class="org-ul">
<li>ID<br /></li>
<li>Cash<br /></li>
<li>Bank<br /></li>
<li>Apartments<br /></li>
<li>Vehicles<br /></li>
<li>PegasusVehicles<br /></li>
<li>Rank<br /></li>
<li>RP<br /></li>
<li>Kills<br /></li>
</ul></li>
<li>SurveillanceProfile<br />
<ul class="org-ul">
<li>Name<br /></li>
<li>Age<br /></li>
<li>HomeCity<br /></li>
<li>Notes<br /></li>
<li>CriminalRecord<br /></li>
</ul></li>
</ul>
</div>
</div>
