index.html
<div id="outline-container-org27cc3d1" class="outline-5">
<h5 id="org27cc3d1">Example</h5>
<div class="outline-text-5" id="text-org27cc3d1">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">DatabaseDaemon</span>
    <span style="color: #cae682;">Permissions</span>=<span style="color: #95e454;">"private"</span>
    <span style="color: #cae682;">DataType</span>=<span style="color: #95e454;">"GitCommitEntry"</span>
    <span style="color: #cae682;">Foldername</span>=<span style="color: #95e454;">"database"</span>
    <span style="color: #cae682;">Color</span>=<span style="color: #95e454;">"85,0,150"</span>
    <span style="color: #cae682;">AdminEmailAccount</span>=<span style="color: #95e454;">"Matt@TestExtensionMail.com"</span>
    <span style="color: #cae682;">AdminEmailHostID</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Name</span>=<span style="color: #95e454;">"Test database"</span>&gt;

  &lt;<span style="color: #cae682;">GitCommitEntry</span>&gt;
    &lt;<span style="color: #cae682;">EntryNumber</span>&gt;8613&lt;/<span style="color: #cae682;">EntryNumber</span>&gt;
    &lt;<span style="color: #cae682;">ChangedFiles</span>&gt;
      &lt;<span style="color: #cae682;">String</span>&gt;Neopals.php&lt;/<span style="color: #cae682;">String</span>&gt;
    &lt;/<span style="color: #cae682;">ChangedFiles</span>&gt;
    &lt;<span style="color: #cae682;">Message</span>&gt;Reverted Minor updates because it broke everything&lt;/<span style="color: #cae682;">Message</span>&gt;
    &lt;<span style="color: #cae682;">UserName</span>&gt;T.Champer&lt;/<span style="color: #cae682;">UserName</span>&gt;
    &lt;<span style="color: #cae682;">SourceIP</span>&gt;192.168.1.1 (Localhost)&lt;/<span style="color: #cae682;">SourceIP</span>&gt;
  &lt;/<span style="color: #cae682;">GitCommitEntry</span>&gt;

  &lt;<span style="color: #cae682;">GitCommitEntry</span>&gt;
    &lt;<span style="color: #cae682;">EntryNumber</span>&gt;8611&lt;/<span style="color: #cae682;">EntryNumber</span>&gt;
    &lt;<span style="color: #cae682;">ChangedFiles</span>&gt;
      &lt;<span style="color: #cae682;">String</span>&gt;Content.pak&lt;/<span style="color: #cae682;">String</span>&gt;
    &lt;/<span style="color: #cae682;">ChangedFiles</span>&gt;
    &lt;<span style="color: #cae682;">Message</span>&gt;REMOTE COMMIT: Decreased pelvis bulge on Sparkle costume set :(&lt;/<span style="color: #cae682;">Message</span>&gt;
    &lt;<span style="color: #cae682;">UserName</span>&gt;A.Wallin&lt;/<span style="color: #cae682;">UserName</span>&gt;
    &lt;<span style="color: #cae682;">SourceIP</span>&gt;54.192.234.65&lt;/<span style="color: #cae682;">SourceIP</span>&gt;
  &lt;/<span style="color: #cae682;">GitCommitEntry</span>&gt;

&lt;/<span style="color: #cae682;">DatabaseDaemon</span>&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org9bd6426" class="outline-3">
<h3 id="org9bd6426">Example</h3>
<div class="outline-text-3" id="text-org9bd6426">
<p>
Pastebin Link:  <a href="https://pastebin.com/NwtgTdPW">https://pastebin.com/NwtgTdPW</a><br />
Simplified Contents:<br />
</p>
<div class="org-src-container">
<pre class="src src-nxml"><span style="color: #95e454;">&lt;?</span><span style="color: #8ac6f2; font-weight: bold;">xml</span><span style="color: #95e454;"> </span><span style="color: #95e454;">version = "1.0" encoding = "UTF-8" </span><span style="color: #95e454;">?&gt;</span>
&lt;<span style="color: #cae682;">Computer</span> <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"advExamplePC"</span> 
          <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Extension Example PC"</span> 
          <span style="color: #cae682;">ip</span>=<span style="color: #95e454;">"167.194.132.7"</span>
          <span style="color: #cae682;">security</span>=<span style="color: #95e454;">"2"</span>
          <span style="color: #cae682;">allowsDefaultBootModule</span>=<span style="color: #95e454;">"false"</span>
          <span style="color: #cae682;">icon</span>=<span style="color: #95e454;">"chip"</span> 
          <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"1"</span> &gt; 

  &lt;<span style="color: #cae682;">adminPass</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"password"</span> /&gt;

  &lt;<span style="color: #cae682;">account</span> <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"Matt"</span> <span style="color: #cae682;">password</span>=<span style="color: #95e454;">"testpass"</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"ALL"</span> /&gt;
  &lt;<span style="color: #cae682;">account</span> <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"mailGuy"</span> <span style="color: #cae682;">password</span>=<span style="color: #95e454;">"mailPass"</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"MAIL"</span> /&gt;
  &lt;<span style="color: #cae682;">ports</span>&gt;21, 22, 25, 80, 1433, 104, 6881, 443, 192, 554&lt;/<span style="color: #cae682;">ports</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">&lt;proxy time="2" /&gt; </span><span style="color: #99968b;">--&gt;</span>

  &lt;<span style="color: #cae682;">portsForCrack</span> <span style="color: #cae682;">val</span>=<span style="color: #95e454;">"0"</span> /&gt;
  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Number of ports to be open to allow porthack to run </span><span style="color: #99968b;">--&gt;</span>


  <span style="color: #99968b;">&lt;!--</span><span style="color: #99968b;">&lt;firewall level="6" solution="Scypio" additionalTime="1.0"/&gt;</span><span style="color: #99968b;">--&gt;</span>

  &lt;<span style="color: #cae682;">trace</span> <span style="color: #cae682;">time</span>=<span style="color: #95e454;">"5678"</span> /&gt;

  &lt;<span style="color: #cae682;">admin</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fast"</span> <span style="color: #cae682;">resetPassword</span>=<span style="color: #95e454;">"false"</span> <span style="color: #cae682;">isSuper</span>=<span style="color: #95e454;">"false"</span>/&gt; 

  &lt;<span style="color: #cae682;">portRemap</span>&gt;web=1234,22=2&lt;/<span style="color: #cae682;">portRemap</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Whether leaving file-modification logs will lead to counterhacking. </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">tracker</span> /&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Network Stuff </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">dlink</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC2"</span> /&gt;

  &lt;<span style="color: #cae682;">positionNear</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC2"</span> <span style="color: #cae682;">position</span>=<span style="color: #95e454;">"1"</span> <span style="color: #cae682;">total</span>=<span style="color: #95e454;">"3"</span>
                <span style="color: #cae682;">extraDistance</span>=<span style="color: #95e454;">"0.1"</span> <span style="color: #cae682;">force</span>=<span style="color: #95e454;">"false"</span>/&gt;

  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Test_File.txt"</span>&gt;This is a test file in home&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"asdf.txt"</span>&gt;This is
A Multiline
File.

Note that it doesn't have whitespace on the left side.
That causes formatting issues!&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"downloadFile.txt"</span>&gt;This is a file for some of the goals
  in ExampleMission.xml&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"changeFile.txt"</span>&gt;This is too! A
  other a! B&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Binary_File"</span>&gt;#BINARY#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home/NewDirectory"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Test_File"</span>&gt;
This is a longer file that also creates a new directory with its path.

    #BINARY#
    This generates some binary (2000 chars of it)

    #BINARYSMALL#
    This generates some binary (1000 chars of it)

    #PLAYER_IP#
    Becomes the IP of the player's computer

    #PLAYERNAME#
    the above string converts itself into the player's name

    #RANDOM_IP#
    A fresh, randomly generated IP Address

    test test
  &lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"SSHCrack.exe"</span>&gt;#SSH_CRACK#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"FTPBounce.exe"</span>&gt;#FTP_CRACK#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"WebServerWorm.exe"</span>&gt;#WEB_CRACK#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"SMTPOverflow.exe"</span>&gt;#SMTP_CRACK#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"SQLBufferOverflow.exe"</span>&gt;#SQL_CRACK#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"HexClock.exe"</span>&gt;#HEXCLOCK_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Clock.exe"</span>&gt;#CLOCK_PROGRAM#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Decypher.exe"</span>&gt;#DECYPHER_PROGRAM#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"DECHead.exe"</span>&gt;#DECHEAD_PROGRAM#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"KBTPortTest.exe"</span>&gt;#MEDICAL_PROGRAM#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"ThemeChanger.exe"</span>&gt;#THEMECHANGER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"eosDeviceScan.exe"</span>&gt;#EOS_SCANNER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"SecurityTracer.exe"</span>&gt;#SECURITYTRACER_PROGRAM#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Tracekill.exe"</span>&gt;#TRACEKILL_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"RTSPCrack.exe"</span>&gt;#RTSP_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"ESequencer.exe"</span>&gt;#EXT_SEQUENCER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"OpShell.exe"</span>&gt;#SHELL_OPENER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Themes </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"White-Theme.sys"</span>&gt;#WHITE_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Green-Theme.sys"</span>&gt;#GREEN_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Yellow-Theme.sys"</span>&gt;#YELLOW_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Teal-Theme.sys"</span>&gt;#TEAL_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Base-Theme.sys"</span>&gt;#BASE_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"LE-Theme.sys"</span>&gt;#PURPLE_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Mint-Theme.sys"</span>&gt;#MINT_THEME#&lt;/<span style="color: #cae682;">file</span>&gt;

  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"CreditsData.txt"</span>&gt;
%---  Credits File  ---

^Why this exists
This file contains the credits for the credits daemon below!

%Starting a line with % makes the text super big
^And starting it with ^ makes is kind of big.
Lines starting with anything else are normal

^Location
This file must be in home/CreditsData.txt
for the credits daemon to find and use it.

&lt;/<span style="color: #cae682;">file</span>&gt;

  &lt;<span style="color: #cae682;">customthemefile</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Custom_x-server.sys"</span>
                   <span style="color: #cae682;">themePath</span>=<span style="color: #95e454;">"Themes/SecondaryTheme.xml"</span>/&gt;
  &lt;<span style="color: #cae682;">customthemefile</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"sys"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Yuri_x-server.sys"</span>
                   <span style="color: #cae682;">themePath</span>=<span style="color: #95e454;">"Themes/YuriTheme.xml"</span>/&gt;

  &lt;<span style="color: #cae682;">encryptedFile</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"encrypted_File.dec"</span>
                 <span style="color: #cae682;">extension</span>=<span style="color: #95e454;">".txt"</span> <span style="color: #cae682;">ip</span>=<span style="color: #95e454;">"192.168.1.1"</span>
                 <span style="color: #cae682;">header</span>=<span style="color: #95e454;">"This is the header"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"decryptionPassword"</span>&gt;
    This generates an encrypted file that can be decrypted using the password
    above. It decrypts to have the extension .txt
  &lt;/<span style="color: #cae682;">encryptedFile</span>&gt;
  &lt;<span style="color: #cae682;">encryptedFile</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"easy_encrypted_File.dec"</span> <span style="color: #cae682;">ip</span>=<span style="color: #95e454;">"192.168.1.1"</span>
                 <span style="color: #cae682;">header</span>=<span style="color: #95e454;">"This is the header"</span>&gt;
    By simply not providing a password like this one, it can be decrypted
    without a password
  &lt;/<span style="color: #cae682;">encryptedFile</span>&gt;
  &lt;<span style="color: #cae682;">encryptedFile</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"asdf2.dec"</span> <span style="color: #cae682;">ip</span>=<span style="color: #95e454;">"192.168.1.1"</span>
                 <span style="color: #cae682;">header</span>=<span style="color: #95e454;">"This is the header"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"password"</span>&gt;
    This is an encrypted file referenced in ExampleMission.xml
  &lt;/<span style="color: #cae682;">encryptedFile</span>&gt;

  &lt;<span style="color: #cae682;">eosDevice</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Deliliah's ePhone 4S"</span> <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"eosIntroPhone"</span> <span style="color: #cae682;">icon</span>=<span style="color: #95e454;">"ePhone2"</span>
             <span style="color: #cae682;">empty</span>=<span style="color: #95e454;">"true"</span> <span style="color: #cae682;">passOverride</span>=<span style="color: #95e454;">"notAlpine"</span>&gt;
    &lt;<span style="color: #cae682;">note</span>&gt;TestNote
More text&lt;/<span style="color: #cae682;">note</span>&gt;
&lt;<span style="color: #cae682;">note</span>&gt;Note filenames
Note filenames are generated automatically by taking
    the first line of the file (in this case "Note Filenames") and replacing
    spaces with underscores.&lt;/<span style="color: #cae682;">note</span>&gt;
    &lt;<span style="color: #cae682;">mail</span> <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"test@jmail.com"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"thisIstheaccountpass"</span> /&gt;
    &lt;<span style="color: #cae682;">mail</span> <span style="color: #cae682;">username</span>=<span style="color: #95e454;">"test2@jmail.com"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"YouCanHaveLotsOfThese"</span> /&gt;
    &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"eos/test"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"crackedFile.txt"</span>
          &gt;This is mostly useful for jailbroken phones&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;/<span style="color: #cae682;">eosDevice</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">####################</span>
<span style="color: #99968b;">     -  Daemons  -</span>
<span style="color: #99968b;">  ####################</span>

<span style="color: #99968b;">  These are the "programs" running on nodes that do things.</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">--&gt;</span>

  &lt;<span style="color: #cae682;">mailServer</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Example Mail Server"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"50,237,212"</span> <span style="color: #cae682;">generateJunk</span>=<span style="color: #95e454;">"true"</span>&gt;
    &lt;<span style="color: #cae682;">email</span> <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"mailGuy"</span> <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Sender Guy"</span> <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"Adding an email!"</span>&gt;
This is how you add emails to the mail server - logging in with someone's
account will show these just like the way the player gets emails.
    &lt;/<span style="color: #cae682;">email</span>&gt;
    &lt;<span style="color: #cae682;">email</span> <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"mailGuy"</span> <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Spam"</span> <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"amazing features"</span>&gt;
You can have as many of these as you want
    &lt;/<span style="color: #cae682;">email</span>&gt;
    &lt;<span style="color: #cae682;">email</span> <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"Matt"</span> <span style="color: #cae682;">sender</span>=<span style="color: #95e454;">"Spam"</span> <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"amazing features"</span>&gt;
Different users too
    &lt;/<span style="color: #cae682;">email</span>&gt;
  &lt;/<span style="color: #cae682;">mailServer</span>&gt;

  &lt;<span style="color: #cae682;">uploadServerDaemon</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Upload Dropbox"</span> <span style="color: #cae682;">folder</span>=<span style="color: #95e454;">"Drop"</span> 
                      <span style="color: #cae682;">needsAuth</span>=<span style="color: #95e454;">"false"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"204,116,212"</span>/&gt;


  &lt;<span style="color: #cae682;">addWebServer</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Website Server"</span>
                <span style="color: #cae682;">url</span>=<span style="color: #95e454;">"Web/ExampleWebsite/ExampleWebsite.html"</span> /&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Can be really janky, may not work for everyone or every site </span><span style="color: #99968b;">--&gt;</span>
  <span style="color: #99968b;">&lt;!--</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">&lt;addOnlineWebServer name="Online Server" url="http://www.test.com" /&gt;</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">--&gt;</span>

  &lt;<span style="color: #cae682;">deathRowDatabase</span> /&gt;
  &lt;<span style="color: #cae682;">academicDatabase</span> /&gt;
  &lt;<span style="color: #cae682;">ispSystem</span> /&gt;

  &lt;<span style="color: #cae682;">messageBoard</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Custom Board Name!"</span>&gt;
    &lt;<span style="color: #cae682;">thread</span>&gt;Docs/MessageBoardThreads/ExampleThread1.txt&lt;/<span style="color: #cae682;">thread</span>&gt;
    &lt;<span style="color: #cae682;">thread</span>&gt;Docs/MessageBoardThreads/ExampleThread2.txt&lt;/<span style="color: #cae682;">thread</span>&gt;
  &lt;/<span style="color: #cae682;">messageBoard</span>&gt;

  &lt;<span style="color: #cae682;">MedicalDatabase</span> /&gt;
  &lt;<span style="color: #cae682;">HeartMonitor</span> <span style="color: #cae682;">patient</span>=<span style="color: #95e454;">"J_Stalvern"</span>/&gt;
  &lt;<span style="color: #cae682;">PointClicker</span> /&gt;
  &lt;<span style="color: #cae682;">SongChangerDaemon</span> /&gt; 

  &lt;<span style="color: #cae682;">variableMissionListingServer</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"example listing server"</span>
   <span style="color: #cae682;">iconPath</span>=<span style="color: #95e454;">"Logo.png"</span> <span style="color: #cae682;">articleFolderPath</span>=<span style="color: #95e454;">"Docs/ListingServerArticles"</span>
   <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"120,200,2"</span> <span style="color: #cae682;">assigner</span>=<span style="color: #95e454;">"false"</span> <span style="color: #cae682;">public</span>=<span style="color: #95e454;">"false"</span>
   <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"This is the rendered title of the server"</span>/&gt;

  &lt;<span style="color: #cae682;">missionHubServer</span> <span style="color: #cae682;">groupName</span>=<span style="color: #95e454;">"ExTech"</span> <span style="color: #cae682;">serviceName</span>=<span style="color: #95e454;">"Example Tech Contract Hub"</span>
   <span style="color: #cae682;">missionFolderPath</span>=<span style="color: #95e454;">"Missions/Misc"</span> <span style="color: #cae682;">themeColor</span>=<span style="color: #95e454;">"200,10,10"</span>
   <span style="color: #cae682;">lineColor</span>=<span style="color: #95e454;">"255,80,80"</span> <span style="color: #cae682;">backgroundColor</span>=<span style="color: #95e454;">"20,20,20"</span> <span style="color: #cae682;">allowAbandon</span>=<span style="color: #95e454;">"false"</span>/&gt;

  &lt;<span style="color: #cae682;">CreditsDaemon</span> <span style="color: #cae682;">Title</span>=<span style="color: #95e454;">"intro Extension Ending Credits"</span> <span style="color: #cae682;">ButtonText</span>=<span style="color: #95e454;">"Complete"</span>
   <span style="color: #cae682;">ConditionalActionSetToRunOnButtonPressPath</span>=<span style="color: #95e454;">"Actions/CreditsRunActions.xml"</span>/&gt;

  <span style="color: #99968b;">&lt;!-- </span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">#########################</span>

<span style="color: #99968b;">     - Labyrinths Content -</span>

<span style="color: #99968b;">  #########################</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">--&gt;</span>

<span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Memory dump file - this can be downloaded and analyzed with</span>
<span style="color: #99968b;">     MemForensics.exe </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">memoryDumpFile</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"testDump.md"</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>&gt;
    &lt;<span style="color: #cae682;">Memory</span>&gt;
      &lt;<span style="color: #cae682;">Data</span>&gt;
        &lt;<span style="color: #cae682;">Block</span>&gt;test string one&lt;/<span style="color: #cae682;">Block</span>&gt;
        &lt;<span style="color: #cae682;">Block</span>&gt;test string two&lt;/<span style="color: #cae682;">Block</span>&gt;
      &lt;/<span style="color: #cae682;">Data</span>&gt;
      &lt;<span style="color: #cae682;">Commands</span>&gt;
        &lt;<span style="color: #cae682;">Command</span>&gt;connect 123.123.123.123&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;/<span style="color: #cae682;">Commands</span>&gt;
      &lt;<span style="color: #cae682;">Data</span>&gt;
        &lt;<span style="color: #cae682;">Block</span>&gt;1234432&lt;/<span style="color: #cae682;">Block</span>&gt;
        &lt;<span style="color: #cae682;">Block</span>&gt;gfdgfdgdf&lt;/<span style="color: #cae682;">Block</span>&gt;
        &lt;<span style="color: #cae682;">Block</span>&gt;asdf&lt;/<span style="color: #cae682;">Block</span>&gt;
      &lt;/<span style="color: #cae682;">Data</span>&gt;
    &lt;/<span style="color: #cae682;">Memory</span>&gt;
  &lt;/<span style="color: #cae682;">memoryDumpFile</span>&gt;

  &lt;<span style="color: #cae682;">Memory</span>&gt;
    &lt;<span style="color: #cae682;">Commands</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;cd /log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;rm *.log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;cd /log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;rm *.log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;cd /log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;rm *.log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;cd /log&lt;/<span style="color: #cae682;">Command</span>&gt;
      &lt;<span style="color: #cae682;">Command</span>&gt;rm *.log&lt;/<span style="color: #cae682;">Command</span>&gt;
    &lt;/<span style="color: #cae682;">Commands</span>&gt;
    &lt;<span style="color: #cae682;">Data</span>&gt;
      &lt;<span style="color: #cae682;">Block</span>&gt;This appears in the "files" section&lt;/<span style="color: #cae682;">Block</span>&gt;
      &lt;<span style="color: #cae682;">Block</span>&gt;
        more
        and longer, multi line notes!
        !
        asdf
      &lt;/<span style="color: #cae682;">Block</span>&gt;
    &lt;/<span style="color: #cae682;">Data</span>&gt;
    &lt;<span style="color: #cae682;">Images</span>&gt;
      &lt;<span style="color: #cae682;">Image</span>&gt;DLC/Sprites/Misc/DraculaTank&lt;/<span style="color: #cae682;">Image</span>&gt;
    &lt;/<span style="color: #cae682;">Images</span>&gt;
  &lt;/<span style="color: #cae682;">Memory</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Labyrinths Daemons </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">CustomConnectDisplayDaemon</span> /&gt;

  &lt;<span style="color: #cae682;">LogoDaemon</span> <span style="color: #cae682;">Name</span>=<span style="color: #95e454;">"Logo Display Test"</span> <span style="color: #cae682;">ShowsTitle</span>=<span style="color: #95e454;">"true"</span>
              <span style="color: #cae682;">TextColor</span>=<span style="color: #95e454;">"47, 212, 163, 200"</span> <span style="color: #cae682;">LogoImagePath</span>=<span style="color: #95e454;">"Logo1.png"</span>&gt;
    Lines
    Here
    Appear under
    The Logo
  &lt;/<span style="color: #cae682;">LogoDaemon</span>&gt;

  &lt;<span style="color: #cae682;">LogoCustomConnectDisplayDaemon</span> <span style="color: #cae682;">logo</span>=<span style="color: #95e454;">"Logo.png"</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"Logo.png"</span>
                                  <span style="color: #cae682;">overdrawLogo</span>=<span style="color: #95e454;">"true"</span> <span style="color: #cae682;">buttonAlignment</span>=<span style="color: #95e454;">"left"</span> /&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This is your basic whitelist server "host" type - it wont check incoming</span>
<span style="color: #99968b;">       connection to itself against it's list.  It only serves a protective</span>
<span style="color: #99968b;">       function against *other* servers.</span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">WhitelistAuthenticatorDaemon</span> <span style="color: #cae682;">SelfAuthenticating</span>=<span style="color: #95e454;">"false"</span> /&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This one connects to a remote host and checks against that host's</span>
<span style="color: #99968b;">       whitelist </span>
<span style="color: #99968b;">  &lt;WhitelistAuthenticatorDaemon Remote="RemoteServerID"/&gt;</span>

<span style="color: #99968b;">  This one protects itself against all connections not on the list. Generally</span>
<span style="color: #99968b;">  "unbreakable" without scripts.</span>
<span style="color: #99968b;">  &lt;WhitelistAuthenticatorDaemon SelfAuthenticating="true"/&gt;</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">--&gt;</span>

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Experiment with this one yourself! </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">MarkovTextDaemon</span> <span style="color: #cae682;">Name</span>=<span style="color: #95e454;">"Test this one yourself"</span>
                    <span style="color: #cae682;">SourceFilesContentFolder</span>=<span style="color: #95e454;">"Notes/ListingServerArticles"</span> /&gt;

  &lt;<span style="color: #cae682;">IRCDaemon</span> <span style="color: #cae682;">themeColor</span>=<span style="color: #95e454;">"67,204,148"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Misc IRC Channel"</span> <span style="color: #cae682;">needsLogin</span>=<span style="color: #95e454;">"false"</span>&gt;
    &lt;<span style="color: #cae682;">user</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Vegas"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"0,209,232"</span>/&gt;
    &lt;<span style="color: #cae682;">user</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"bprm"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"202,98,0"</span>/&gt;
    &lt;<span style="color: #cae682;">user</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Care_ey"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"0,196,82"</span>/&gt;

    &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"Vegas"</span>&gt;Post IRC Messages here!&lt;/<span style="color: #cae682;">post</span>&gt;
    &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"bprm"</span>&gt;don't forget to set the users&lt;/<span style="color: #cae682;">post</span>&gt;
    &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"Care_ey"</span>&gt;Yep, this can also be used in the faction scripts to
    add messages etc to.&lt;/<span style="color: #cae682;">post</span>&gt;
    &lt;<span style="color: #cae682;">post</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"Vegas"</span>&gt;That's so cool!&lt;/<span style="color: #cae682;">post</span>&gt;
  &lt;/<span style="color: #cae682;">IRCDaemon</span>&gt;

  <span style="color: #99968b;">&lt;!--</span><span style="color: #99968b;">START_LABYRINTHS_ONLY_CONTENT</span><span style="color: #99968b;">--&gt;</span>
  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Everything under this line will only work for player that have the</span>
<span style="color: #99968b;">       Hacknet Labyrinths DLC pack installed! </span><span style="color: #99968b;">--&gt;</span>

  &lt;<span style="color: #cae682;">DHSDaemon</span> <span style="color: #cae682;">groupName</span>=<span style="color: #95e454;">"NewFaction Hub"</span> <span style="color: #cae682;">addsFactionPointOnMissionComplete</span>=<span style="color: #95e454;">"true"</span>
             <span style="color: #cae682;">autoClearMissionsOnPlayerComplete</span>=<span style="color: #95e454;">"true"</span> <span style="color: #cae682;">themeColor</span>=<span style="color: #95e454;">"255, 255, 161"</span>
             <span style="color: #cae682;">allowContractAbbandon</span>=<span style="color: #95e454;">"false"</span>&gt;
    &lt;<span style="color: #cae682;">agent</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Tyson"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"rockemsockem"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"209,74,48"</span>/&gt;
    &lt;<span style="color: #cae682;">agent</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"DependableSkeleton"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"d832n3msad"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"112,198,255"</span>/&gt;
    &lt;<span style="color: #cae682;">agent</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"HA0"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"kolgateryu"</span> <span style="color: #cae682;">color</span>=<span style="color: #95e454;">"58,202,146"</span>/&gt;
  &lt;/<span style="color: #cae682;">DHSDaemon</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Database daemons display a list of records of any datatype in Hacknet. No</span>
<span style="color: #99968b;">       datatype will give the "API Access" screen like Pacific air had.</span>
<span style="color: #99968b;">       Testers: let me know if you want a special datatype compiled up for you</span>
<span style="color: #99968b;">       specifically. It's very quick.</span>

<span style="color: #99968b;">    Current Datatypes:</span>
<span style="color: #99968b;">    *all basic C# datatypes from .NET*</span>
<span style="color: #99968b;">    Everything in the Hacknet codebase</span>

<span style="color: #99968b;">    Easy templated ones below:</span>

<span style="color: #99968b;">    Git Commit entry, as seen below</span>

<span style="color: #99968b;">    "TextRecord"</span>
<span style="color: #99968b;">    &lt;TextRecord&gt;</span>
<span style="color: #99968b;">      &lt;Title&gt;Record Title&lt;/Title&gt;</span>
<span style="color: #99968b;">      &lt;Data&gt;Body Data&lt;/Data&gt;</span>
<span style="color: #99968b;">    &lt;/TextRecord&gt;</span>

<span style="color: #99968b;">    "OnlineAccount"</span>
<span style="color: #99968b;">    &lt;OnlineAccount&gt;</span>
<span style="color: #99968b;">      &lt;ID&gt;1234&lt;/ID&gt;</span>
<span style="color: #99968b;">      &lt;Username&gt;asdf&lt;/Username&gt;</span>
<span style="color: #99968b;">      &lt;BanStatus&gt;very yes&lt;/BanStatus&gt;</span>
<span style="color: #99968b;">      &lt;Notes&gt;notes here&lt;/Notes&gt;</span>
<span style="color: #99968b;">    &lt;/OnlineAccount&gt;</span>


<span style="color: #99968b;">    "CAROData"</span>
<span style="color: #99968b;">    UserID</span>
<span style="color: #99968b;">    Headshots</span>
<span style="color: #99968b;">    Kills</span>
<span style="color: #99968b;">    Rank</span>
<span style="color: #99968b;">    Crowbars</span>
<span style="color: #99968b;">    InventoryID</span>
<span style="color: #99968b;">    BanStatus</span>

<span style="color: #99968b;">    "Account"</span>
<span style="color: #99968b;">    string ID;</span>
<span style="color: #99968b;">    string Cash;</span>
<span style="color: #99968b;">    string Bank;</span>
<span style="color: #99968b;">    string Apartments;</span>
<span style="color: #99968b;">    string Vehicles;</span>
<span style="color: #99968b;">    string PegasusVehicles;</span>
<span style="color: #99968b;">    string Rank;</span>
<span style="color: #99968b;">    string RP;</span>
<span style="color: #99968b;">    string Kills;</span>

<span style="color: #99968b;">    "SurveillanceProfile"</span>
<span style="color: #99968b;">    string Name;</span>
<span style="color: #99968b;">    string Age;</span>
<span style="color: #99968b;">    string HomeCity;</span>
<span style="color: #99968b;">    string Notes;</span>
<span style="color: #99968b;">    string CriminalRecord;</span>

<span style="color: #99968b;">    Happy to add more on request.</span>

<span style="color: #99968b;">    </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">DatabaseDaemon</span> <span style="color: #cae682;">Permissions</span>=<span style="color: #95e454;">"private"</span> <span style="color: #cae682;">DataType</span>=<span style="color: #95e454;">"GitCommitEntry"</span>
                  <span style="color: #cae682;">Foldername</span>=<span style="color: #95e454;">"database"</span> <span style="color: #cae682;">Color</span>=<span style="color: #95e454;">"85,0,150"</span>
                  <span style="color: #cae682;">AdminEmailAccount</span>=<span style="color: #95e454;">"Matt@TestExtensionMail.com"</span>
                  <span style="color: #cae682;">AdminEmailHostID</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Name</span>=<span style="color: #95e454;">"Test database"</span>&gt;

    &lt;<span style="color: #cae682;">GitCommitEntry</span>&gt;
      &lt;<span style="color: #cae682;">EntryNumber</span>&gt;8613&lt;/<span style="color: #cae682;">EntryNumber</span>&gt;
      &lt;<span style="color: #cae682;">ChangedFiles</span>&gt;
        &lt;<span style="color: #cae682;">String</span>&gt;Neopals.php&lt;/<span style="color: #cae682;">String</span>&gt;
      &lt;/<span style="color: #cae682;">ChangedFiles</span>&gt;
      &lt;<span style="color: #cae682;">Message</span>&gt;Reverted Minor updates because it broke everything&lt;/<span style="color: #cae682;">Message</span>&gt;
      &lt;<span style="color: #cae682;">UserName</span>&gt;T.Champer&lt;/<span style="color: #cae682;">UserName</span>&gt;
      &lt;<span style="color: #cae682;">SourceIP</span>&gt;192.168.1.1 (Localhost)&lt;/<span style="color: #cae682;">SourceIP</span>&gt;
    &lt;/<span style="color: #cae682;">GitCommitEntry</span>&gt;

    &lt;<span style="color: #cae682;">GitCommitEntry</span>&gt;
      &lt;<span style="color: #cae682;">EntryNumber</span>&gt;8611&lt;/<span style="color: #cae682;">EntryNumber</span>&gt;
      &lt;<span style="color: #cae682;">ChangedFiles</span>&gt;
        &lt;<span style="color: #cae682;">String</span>&gt;Content.pak&lt;/<span style="color: #cae682;">String</span>&gt;
      &lt;/<span style="color: #cae682;">ChangedFiles</span>&gt;
      &lt;<span style="color: #cae682;">Message</span>&gt;REMOTE COMMIT: Decreased pelvis bulge on Sparkle costume set
      :(&lt;/<span style="color: #cae682;">Message</span>&gt;
      &lt;<span style="color: #cae682;">UserName</span>&gt;A.Wallin&lt;/<span style="color: #cae682;">UserName</span>&gt;
      &lt;<span style="color: #cae682;">SourceIP</span>&gt;54.192.234.65&lt;/<span style="color: #cae682;">SourceIP</span>&gt;
    &lt;/<span style="color: #cae682;">GitCommitEntry</span>&gt;

  &lt;/<span style="color: #cae682;">DatabaseDaemon</span>&gt;

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Labyrinths Programs </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"TorrentStreamInjector.exe"</span>&gt;#TORRENT_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"SSLTrojan.exe"</span>&gt;#SSL_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"FTPSprint.exe"</span>&gt;#FTP_FAST_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"SignalScramble.exe"</span>&gt;#SIGNAL_SCRAMBLER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"MemForensics.exe"</span>&gt;#MEM_FORENSICS_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"MemDumpGenerator.exe"</span>&gt;#MEM_DUMP_GENERATOR#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"PacificPortcrusher.exe"</span>&gt;#PACIFIC_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"NetmapOrganizer.exe"</span>&gt;#NETMAP_ORGANIZER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"ComShell.exe"</span>&gt;#SHELL_CONTROLLER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"DNotes.exe"</span>&gt;#NOTES_DUMPER_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Tuneswap.exe"</span>&gt;#DLC_MUSIC_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;
  &lt;<span style="color: #cae682;">file</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Clockv2.exe"</span>&gt;#CLOCK_V2_EXE#&lt;/<span style="color: #cae682;">file</span>&gt;

  <span style="color: #99968b;">&lt;!--</span><span style="color: #99968b;">END_LABYRINTHS_ONLY_CONTENT</span><span style="color: #99968b;">--&gt;</span>

&lt;/<span style="color: #cae682;">Computer</span>&gt;
</pre>
</div>
</div>
</div>
</div>
