FeatureList.org
* DONE Mission
  With the exception of the attributes and the example, every section here represents a tag in the mission XML file.
** Mission Tag Attributes
*** id
    A unique mission identifier. Not used anywhere in the code - for debugging/testing purposes.
*** activeCheck
    Whether the mission is constantly checking for mission completion.
    If true, mission completion checks every frame.
    If false, mission completion checks on email response.
*** shouldIgnoreSenderVerification
    Prevents check ensuring that the player responded to the right email during mission completion.
*** Example
    #+BEGIN_SRC nxml
      <mission
	  id="testMission0"
	  activeCheck="true"
	  shouldIgnoreSenderVerification="false">
    #+END_SRC
** goals
   The <goals> tag can have any number of <goal> tags, all of which must be completed for the mission to complete.
   The following section denote how to define "goal" tags based on their "type" attribute.
*** filedeletion
    Delete the file at the target node, found at path/file.
**** Additional Attributes
     + target
       - The ID of the target computer
     + file
       - The file to be deleted
     + path
       - The folder containing the target file
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="filedeletion"
	   target="advExamplePC"
	   file="asdf.txt"
	   path="home"/>
     #+END_SRC
*** clearfolder
    Delete all files at the target node in path/
**** Additional Attributes
     + target
       - The ID of the target computer
     + path
       - The folder to be cleared
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="clearfolder"
	   target="advExamplePC"
	   path="home"/>
     #+END_SRC
*** filedownload
    Download the file at the target node, found at path/file
**** Additional Attributes
     + target
       - The ID of the target computer
     + file
       - The file to be downloaded
     + path
       - The folder containing the target file
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="filedownload"
	   target="advExamplePC"
	   file="downloadFile.txt"
	   path="home"/>
     #+END_SRC
*** filechange
    Add or remove text specified by the keyword from the file at the target node, found at path/file.
**** Additional Attributes
     + target
       - The ID of the target computer
     + file
       - The file to be changed
     + path
       - The folder containing the target file
     + keyword
       - The text to be modified (removed or added)
     + removal
       - If true, the keyword is meant to be removed.
       - If false or unspecified, the keyword is meant to be added to the file.
     + caseSensitive
       - Whether the replacement is meant to be case-sensitive
       - False by default, optional to specify.
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="filechange"
	   target="advExamplePC"
	   file="changeFile.txt"
	   path="home"
	   keyword="extension"/>
       <goal
	   type="filechange"
	   target="advExamplePC"
	   file="changeFile.txt"
	   path="home"
	   keyword="data"
	   removal="true"
	   caseSensitive="true"/>
     #+END_SRC
*** getadmin
    Get admin access on the target system.
    Note that for email-driven mission checking, the player must *still be admin* when they respond for the mission to complete properly. If an admin resets the password or ports between the time that the player disconnects and the time that the player responds to the email, this check will fail.
**** Additional Attributes
     + target
       - The ID of the target computer
**** Example
     #+BEGIN_SRC nxml
       <goal type="getadmin" target="advExamplePC"/>
     #+END_SRC
*** getstring
    Respond to the email with the string in the "Additional Info" field.
**** Additional Attributes
     + target
       - The string that the player must respond with to complete the goal
**** Example
     #+BEGIN_SRC nxml
       <goal type="getstring" target="password" />
     #+END_SRC
*** delay
    A task that completes [time] seconds after the first attempt to complete it.
    Useful with activeCheck set to true, allowing for a human-feeling buffer between mission response times.
