index.html
<div id="outline-container-orga9a69f2" class="outline-2">
<h2 id="orga9a69f2">Mission</h2>
<div class="outline-text-2" id="text-orga9a69f2">
<p>
With the exception of the attributes and the example, every section here represents a tag in the mission XML file.<br />
</p>
</div>
<div id="outline-container-org8fa14dd" class="outline-3">
<h3 id="org8fa14dd">Mission Tag Attributes</h3>
<div class="outline-text-3" id="text-org8fa14dd">
</div>
<div id="outline-container-orgde174f0" class="outline-4">
<h4 id="orgde174f0">id</h4>
<div class="outline-text-4" id="text-orgde174f0">
<p>
A unique mission identifier. Not used anywhere in the code - for debugging/testing purposes.<br />
</p>
</div>
</div>
<div id="outline-container-orgf07dc01" class="outline-4">
<h4 id="orgf07dc01">activeCheck</h4>
<div class="outline-text-4" id="text-orgf07dc01">
<p>
Whether the mission is constantly checking for mission completion.<br />
If true, mission completion checks every frame.<br />
If false, mission completion checks on email response.<br />
</p>
</div>
</div>
<div id="outline-container-orgf352323" class="outline-4">
<h4 id="orgf352323">shouldIgnoreSenderVerification</h4>
<div class="outline-text-4" id="text-orgf352323">
<p>
Prevents check ensuring that the player responded to the right email during mission completion.<br />
</p>
</div>
</div>
<div id="outline-container-org21fa507" class="outline-4">
<h4 id="org21fa507">Example</h4>
<div class="outline-text-4" id="text-org21fa507">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">mission</span>
    <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"testMission0"</span>
    <span style="color: #cae682;">activeCheck</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">shouldIgnoreSenderVerification</span>=<span style="color: #95e454;">"false"</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8e7ade2" class="outline-3">
<h3 id="org8e7ade2">goals</h3>
<div class="outline-text-3" id="text-org8e7ade2">
<p>
The &lt;goals&gt; tag can have any number of &lt;goal&gt; tags, all of which must be completed for the mission to complete.<br />
The following section denote how to define "goal" tags based on their "type" attribute.<br />
</p>
</div>
<div id="outline-container-org266afaa" class="outline-4">
<h4 id="org266afaa">filedeletion</h4>
<div class="outline-text-4" id="text-org266afaa">
<p>
Delete the file at the target node, found at path/file.<br />
</p>
</div>
<div id="outline-container-orgfe0e289" class="outline-5">
<h5 id="orgfe0e289">Additional Attributes</h5>
<div class="outline-text-5" id="text-orgfe0e289">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>file<br />
<ul class="org-ul">
<li>The file to be deleted<br /></li>
</ul></li>
<li>path<br />
<ul class="org-ul">
<li>The folder containing the target file<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3033f90" class="outline-5">
<h5 id="org3033f90">Example</h5>
<div class="outline-text-5" id="text-org3033f90">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filedeletion"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"asdf.txt"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org311ce90" class="outline-4">
<h4 id="org311ce90">clearfolder</h4>
<div class="outline-text-4" id="text-org311ce90">
<p>
Delete all files at the target node in path/<br />
</p>
</div>
<div id="outline-container-org6c59714" class="outline-5">
<h5 id="org6c59714">Additional Attributes</h5>
<div class="outline-text-5" id="text-org6c59714">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>path<br />
<ul class="org-ul">
<li>The folder to be cleared<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga6c0bad" class="outline-5">
<h5 id="orga6c0bad">Example</h5>
<div class="outline-text-5" id="text-orga6c0bad">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"clearfolder"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org96f2486" class="outline-4">
<h4 id="org96f2486">filedownload</h4>
<div class="outline-text-4" id="text-org96f2486">
<p>
Download the file at the target node, found at path/file<br />
</p>
</div>
<div id="outline-container-org65b1e1d" class="outline-5">
<h5 id="org65b1e1d">Additional Attributes</h5>
<div class="outline-text-5" id="text-org65b1e1d">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>file<br />
<ul class="org-ul">
<li>The file to be downloaded<br /></li>
</ul></li>
<li>path<br />
<ul class="org-ul">
<li>The folder containing the target file<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org82b0527" class="outline-5">
<h5 id="org82b0527">Example</h5>
<div class="outline-text-5" id="text-org82b0527">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filedownload"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"downloadFile.txt"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org07a940f" class="outline-4">
<h4 id="org07a940f">filechange</h4>
<div class="outline-text-4" id="text-org07a940f">
<p>
Add or remove text specified by the keyword from the file at the target node, found at path/file.<br />
</p>
</div>
<div id="outline-container-orgf1b9273" class="outline-5">
<h5 id="orgf1b9273">Additional Attributes</h5>
<div class="outline-text-5" id="text-orgf1b9273">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>file<br />
<ul class="org-ul">
<li>The file to be changed<br /></li>
</ul></li>
<li>path<br />
<ul class="org-ul">
<li>The folder containing the target file<br /></li>
</ul></li>
<li>keyword<br />
<ul class="org-ul">
<li>The text to be modified (removed or added)<br /></li>
</ul></li>
<li>removal<br />
<ul class="org-ul">
<li>If true, the keyword is meant to be removed.<br /></li>
<li>If false or unspecified, the keyword is meant to be added to the file.<br /></li>
</ul></li>
<li>caseSensitive<br />
<ul class="org-ul">
<li>Whether the replacement is meant to be case-sensitive<br /></li>
<li>False by default, optional to specify.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org567b82b" class="outline-5">
<h5 id="org567b82b">Example</h5>
<div class="outline-text-5" id="text-org567b82b">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filechange"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"changeFile.txt"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>
    <span style="color: #cae682;">keyword</span>=<span style="color: #95e454;">"extension"</span>/&gt;
&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filechange"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"changeFile.txt"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>
    <span style="color: #cae682;">keyword</span>=<span style="color: #95e454;">"data"</span>
    <span style="color: #cae682;">removal</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">caseSensitive</span>=<span style="color: #95e454;">"true"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfe36c60" class="outline-4">
<h4 id="orgfe36c60">getadmin</h4>
<div class="outline-text-4" id="text-orgfe36c60">
<p>
Get admin access on the target system.<br />
Note that for email-driven mission checking, the player must <b>still be admin</b> when they respond for the mission to complete properly. If an admin resets the password or ports between the time that the player disconnects and the time that the player responds to the email, this check will fail.<br />
</p>
</div>
<div id="outline-container-orgf166690" class="outline-5">
<h5 id="orgf166690">Additional Attributes</h5>
<div class="outline-text-5" id="text-orgf166690">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7d194ad" class="outline-5">
<h5 id="org7d194ad">Example</h5>
<div class="outline-text-5" id="text-org7d194ad">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"getadmin"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5e51bde" class="outline-4">
<h4 id="org5e51bde">getstring</h4>
<div class="outline-text-4" id="text-org5e51bde">
<p>
Respond to the email with the string in the "Additional Info" field.<br />
</p>
</div>
<div id="outline-container-org5cd848a" class="outline-5">
<h5 id="org5cd848a">Additional Attributes</h5>
<div class="outline-text-5" id="text-org5cd848a">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The string that the player must respond with to complete the goal<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc150b72" class="outline-5">
<h5 id="orgc150b72">Example</h5>
<div class="outline-text-5" id="text-orgc150b72">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"getstring"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"password"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc93b974" class="outline-4">
<h4 id="orgc93b974">delay</h4>
<div class="outline-text-4" id="text-orgc93b974">
<p>
A task that completes [time] seconds after the first attempt to complete it.<br />
Useful with activeCheck set to true, allowing for a human-feeling buffer between mission response times.<br />
</p>
</div>
