FeatureList.org
**** Additional Attributes
     + time
       - A decimal number representing how many seconds the delay is.
**** Example
     #+BEGIN_SRC nxml
       <goal type="delay" time="10.0"/>
     #+END_SRC
*** hasflag
     Perform the necessary actions to have the target flag set.
     Flags can be set by mission end functions, daemons on events, or dynamic actions.
**** Additional Attributes
     + target
       - The name of the flag needed to be added
**** Example
     #+BEGIN_SRC nxml
       <goal type="hasflag" target="flagName"/>
     #+END_SRC
*** fileupload
    Upload the file found at the target node at path/file to the destination computer at destPath, decrypting the file if necessary.
**** Additional Attributes
     + target
       - The ID of the target computer
     + file
       - The file to be uploaded
     + path
       - The folder containing the target file
     + destTarget
       - The ID of the computer to which the file should be uploaded
     + destPath
       - The folder to which the file should be uploaded
       - Should be Drop/Uploads for upload daemon
     + decrypt
       - Whether the file is encrypted and needs to be decrypted for mission success
       - Default value is "false" if omitted
     + decryptPass
       - The password to decrypt the file, if necessary
       - Must be included if decrypt="true"
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="fileupload"
	   target="advExamplePC"
	   file="asdf.txt"
	   path="home"
	   destTarget="introFactionHomeNode"
	   destPath="Drop/Uploads"/>

       <goal
	   type="fileupload"
	   target="advExamplePC"
	   file="asdf2.dec"
	   path="home"
	   destTarget="introFactionHomeNode"
	   destPath="home"
	   decrypt="true"
	   decryptPass="password"/>
     #+END_SRC
*** AddDegree
    Add the degree matching the degree name, uni, and GPA for the provided owner.
    An academic computer must exist with the following properties:
    1) ID must be "academic"
    2) It must contain an Academic Database Daemon
**** Additional Attributes
     + owner
       - The owner of the degree
     + degree
       - The name of the degree needed
     + uni
       - The university associated with the degree
     + gpa
       - The gpa associated with the degree
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="AddDegree"
	   owner="John Stalvern"
	   degree="Masters in Digital Security"
	   uni="Manchester University"
	   gpa="3.0"/>
     #+END_SRC
*** wipedegrees
    Remove all degrees for the provided owner.
    An academic computer must exist with the following properties:
    1) ID must be "academic"
    2) It must contain an Academic Database Daemon   
**** Additional Attributes
     + owner
       - The owner of the degree
**** Example
     #+BEGIN_SRC nxml
       <goal type="wipedegrees" owner="John Stalvern"/>
     #+END_SRC
*** sendemail
    Have an email sent to a specified address with a defined subject.
    Mostly useful for detecting medical records of the form "MedicalRecord - Lastname_Firstname".
**** Additional Attributes
     + mailServer
       - The mail server to which the email will be sent
     + recipient
       - The username of the mail recipient
     + subject
       - The subject of the email that must be sent.
       - Medical records are of the form "MedicalRecord - Lastname_Firstname".
**** Example
     #+BEGIN_SRC nxml
       <goal
	   type="sendemail"
	   mailServer="jmail"
	   recipient="mailuser123"
	   subject="Email Subject!"/>
     #+END_SRC
*** getadminpasswordstring [Labyrinths]
    Must get the admin password string of the target computer.
    Presumably into autocomplete capabilities?
**** Additional Attributes
     + target
       - The ID of the target computer
**** Example
     #+BEGIN_SRC nxml
       <goal type="getadminpasswordstring" target="advExamplePC"/>
     #+END_SRC
** missionStart/missionEnd
   These tags define a function to run at the start or end of the mission.
   The sections (after Attributes) denote different function contents for this tag.
   Note that missionEnd will never run if the mission is abandoned or otherwise lost.
