index.html
<div id="outline-container-org3b11988" class="outline-5">
<h5 id="org3b11988">Additional Attributes</h5>
<div class="outline-text-5" id="text-org3b11988">
<ul class="org-ul">
<li>time<br />
<ul class="org-ul">
<li>A decimal number representing how many seconds the delay is.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3bd92a2" class="outline-5">
<h5 id="org3bd92a2">Example</h5>
<div class="outline-text-5" id="text-org3bd92a2">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"delay"</span> <span style="color: #cae682;">time</span>=<span style="color: #95e454;">"10.0"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1f2d549" class="outline-4">
<h4 id="org1f2d549">hasflag</h4>
<div class="outline-text-4" id="text-org1f2d549">
<p>
Perform the necessary actions to have the target flag set.<br />
Flags can be set by mission end functions, daemons on events, or dynamic actions.<br />
</p>
</div>
<div id="outline-container-org7e3e7a4" class="outline-5">
<h5 id="org7e3e7a4">Additional Attributes</h5>
<div class="outline-text-5" id="text-org7e3e7a4">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The name of the flag needed to be added<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5df9fd5" class="outline-5">
<h5 id="org5df9fd5">Example</h5>
<div class="outline-text-5" id="text-org5df9fd5">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"hasflag"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"flagName"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2c9afe3" class="outline-4">
<h4 id="org2c9afe3">fileupload</h4>
<div class="outline-text-4" id="text-org2c9afe3">
<p>
Upload the file found at the target node at path/file to the destination computer at destPath, decrypting the file if necessary.<br />
</p>
</div>
<div id="outline-container-orga308365" class="outline-5">
<h5 id="orga308365">Additional Attributes</h5>
<div class="outline-text-5" id="text-orga308365">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>file<br />
<ul class="org-ul">
<li>The file to be uploaded<br /></li>
</ul></li>
<li>path<br />
<ul class="org-ul">
<li>The folder containing the target file<br /></li>
</ul></li>
<li>destTarget<br />
<ul class="org-ul">
<li>The ID of the computer to which the file should be uploaded<br /></li>
</ul></li>
<li>destPath<br />
<ul class="org-ul">
<li>The folder to which the file should be uploaded<br /></li>
<li>Should be Drop/Uploads for upload daemon<br /></li>
</ul></li>
<li>decrypt<br />
<ul class="org-ul">
<li>Whether the file is encrypted and needs to be decrypted for mission success<br /></li>
<li>Default value is "false" if omitted<br /></li>
</ul></li>
<li>decryptPass<br />
<ul class="org-ul">
<li>The password to decrypt the file, if necessary<br /></li>
<li>Must be included if decrypt="true"<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3e8e926" class="outline-5">
<h5 id="org3e8e926">Example</h5>
<div class="outline-text-5" id="text-org3e8e926">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fileupload"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"asdf.txt"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>
    <span style="color: #cae682;">destTarget</span>=<span style="color: #95e454;">"introFactionHomeNode"</span>
    <span style="color: #cae682;">destPath</span>=<span style="color: #95e454;">"Drop/Uploads"</span>/&gt;

&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fileupload"</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"asdf2.dec"</span>
    <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>
    <span style="color: #cae682;">destTarget</span>=<span style="color: #95e454;">"introFactionHomeNode"</span>
    <span style="color: #cae682;">destPath</span>=<span style="color: #95e454;">"home"</span>
    <span style="color: #cae682;">decrypt</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">decryptPass</span>=<span style="color: #95e454;">"password"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbf6e59e" class="outline-4">
<h4 id="orgbf6e59e">AddDegree</h4>
<div class="outline-text-4" id="text-orgbf6e59e">
<p>
Add the degree matching the degree name, uni, and GPA for the provided owner.<br />
An academic computer must exist with the following properties:<br />
</p>
<ol class="org-ol">
<li>ID must be "academic"<br /></li>
<li>It must contain an Academic Database Daemon<br /></li>
</ol>
</div>
<div id="outline-container-orgeee0a66" class="outline-5">
<h5 id="orgeee0a66">Additional Attributes</h5>
<div class="outline-text-5" id="text-orgeee0a66">
<ul class="org-ul">
<li>owner<br />
<ul class="org-ul">
<li>The owner of the degree<br /></li>
</ul></li>
<li>degree<br />
<ul class="org-ul">
<li>The name of the degree needed<br /></li>
</ul></li>
<li>uni<br />
<ul class="org-ul">
<li>The university associated with the degree<br /></li>
</ul></li>
<li>gpa<br />
<ul class="org-ul">
<li>The gpa associated with the degree<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf6a170f" class="outline-5">
<h5 id="orgf6a170f">Example</h5>
<div class="outline-text-5" id="text-orgf6a170f">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"AddDegree"</span>
    <span style="color: #cae682;">owner</span>=<span style="color: #95e454;">"John Stalvern"</span>
    <span style="color: #cae682;">degree</span>=<span style="color: #95e454;">"Masters in Digital Security"</span>
    <span style="color: #cae682;">uni</span>=<span style="color: #95e454;">"Manchester University"</span>
    <span style="color: #cae682;">gpa</span>=<span style="color: #95e454;">"3.0"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd5026f" class="outline-4">
<h4 id="orgbd5026f">wipedegrees</h4>
<div class="outline-text-4" id="text-orgbd5026f">
<p>
Remove all degrees for the provided owner.<br />
An academic computer must exist with the following properties:<br />
</p>
<ol class="org-ol">
<li>ID must be "academic"<br /></li>
<li>It must contain an Academic Database Daemon<br /></li>
</ol>
</div>
<div id="outline-container-orgf937348" class="outline-5">
<h5 id="orgf937348">Additional Attributes</h5>
<div class="outline-text-5" id="text-orgf937348">
<ul class="org-ul">
<li>owner<br />
<ul class="org-ul">
<li>The owner of the degree<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf98921b" class="outline-5">
<h5 id="orgf98921b">Example</h5>
<div class="outline-text-5" id="text-orgf98921b">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"wipedegrees"</span> <span style="color: #cae682;">owner</span>=<span style="color: #95e454;">"John Stalvern"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6b36ea5" class="outline-4">
<h4 id="org6b36ea5">sendemail</h4>
<div class="outline-text-4" id="text-org6b36ea5">
<p>
Have an email sent to a specified address with a defined subject.<br />
Mostly useful for detecting medical records of the form "MedicalRecord - Lastname_Firstname".<br />
</p>
</div>
<div id="outline-container-org28cc6bb" class="outline-5">
<h5 id="org28cc6bb">Additional Attributes</h5>
<div class="outline-text-5" id="text-org28cc6bb">
<ul class="org-ul">
<li>mailServer<br />
<ul class="org-ul">
<li>The mail server to which the email will be sent<br /></li>
</ul></li>
<li>recipient<br />
<ul class="org-ul">
<li>The username of the mail recipient<br /></li>
</ul></li>
<li>subject<br />
<ul class="org-ul">
<li>The subject of the email that must be sent.<br /></li>
<li>Medical records are of the form "MedicalRecord - Lastname_Firstname".<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc918c4f" class="outline-5">
<h5 id="orgc918c4f">Example</h5>
<div class="outline-text-5" id="text-orgc918c4f">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span>
    <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"sendemail"</span>
    <span style="color: #cae682;">mailServer</span>=<span style="color: #95e454;">"jmail"</span>
    <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"mailuser123"</span>
    <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"Email Subject!"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge75f07c" class="outline-4">
<h4 id="orge75f07c">getadminpasswordstring [Labyrinths]</h4>
<div class="outline-text-4" id="text-orge75f07c">
<p>
Must get the admin password string of the target computer.<br />
Presumably into autocomplete capabilities?<br />
</p>
</div>
<div id="outline-container-org1a56a9e" class="outline-5">
<h5 id="org1a56a9e">Additional Attributes</h5>
<div class="outline-text-5" id="text-org1a56a9e">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org43ecf4f" class="outline-5">
<h5 id="org43ecf4f">Example</h5>
<div class="outline-text-5" id="text-org43ecf4f">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"getadminpasswordstring"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbf5a439" class="outline-3">
<h3 id="orgbf5a439">missionStart/missionEnd</h3>
<div class="outline-text-3" id="text-orgbf5a439">
<p>
These tags define a function to run at the start or end of the mission.<br />
The sections (after Attributes) denote different function contents for this tag.<br />
Note that missionEnd will never run if the mission is abandoned or otherwise lost.<br />
</p>
</div>
