FeatureList.org
*** Attributes
    + val
      - An attribute that changes in meaning depending on the function
      - Holds an integer value to be passed to the specified function
    + suppress
      - If true, the missionStart will activate on mission send.
      - If false, it will activate on mission load.
	* Hub missions are loaded when the save game is loaded or a new game is started.
*** setFaction:FACTION_ID
    Sets the player's faction to FACTION_ID
*** addRank
    Adds "val" in rank to the current active faction.
*** addRankFaction:FACTION_ID
    Adds "val" in rank to the specified faction.
*** addFlags:flag1,flag2,...
    Adds the defined flag(s) to the current session.
*** removeFlags:flag1,flag2,...
    Removes the listed flags if they exist.
*** changeSong
    Changes the song to the song specified by val.
**** Song Options
    1) Revolve
    2) The_Quickening
    3) TheAlgorithm
    4) Ryan3
    5) Bit(Ending)
    6) Rico_Puestel-Roja_Drifts_By
    7) out_run_the_wolves
    8) Irritations
    9) Broken_Boy
    10) Ryan10
    11) tetrameth

*** loadConditionalActions:Path/To/Actions.xml
    Loads the conditional action set at the provided path.
*** setHubServer:SERVER_ID
    Sets the given server to be the hub server on the map.
    Visually, this adds the little spinny thing.
*** setAssetServer:SERVER_ID
    Sets the given server to be the asset server on the map.
    Visually, this adds the little star inside it.
*** playCustomSong:Path/To/Song.ogg
    Fades the music into the custom song specified. Does not play on XNA branch.
*** playCustomSongImmediatley:Path/To/Song.ogg
    Unknown if the typo is needed.
    Snaps the music to the custom song specified.
*** changeSongDLC [Labyrinths]
     Changes the song to the DLC song specified by val.
**** Song Options
     1) Remi2
     2) snidelyWhiplash
     3) Slow_Motion
     4) World_Chase
     5) HOME_Resonance
     6) Remi_Finale
     7) RemiDrone
     8) DreamHead
     9) Userspace
     10) CrashTrack
*** Example
    #+BEGIN_SRC nxml
      <missionStart val="7">changeSong</missionStart>
      <missionEnd val="1">addRank</missionEnd>
    #+END_SRC
** nextMission
   A filepath to the mission that is loaded upon completion of this mission.
   If no mission should follow this one (e.g. hub server), use "NONE" as the filepath.
   
   *The IsSilent attribute silences THIS mission, not the next mission!*
   IsSilent prevents an email from being sent on load.
*** Example
    #+BEGIN_SRC nxml
      <nextMission IsSilent="false">NONE</nextMission>
    #+END_SRC
** branchMissions
   Branch missions are all checked when the current mission goals are checked.
   They are checked in order to see if all goals are completed of any branch.
   If a branch succeeds, its nextMission will be loaded.
   Additionally, branch missions are always silent and thus don't send an email.
   
   Inside of this tag, multiple <branch> tags should exist containing a filepath to the branching mission files.
*** Example
    #+BEGIN_SRC nxml
      <branchMissions>
	<branch>Missions/BranchExample/TestBranchMission.xml</branch>
	<!-- You can have more than one branch mission here -->
      </branchMissions>
    #+END_SRC
** posting
   This represents what gets posted to a mission listing board.
*** Attributes
    + title
      - The displayed title of the posting
    + reqs
      - Comma separated list of required flags before mission can be accepted
      - Optional, I assume
    + requiredRank
      - The required faction rank of the player to unlock this mission
      - Must be at least this value
*** Example
    #+BEGIN_SRC nxml
      <posting
	  title="Do the Extension Test Mission"
	  reqs="someCustomFlag"
	  requiredRank="3">
      This is the body text of the posting that will appear
      when the mission is clicked on.
      It should contain a basic outline,
      with any warnings the player needs.

      Once accepted, the email should contain full details.
      </posting>
    #+END_SRC
** email
   Emails are structured as a nested set of tags.
*** sender
    The contents of this tag denote who sent the email, as a name which acts like an ID.

    The sender field is *very important* for branching or silent mission chains.
    Even if this file you're editing isn't the email on the server the player will be responding to, it will still run it's completion checks as long as the player is responding to any email from the same sender.
    This doesn't affect basic and normal missions, so if you're not doing anything too fancy, don't worry about it.
*** subject
    The subject of the email.
*** body
    The body of the email. Leave off auto-whitespace, be careful with formatting, and email contents are important.
