index.html
<div id="outline-container-org57c7aeb" class="outline-4">
<h4 id="org57c7aeb">Attributes</h4>
<div class="outline-text-4" id="text-org57c7aeb">
<ul class="org-ul">
<li>val<br />
<ul class="org-ul">
<li>An attribute that changes in meaning depending on the function<br /></li>
<li>Holds an integer value to be passed to the specified function<br /></li>
</ul></li>
<li>suppress<br />
<ul class="org-ul">
<li>If true, the missionStart will activate on mission send.<br /></li>
<li>If false, it will activate on mission load.<br />
<ul class="org-ul">
<li>Hub missions are loaded when the save game is loaded or a new game is started.<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb4def2a" class="outline-4">
<h4 id="orgb4def2a">setFaction:FACTION_ID</h4>
<div class="outline-text-4" id="text-orgb4def2a">
<p>
Sets the player's faction to FACTION_ID<br />
</p>
</div>
</div>
<div id="outline-container-orga57999c" class="outline-4">
<h4 id="orga57999c">addRank</h4>
<div class="outline-text-4" id="text-orga57999c">
<p>
Adds "val" in rank to the current active faction.<br />
</p>
</div>
</div>
<div id="outline-container-org9e18273" class="outline-4">
<h4 id="org9e18273">addRankFaction:FACTION_ID</h4>
<div class="outline-text-4" id="text-org9e18273">
<p>
Adds "val" in rank to the specified faction.<br />
</p>
</div>
</div>
<div id="outline-container-org420a136" class="outline-4">
<h4 id="org420a136">addFlags:flag1,flag2,&#x2026;</h4>
<div class="outline-text-4" id="text-org420a136">
<p>
Adds the defined flag(s) to the current session.<br />
</p>
</div>
</div>
<div id="outline-container-orgc6b4584" class="outline-4">
<h4 id="orgc6b4584">removeFlags:flag1,flag2,&#x2026;</h4>
<div class="outline-text-4" id="text-orgc6b4584">
<p>
Removes the listed flags if they exist.<br />
</p>
</div>
</div>
<div id="outline-container-orgbf065a0" class="outline-4">
<h4 id="orgbf065a0">changeSong</h4>
<div class="outline-text-4" id="text-orgbf065a0">
<p>
Changes the song to the song specified by val.<br />
</p>
</div>
<div id="outline-container-org13162bd" class="outline-5">
<h5 id="org13162bd">Song Options</h5>
<div class="outline-text-5" id="text-org13162bd">
<ol class="org-ol">
<li>Revolve<br /></li>
<li>The_Quickening<br /></li>
<li>TheAlgorithm<br /></li>
<li>Ryan3<br /></li>
<li>Bit(Ending)<br /></li>
<li>Rico_Puestel-Roja_Drifts_By<br /></li>
<li>out_run_the_wolves<br /></li>
<li>Irritations<br /></li>
<li>Broken_Boy<br /></li>
<li>Ryan10<br /></li>
<li>tetrameth<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org1debd60" class="outline-4">
<h4 id="org1debd60">loadConditionalActions:Path/To/Actions.xml</h4>
<div class="outline-text-4" id="text-org1debd60">
<p>
Loads the conditional action set at the provided path.<br />
</p>
</div>
</div>
<div id="outline-container-org050eb00" class="outline-4">
<h4 id="org050eb00">setHubServer:SERVER_ID</h4>
<div class="outline-text-4" id="text-org050eb00">
<p>
Sets the given server to be the hub server on the map.<br />
Visually, this adds the little spinny thing.<br />
</p>
</div>
</div>
<div id="outline-container-orgc104f7a" class="outline-4">
<h4 id="orgc104f7a">setAssetServer:SERVER_ID</h4>
<div class="outline-text-4" id="text-orgc104f7a">
<p>
Sets the given server to be the asset server on the map.<br />
Visually, this adds the little star inside it.<br />
</p>
</div>
</div>
<div id="outline-container-org0be4703" class="outline-4">
<h4 id="org0be4703">playCustomSong:Path/To/Song.ogg</h4>
<div class="outline-text-4" id="text-org0be4703">
<p>
Fades the music into the custom song specified. Does not play on XNA branch.<br />
</p>
</div>
</div>
<div id="outline-container-org06c840a" class="outline-4">
<h4 id="org06c840a">playCustomSongImmediatley:Path/To/Song.ogg</h4>
<div class="outline-text-4" id="text-org06c840a">
<p>
Unknown if the typo is needed.<br />
Snaps the music to the custom song specified.<br />
</p>
</div>
</div>
<div id="outline-container-org30593c2" class="outline-4">
<h4 id="org30593c2">changeSongDLC [Labyrinths]</h4>
<div class="outline-text-4" id="text-org30593c2">
<p>
Changes the song to the DLC song specified by val.<br />
</p>
</div>
<div id="outline-container-org5ecea7a" class="outline-5">
<h5 id="org5ecea7a">Song Options</h5>
<div class="outline-text-5" id="text-org5ecea7a">
<ol class="org-ol">
<li>Remi2<br /></li>
<li>snidelyWhiplash<br /></li>
<li>Slow_Motion<br /></li>
<li>World_Chase<br /></li>
<li>HOME_Resonance<br /></li>
<li>Remi_Finale<br /></li>
<li>RemiDrone<br /></li>
<li>DreamHead<br /></li>
<li>Userspace<br /></li>
<li>CrashTrack<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org125807f" class="outline-4">
<h4 id="org125807f">Example</h4>
<div class="outline-text-4" id="text-org125807f">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">missionStart</span> <span style="color: #cae682;">val</span>=<span style="color: #95e454;">"7"</span>&gt;changeSong&lt;/<span style="color: #cae682;">missionStart</span>&gt;
&lt;<span style="color: #cae682;">missionEnd</span> <span style="color: #cae682;">val</span>=<span style="color: #95e454;">"1"</span>&gt;addRank&lt;/<span style="color: #cae682;">missionEnd</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org54df915" class="outline-3">
<h3 id="org54df915">nextMission</h3>
<div class="outline-text-3" id="text-org54df915">
<p>
A filepath to the mission that is loaded upon completion of this mission.<br />
If no mission should follow this one (e.g. hub server), use "NONE" as the filepath.<br />
</p>

<p>
<b>The IsSilent attribute silences THIS mission, not the next mission!</b><br />
IsSilent prevents an email from being sent on load.<br />
</p>
</div>
<div id="outline-container-orgd2b0ccc" class="outline-4">
<h4 id="orgd2b0ccc">Example</h4>
<div class="outline-text-4" id="text-orgd2b0ccc">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">nextMission</span> <span style="color: #cae682;">IsSilent</span>=<span style="color: #95e454;">"false"</span>&gt;NONE&lt;/<span style="color: #cae682;">nextMission</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6690289" class="outline-3">
<h3 id="org6690289">branchMissions</h3>
<div class="outline-text-3" id="text-org6690289">
<p>
Branch missions are all checked when the current mission goals are checked.<br />
They are checked in order to see if all goals are completed of any branch.<br />
If a branch succeeds, its nextMission will be loaded.<br />
Additionally, branch missions are always silent and thus don't send an email.<br />
</p>

<p>
Inside of this tag, multiple &lt;branch&gt; tags should exist containing a filepath to the branching mission files.<br />
</p>
</div>
<div id="outline-container-org3eee361" class="outline-4">
<h4 id="org3eee361">Example</h4>
<div class="outline-text-4" id="text-org3eee361">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">branchMissions</span>&gt;
  &lt;<span style="color: #cae682;">branch</span>&gt;Missions/BranchExample/TestBranchMission.xml&lt;/<span style="color: #cae682;">branch</span>&gt;
  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">You can have more than one branch mission here </span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">branchMissions</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc3c0f66" class="outline-3">
<h3 id="orgc3c0f66">posting</h3>
<div class="outline-text-3" id="text-orgc3c0f66">
<p>
This represents what gets posted to a mission listing board.<br />
</p>
</div>
<div id="outline-container-org84a25f6" class="outline-4">
<h4 id="org84a25f6">Attributes</h4>
<div class="outline-text-4" id="text-org84a25f6">
<ul class="org-ul">
<li>title<br />
<ul class="org-ul">
<li>The displayed title of the posting<br /></li>
</ul></li>
<li>reqs<br />
<ul class="org-ul">
<li>Comma separated list of required flags before mission can be accepted<br /></li>
<li>Optional, I assume<br /></li>
</ul></li>
<li>requiredRank<br />
<ul class="org-ul">
<li>The required faction rank of the player to unlock this mission<br /></li>
<li>Must be at least this value<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfeac4fa" class="outline-4">
<h4 id="orgfeac4fa">Example</h4>
<div class="outline-text-4" id="text-orgfeac4fa">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">posting</span>
    <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"Do the Extension Test Mission"</span>
    <span style="color: #cae682;">reqs</span>=<span style="color: #95e454;">"someCustomFlag"</span>
    <span style="color: #cae682;">requiredRank</span>=<span style="color: #95e454;">"3"</span>&gt;
This is the body text of the posting that will appear
when the mission is clicked on.
It should contain a basic outline,
with any warnings the player needs.

Once accepted, the email should contain full details.
&lt;/<span style="color: #cae682;">posting</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org11bed9d" class="outline-3">
<h3 id="org11bed9d">email</h3>
<div class="outline-text-3" id="text-org11bed9d">
<p>
Emails are structured as a nested set of tags.<br />
</p>
</div>
<div id="outline-container-org8031e00" class="outline-4">
<h4 id="org8031e00">sender</h4>
<div class="outline-text-4" id="text-org8031e00">
<p>
The contents of this tag denote who sent the email, as a name which acts like an ID.<br />
</p>

<p>
The sender field is <b>very important</b> for branching or silent mission chains.<br />
Even if this file you're editing isn't the email on the server the player will be responding to, it will still run it's completion checks as long as the player is responding to any email from the same sender.<br />
This doesn't affect basic and normal missions, so if you're not doing anything too fancy, don't worry about it.<br />
</p>
</div>
</div>
<div id="outline-container-orga4e027f" class="outline-4">
<h4 id="orga4e027f">subject</h4>
<div class="outline-text-4" id="text-orga4e027f">
<p>
The subject of the email.<br />
</p>
</div>
</div>
<div id="outline-container-orgc571033" class="outline-4">
<h4 id="orgc571033">body</h4>
<div class="outline-text-4" id="text-orgc571033">
<p>
The body of the email. Leave off auto-whitespace, be careful with formatting, and email contents are important.<br />
</p>
</div>
</div>
