FeatureList.org
*** attachments
    Clickable items at the bottom of an email with a "+".
    Keep the number of attachments small to keep the player focused.
    Multiple types of any attachment are supported.
    An attachments tag is always needed, even if empty!
**** note
     Add a note attachment to your email.
     + Attribute
       - title
	 * The title of the note
     + Contents
       - The body of the note
       - Supports multiple lines, don't have auto-whitespace!
**** link
     Add a link to a computer in your email.
     + Attribute
       - comp
	 * The ID of the computer to which you are linking
**** account
     Add an account autologin to your email.
     + Attributes
       - comp
	 * The ID of the computer the account information is used on
       - user
	 * The username of the account on the computer
       - pass
	 * The password of the account on the computer
*** Example
    #+BEGIN_SRC nxml
      <email>
	<sender>Matt</sender>
	<subject>Test Mission Email</subject>
	<body>This is the body of the email.
      Don't forget to not auto-align your text!
      Good luck,
      -Matt
	</body>
  
	<attachments>
	  <note title="An example note">Note contents</note>
	  <link comp="missionTestNode" />
	  <account comp="missionTestNode" user="TestUser" pass="testpass" />      
	</attachments>
      </email>
    #+END_SRC
