index.html
<div id="outline-container-org6adf0b6" class="outline-4">
<h4 id="org6adf0b6">attachments</h4>
<div class="outline-text-4" id="text-org6adf0b6">
<p>
Clickable items at the bottom of an email with a "+".<br />
Keep the number of attachments small to keep the player focused.<br />
Multiple types of any attachment are supported.<br />
An attachments tag is always needed, even if empty!<br />
</p>
</div>
<div id="outline-container-orgcf587ab" class="outline-5">
<h5 id="orgcf587ab">note</h5>
<div class="outline-text-5" id="text-orgcf587ab">
<p>
Add a note attachment to your email.<br />
</p>
<ul class="org-ul">
<li>Attribute<br />
<ul class="org-ul">
<li>title<br />
<ul class="org-ul">
<li>The title of the note<br /></li>
</ul></li>
</ul></li>
<li>Contents<br />
<ul class="org-ul">
<li>The body of the note<br /></li>
<li>Supports multiple lines, don't have auto-whitespace!<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org96db945" class="outline-5">
<h5 id="org96db945">link</h5>
<div class="outline-text-5" id="text-org96db945">
<p>
Add a link to a computer in your email.<br />
</p>
<ul class="org-ul">
<li>Attribute<br />
<ul class="org-ul">
<li>comp<br />
<ul class="org-ul">
<li>The ID of the computer to which you are linking<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org353a164" class="outline-5">
<h5 id="org353a164">account</h5>
<div class="outline-text-5" id="text-org353a164">
<p>
Add an account autologin to your email.<br />
</p>
<ul class="org-ul">
<li>Attributes<br />
<ul class="org-ul">
<li>comp<br />
<ul class="org-ul">
<li>The ID of the computer the account information is used on<br /></li>
</ul></li>
<li>user<br />
<ul class="org-ul">
<li>The username of the account on the computer<br /></li>
</ul></li>
<li>pass<br />
<ul class="org-ul">
<li>The password of the account on the computer<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org778e6c9" class="outline-4">
<h4 id="org778e6c9">Example</h4>
<div class="outline-text-4" id="text-org778e6c9">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">email</span>&gt;
  &lt;<span style="color: #cae682;">sender</span>&gt;Matt&lt;/<span style="color: #cae682;">sender</span>&gt;
  &lt;<span style="color: #cae682;">subject</span>&gt;Test Mission Email&lt;/<span style="color: #cae682;">subject</span>&gt;
  &lt;<span style="color: #cae682;">body</span>&gt;This is the body of the email.
Don't forget to not auto-align your text!
Good luck,
-Matt
  &lt;/<span style="color: #cae682;">body</span>&gt;

  &lt;<span style="color: #cae682;">attachments</span>&gt;
    &lt;<span style="color: #cae682;">note</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"An example note"</span>&gt;Note contents&lt;/<span style="color: #cae682;">note</span>&gt;
    &lt;<span style="color: #cae682;">link</span> <span style="color: #cae682;">comp</span>=<span style="color: #95e454;">"missionTestNode"</span> /&gt;
    &lt;<span style="color: #cae682;">account</span> <span style="color: #cae682;">comp</span>=<span style="color: #95e454;">"missionTestNode"</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"TestUser"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"testpass"</span> /&gt;      
  &lt;/<span style="color: #cae682;">attachments</span>&gt;
&lt;/<span style="color: #cae682;">email</span>&gt;
</pre>
</div>
</div>
</div>
</div>
