FeatureList.org
** Example
Pastebin Link: https://pastebin.com/WtFLbQvH
Simplified Contents:
#+BEGIN_SRC nxml
    <?xml version = "1.0" encoding = "UTF-8" ?>
    <!-- 
    id : the mission ID - this isn't used in-code but is sometimes useful
    in debugging and testing.

    activeCheck : if this is set to true, when this mission is active,
    Hacknet will test for this mission being complete every frame, instead
    of only when the player responds to an email. This is very useful for
    creating delays, and for situations where the player is contacted from
    outside an existing chain.

    shouldIgnoreSenderVerification : This prevents the check to ensure
    that the player responded to the right sender when checking for
    mission completion.
    -->
    <mission id="testMission0" activeCheck="true"
    shouldIgnoreSenderVerification="false">
      <goals>
	<!-- All goals must be completed for mission completion -->
	<goal type="filedeletion" target="advExamplePC" file="asdf.txt"
	      path="home"/>

	<goal type="clearfolder" target="advExamplePC" path="home"/>

	<goal type="filedownload" target="advExamplePC" file="downloadFile.txt"
	      path="home"/>

	<goal type="filechange" target="advExamplePC" file="changeFile.txt"
	      path="home" keyword="extension"/>

	<goal type="filechange" target="advExamplePC" file="changeFile.txt"
	      path="home" keyword="data" removal="true" caseSensitive="true"/>

	<goal type="getadmin" target="advExamplePC"/>

	<goal type="getstring" target="password" />

	<goal type="delay" time="10.0"/>

	<goal type="hasflag" target="flagName"/>

	<goal type="fileupload" target="advExamplePC" file="asdf.txt" path="home"
	      destTarget="introFactionHomeNode" destPath="Drop/Uploads"/>

	<goal type="fileupload" target="advExamplePC" file="asdf2.dec" path="home"
	      destTarget="introFactionHomeNode" destPath="home" decrypt="true"
	      decryptPass="password"/>

	<!-- Task to add the degree matching the degree name and uni and
	     GPA details for the listed owner.

	     This task *requires* an academic server to exist.  An owner is defined
	     by name - to add a person to the simulation, define them in the People
	     folder and refer to them by name here.

	     The academic server must have the following properties:
	       1: ID must be "academic"
	       2: It must contain an Academic Database Daemon
	-->
	<goal type="AddDegree" owner="John Stalvern"
	      degree="Masters in Digital Security"
	      uni="Manchester University" gpa="3.0"/>

	<!-- Task to remove all degrees from the academic server for a
	     specified owner. Note that for this one, you *MUST* have the ID of
	     your database be "academic" or it wont find it.
	-->
	<goal type="wipedegrees" owner="John Stalvern"/>

	<!-- This is mostly useful for detecting sent medical records from
	     a medical database.  Medical records have the subject line:
	     "MedicalRecord - Lastname_Firstname"
	-->
	<goal type="sendemail" mailServer="jmail" recipient="mailuser123"
	      subject="Email Subject!"/>

	<!-- DLC Goals -->
	<goal type="getadminpasswordstring" target="advExamplePC"/>
      </goals>

      <missionStart val="7" suppress="true">changeSong</missionStart>
      <missionEnd val="1">addRank</missionEnd>

      <!-- The IsSilent flag is... admittedly in a terrible place here. It
	   silenced THIS mission, not the next one. This means that if you set
	   IsSilent to be true here, this mission will not send and email when it
	   is loaded.

	   Important detail about mission completion: For a reply to work,
	   the mission the player is currently on my have the same email sender
	   field as the email they reply to in their inbox. This means that if
	   you have a silent connector mission, make sure it has the same sender
	   filled in in the email field.

	   If you want there to be no mission following this one (For
	   example, the email mission that introduces you to a hub server) set
	   nextMission to "NONE"
      -->
      <nextMission IsSilent="false">NONE</nextMission>

      <!-- Next up are Branch missions (Optional)
      Note that the branch mission's email will not be sent - they are all
      loaded in silent mode.-->
      <branchMissions>
	<branch>Missions/BranchExample/TestBranchMission.xml</branch>
	<!-- You can have more than one branch mission here -->
      </branchMissions>
      <posting title="Do the Extension Test Mission" reqs="someCustomFlag"
	       requiredRank="3" >
    This is the body text of the posting that will appear when the
  mission is clicked on. It should contain a basic outline, with any
  warnings the player needs.  Once accepted, the email should contain
  full details.</posting>

      <email>
	<!-- The sender field is very important for branching or silent
	     mission chains. Even if this file you're editing isn't the
	     email on the server the player will be responding to, it
	     will still run it's completion checks as long as the player
	     is responding to any email from the same sender. This
	     doesn't affect basic and normal missions, so if you're not
	     doing anything too fancy, don't worry about it.-->
	<sender>Matt</sender>
	<subject>Test Mission Email</subject>
	<body>This is the body of the email.  be careful with your
  formatting! the hacknet parser does not account for
  auto-whitespace added to the left here.  email contents are very
  important - small changes in wording can dramatically change how
  easy or hard a mission is.  be very conscious about how much you
  are hinting at and guiding the player, and understand that it will
  be much harder for everyone that's not you.

  Good luck,
  -Matt
	</body>

	<attachments>
	  <note title="An example note">Experiment with note formatting!
  Remember that the note space is very small, so text overflow
  onto new lines happens quickly.

  Guide the player! Hacknet missions are very frustrating when the
  player has too little direction and cant continue.
	  </note>

	  <link comp="missionTestNode" />
	  <account comp="missionTestNode" user="TestUser" pass="testpass" />
	</attachments>
      </email>
    </mission>
#+END_SRC
