index.html
<div id="outline-container-org3ebad27" class="outline-3">
<h3 id="org3ebad27">Example</h3>
<div class="outline-text-3" id="text-org3ebad27">
<p>
Pastebin Link: <a href="https://pastebin.com/WtFLbQvH">https://pastebin.com/WtFLbQvH</a><br />
Simplified Contents:<br />
</p>
<div class="org-src-container">
<pre class="src src-nxml">  <span style="color: #95e454;">&lt;?</span><span style="color: #8ac6f2; font-weight: bold;">xml</span><span style="color: #95e454;"> </span><span style="color: #95e454;">version = "1.0" encoding = "UTF-8" </span><span style="color: #95e454;">?&gt;</span>
  <span style="color: #99968b;">&lt;!-- </span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">id : the mission ID - this isn't used in-code but is sometimes useful</span>
<span style="color: #99968b;">  in debugging and testing.</span>

<span style="color: #99968b;">  activeCheck : if this is set to true, when this mission is active,</span>
<span style="color: #99968b;">  Hacknet will test for this mission being complete every frame, instead</span>
<span style="color: #99968b;">  of only when the player responds to an email. This is very useful for</span>
<span style="color: #99968b;">  creating delays, and for situations where the player is contacted from</span>
<span style="color: #99968b;">  outside an existing chain.</span>

<span style="color: #99968b;">  shouldIgnoreSenderVerification : This prevents the check to ensure</span>
<span style="color: #99968b;">  that the player responded to the right sender when checking for</span>
<span style="color: #99968b;">  mission completion.</span>
<span style="color: #99968b;">  </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">mission</span> <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"testMission0"</span> <span style="color: #cae682;">activeCheck</span>=<span style="color: #95e454;">"true"</span>
  <span style="color: #cae682;">shouldIgnoreSenderVerification</span>=<span style="color: #95e454;">"false"</span>&gt;
    &lt;<span style="color: #cae682;">goals</span>&gt;
      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">All goals must be completed for mission completion </span><span style="color: #99968b;">--&gt;</span>
      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filedeletion"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"asdf.txt"</span>
            <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"clearfolder"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filedownload"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"downloadFile.txt"</span>
            <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filechange"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"changeFile.txt"</span>
            <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">keyword</span>=<span style="color: #95e454;">"extension"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"filechange"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"changeFile.txt"</span>
            <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">keyword</span>=<span style="color: #95e454;">"data"</span> <span style="color: #cae682;">removal</span>=<span style="color: #95e454;">"true"</span> <span style="color: #cae682;">caseSensitive</span>=<span style="color: #95e454;">"true"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"getadmin"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"getstring"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"password"</span> /&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"delay"</span> <span style="color: #cae682;">time</span>=<span style="color: #95e454;">"10.0"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"hasflag"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"flagName"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fileupload"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"asdf.txt"</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>
            <span style="color: #cae682;">destTarget</span>=<span style="color: #95e454;">"introFactionHomeNode"</span> <span style="color: #cae682;">destPath</span>=<span style="color: #95e454;">"Drop/Uploads"</span>/&gt;

      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"fileupload"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">file</span>=<span style="color: #95e454;">"asdf2.dec"</span> <span style="color: #cae682;">path</span>=<span style="color: #95e454;">"home"</span>
            <span style="color: #cae682;">destTarget</span>=<span style="color: #95e454;">"introFactionHomeNode"</span> <span style="color: #cae682;">destPath</span>=<span style="color: #95e454;">"home"</span> <span style="color: #cae682;">decrypt</span>=<span style="color: #95e454;">"true"</span>
            <span style="color: #cae682;">decryptPass</span>=<span style="color: #95e454;">"password"</span>/&gt;

      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Task to add the degree matching the degree name and uni and</span>
<span style="color: #99968b;">           GPA details for the listed owner.</span>

<span style="color: #99968b;">           This task *requires* an academic server to exist.  An owner is defined</span>
<span style="color: #99968b;">           by name - to add a person to the simulation, define them in the People</span>
<span style="color: #99968b;">           folder and refer to them by name here.</span>

<span style="color: #99968b;">           The academic server must have the following properties:</span>
<span style="color: #99968b;">             1: ID must be "academic"</span>
<span style="color: #99968b;">             2: It must contain an Academic Database Daemon</span>
<span style="color: #99968b;">      </span><span style="color: #99968b;">--&gt;</span>
      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"AddDegree"</span> <span style="color: #cae682;">owner</span>=<span style="color: #95e454;">"John Stalvern"</span>
            <span style="color: #cae682;">degree</span>=<span style="color: #95e454;">"Masters in Digital Security"</span>
            <span style="color: #cae682;">uni</span>=<span style="color: #95e454;">"Manchester University"</span> <span style="color: #cae682;">gpa</span>=<span style="color: #95e454;">"3.0"</span>/&gt;

      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Task to remove all degrees from the academic server for a</span>
<span style="color: #99968b;">           specified owner. Note that for this one, you *MUST* have the ID of</span>
<span style="color: #99968b;">           your database be "academic" or it wont find it.</span>
<span style="color: #99968b;">      </span><span style="color: #99968b;">--&gt;</span>
      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"wipedegrees"</span> <span style="color: #cae682;">owner</span>=<span style="color: #95e454;">"John Stalvern"</span>/&gt;

      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This is mostly useful for detecting sent medical records from</span>
<span style="color: #99968b;">           a medical database.  Medical records have the subject line:</span>
<span style="color: #99968b;">           "MedicalRecord - Lastname_Firstname"</span>
<span style="color: #99968b;">      </span><span style="color: #99968b;">--&gt;</span>
      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"sendemail"</span> <span style="color: #cae682;">mailServer</span>=<span style="color: #95e454;">"jmail"</span> <span style="color: #cae682;">recipient</span>=<span style="color: #95e454;">"mailuser123"</span>
            <span style="color: #cae682;">subject</span>=<span style="color: #95e454;">"Email Subject!"</span>/&gt;

      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">DLC Goals </span><span style="color: #99968b;">--&gt;</span>
      &lt;<span style="color: #cae682;">goal</span> <span style="color: #cae682;">type</span>=<span style="color: #95e454;">"getadminpasswordstring"</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>/&gt;
    &lt;/<span style="color: #cae682;">goals</span>&gt;

    &lt;<span style="color: #cae682;">missionStart</span> <span style="color: #cae682;">val</span>=<span style="color: #95e454;">"7"</span> <span style="color: #cae682;">suppress</span>=<span style="color: #95e454;">"true"</span>&gt;changeSong&lt;/<span style="color: #cae682;">missionStart</span>&gt;
    &lt;<span style="color: #cae682;">missionEnd</span> <span style="color: #cae682;">val</span>=<span style="color: #95e454;">"1"</span>&gt;addRank&lt;/<span style="color: #cae682;">missionEnd</span>&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">The IsSilent flag is... admittedly in a terrible place here. It</span>
<span style="color: #99968b;">         silenced THIS mission, not the next one. This means that if you set</span>
<span style="color: #99968b;">         IsSilent to be true here, this mission will not send and email when it</span>
<span style="color: #99968b;">         is loaded.</span>

<span style="color: #99968b;">         Important detail about mission completion: For a reply to work,</span>
<span style="color: #99968b;">         the mission the player is currently on my have the same email sender</span>
<span style="color: #99968b;">         field as the email they reply to in their inbox. This means that if</span>
<span style="color: #99968b;">         you have a silent connector mission, make sure it has the same sender</span>
<span style="color: #99968b;">         filled in in the email field.</span>

<span style="color: #99968b;">         If you want there to be no mission following this one (For</span>
<span style="color: #99968b;">         example, the email mission that introduces you to a hub server) set</span>
<span style="color: #99968b;">         nextMission to "NONE"</span>
<span style="color: #99968b;">    </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">nextMission</span> <span style="color: #cae682;">IsSilent</span>=<span style="color: #95e454;">"false"</span>&gt;NONE&lt;/<span style="color: #cae682;">nextMission</span>&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Next up are Branch missions (Optional)</span>
<span style="color: #99968b;">    Note that the branch mission's email will not be sent - they are all</span>
<span style="color: #99968b;">    loaded in silent mode.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">branchMissions</span>&gt;
      &lt;<span style="color: #cae682;">branch</span>&gt;Missions/BranchExample/TestBranchMission.xml&lt;/<span style="color: #cae682;">branch</span>&gt;
      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">You can have more than one branch mission here </span><span style="color: #99968b;">--&gt;</span>
    &lt;/<span style="color: #cae682;">branchMissions</span>&gt;
    &lt;<span style="color: #cae682;">posting</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"Do the Extension Test Mission"</span> <span style="color: #cae682;">reqs</span>=<span style="color: #95e454;">"someCustomFlag"</span>
             <span style="color: #cae682;">requiredRank</span>=<span style="color: #95e454;">"3"</span> &gt;
  This is the body text of the posting that will appear when the
mission is clicked on. It should contain a basic outline, with any
warnings the player needs.  Once accepted, the email should contain
full details.&lt;/<span style="color: #cae682;">posting</span>&gt;

    &lt;<span style="color: #cae682;">email</span>&gt;
      <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">The sender field is very important for branching or silent</span>
<span style="color: #99968b;">           mission chains. Even if this file you're editing isn't the</span>
<span style="color: #99968b;">           email on the server the player will be responding to, it</span>
<span style="color: #99968b;">           will still run it's completion checks as long as the player</span>
<span style="color: #99968b;">           is responding to any email from the same sender. This</span>
<span style="color: #99968b;">           doesn't affect basic and normal missions, so if you're not</span>
<span style="color: #99968b;">           doing anything too fancy, don't worry about it.</span><span style="color: #99968b;">--&gt;</span>
      &lt;<span style="color: #cae682;">sender</span>&gt;Matt&lt;/<span style="color: #cae682;">sender</span>&gt;
      &lt;<span style="color: #cae682;">subject</span>&gt;Test Mission Email&lt;/<span style="color: #cae682;">subject</span>&gt;
      &lt;<span style="color: #cae682;">body</span>&gt;This is the body of the email.  be careful with your
formatting! the hacknet parser does not account for
auto-whitespace added to the left here.  email contents are very
important - small changes in wording can dramatically change how
easy or hard a mission is.  be very conscious about how much you
are hinting at and guiding the player, and understand that it will
be much harder for everyone that's not you.

Good luck,
-Matt
      &lt;/<span style="color: #cae682;">body</span>&gt;

      &lt;<span style="color: #cae682;">attachments</span>&gt;
        &lt;<span style="color: #cae682;">note</span> <span style="color: #cae682;">title</span>=<span style="color: #95e454;">"An example note"</span>&gt;Experiment with note formatting!
Remember that the note space is very small, so text overflow
onto new lines happens quickly.

Guide the player! Hacknet missions are very frustrating when the
player has too little direction and cant continue.
        &lt;/<span style="color: #cae682;">note</span>&gt;

        &lt;<span style="color: #cae682;">link</span> <span style="color: #cae682;">comp</span>=<span style="color: #95e454;">"missionTestNode"</span> /&gt;
        &lt;<span style="color: #cae682;">account</span> <span style="color: #cae682;">comp</span>=<span style="color: #95e454;">"missionTestNode"</span> <span style="color: #cae682;">user</span>=<span style="color: #95e454;">"TestUser"</span> <span style="color: #cae682;">pass</span>=<span style="color: #95e454;">"testpass"</span> /&gt;
      &lt;/<span style="color: #cae682;">attachments</span>&gt;
    &lt;/<span style="color: #cae682;">email</span>&gt;
  &lt;/<span style="color: #cae682;">mission</span>&gt;
</pre>
</div>
</div>
</div>
</div>
