FeatureList.org
* DONE Actions
  Actions can be triggered as:
  - MissionStart or MissionEnd functions
  - Faction rank progressing
  - ConditionalActionSets having a condition met
** Action List
*** RunFunction
     Runs a mission function - see Mission -> missionStart/missionEnd for the full list.
**** Attributes
     + FunctionName
       - The name of the mission function
     + FunctionValue
       - The "val" parameter of the mission function, in quotes.
**** Example
     #+BEGIN_SRC nxml
       <RunFunction FunctionName="changeSong" FunctionValue="6" />
     #+END_SRC
*** LoadMission
    Immediately loads a mission, replacing the current mission and sending the email.
**** Attributes
     + MissionName
       - A filepath to the new mission
**** Example
     #+BEGIN_SRC nxml
       <LoadMission MissionName="Missions/ExampleMission.xml" />
     #+END_SRC
*** AddAsset
    Creates a file with the listed content in the denoted location.
    This cannot create subfolders - the folder must already exist.
    For longer files, use CopyAsset and copy from a secret computer.
**** Attributes
     + FileName
       - The name of the file on the system
     + FileContents
       - The contents of the file
       - *Does not support multiple lines* - useful for wildcards
       - For longer files, use CopyAsset
     + TargetComp
       - The ID of the target computer
     + TargetFolderpath
       - The path to the folder into which the asset is added
**** Example
     #+BEGIN_SRC nxml
       <AddAsset
	   FileName="MemForensics.exe"
	   FileContents="#MEM_FORENSICS_EXE#"
	   TargetComp="advExamplePC"
	   TargetFolderpath="bin" />
     #+END_SRC
*** CopyAsset
    Copies a file from one computer to another.
    This cannot create subfolders - the folder must already exist.
    Also used for "creating" multi-line files if needed.
**** Attributes
     + DestFilePath
       - A filepath to the copied file on the destination computer
     + DestComp
       - The ID of the destination computer
     + SourceComp
       - The ID of the source computer
     + SourceFileName
       - The name of the file to be copied on the source computer
     + SourceFilePath
       - A filepath to the copied file on the source computer
**** Example
     #+BEGIN_SRC nxml
       <CopyAsset
	   DestFilePath="linkNode1"
	   DestComp="advExamplePC"
	   SourceComp="advExamplePC"
	   SourceFileName="Test_File.txt"
	   SourceFilePath="home" />
     #+END_SRC
*** AddMissionToHubServer
    Adds a new mission to the hub server.
    Supports missionHubServer, missionListingServer, and DHSDaemon servers.
**** Attributes
     + MissionFilepath
       - A filepath to the mission xml file to be added
     + TargetComp
       - The ID of the hub server
**** Example
     #+BEGIN_SRC nxml
       <AddMissionToHubServer
	   MissionFilepath="Missions/TestExtensionMission1.xml"
	   TargetComp="advExamplePC" />
     #+END_SRC
*** RemoveMissionFromHubServer
    Removes a mission from the hub server, if it exists.
    Supports missionHubServer, missionListingServer, and DHSDaemon servers.
**** Attributes
     + MissionFilepath
       - A filepath to the mission xml file to be removed
     + TargetComp
       - The ID of the hub server
**** Example
     #+BEGIN_SRC nxml
       <RemoveMissionFromHubServer
	   MissionFilepath="Missions/TestExtensionMission1.xml"
	   TargetComp="advExamplePC" />
     #+END_SRC
*** AddThreadToMissionBoard
    Adds a thread to a /el-style message board.
    The thread should be properly formatted in UTF-8 plaintext.
**** Attributes
     + ThreadFilepath
       - A filepath to the thread file
     + TargetComp
       - The ID of the message board
**** Example
     #+BEGIN_SRC nxml
       <AddThreadToMissionBoard
	   ThreadFilepath="Nodes/MessageBoardThreads/ExampleThread1.txt"
	   TargetComp="advExamplePC" />
     #+END_SRC
*** AddIRCMessage
    Adds a message to a DHSDaemon or IRCDaemon IRC.
    Use @#PLAYERNAME# to notify the player, and @channel to notify everyone.
    See the example for syntax on adding attachments as IRC messages.
**** Attributes
     + Author
       - The username of the person sending the message
     + TargetComp
       - The ID of the IRC server
     + Delay
       - The number of seconds until the post appears in the IRC
       - Use this functionality to chain messages at the start/end of a mission
