index.html
<div id="outline-container-orge359d7d" class="outline-2">
<h2 id="orge359d7d">Actions</h2>
<div class="outline-text-2" id="text-orge359d7d">
<p>
Actions can be triggered as:<br />
</p>
<ul class="org-ul">
<li>MissionStart or MissionEnd functions<br /></li>
<li>Faction rank progressing<br /></li>
<li>ConditionalActionSets having a condition met<br /></li>
</ul>
</div>
<div id="outline-container-org2b3bd7e" class="outline-3">
<h3 id="org2b3bd7e">Action List</h3>
<div class="outline-text-3" id="text-org2b3bd7e">
</div>
<div id="outline-container-orgfe774d9" class="outline-4">
<h4 id="orgfe774d9">RunFunction</h4>
<div class="outline-text-4" id="text-orgfe774d9">
<p>
Runs a mission function - see Mission -&gt; missionStart/missionEnd for the full list.<br />
</p>
</div>
<div id="outline-container-orgf0fa95f" class="outline-5">
<h5 id="orgf0fa95f">Attributes</h5>
<div class="outline-text-5" id="text-orgf0fa95f">
<ul class="org-ul">
<li>FunctionName<br />
<ul class="org-ul">
<li>The name of the mission function<br /></li>
</ul></li>
<li>FunctionValue<br />
<ul class="org-ul">
<li>The "val" parameter of the mission function, in quotes.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf5e611c" class="outline-5">
<h5 id="orgf5e611c">Example</h5>
<div class="outline-text-5" id="text-orgf5e611c">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">RunFunction</span> <span style="color: #cae682;">FunctionName</span>=<span style="color: #95e454;">"changeSong"</span> <span style="color: #cae682;">FunctionValue</span>=<span style="color: #95e454;">"6"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc1ed1d1" class="outline-4">
<h4 id="orgc1ed1d1">LoadMission</h4>
<div class="outline-text-4" id="text-orgc1ed1d1">
<p>
Immediately loads a mission, replacing the current mission and sending the email.<br />
</p>
</div>
<div id="outline-container-orgc7957ab" class="outline-5">
<h5 id="orgc7957ab">Attributes</h5>
<div class="outline-text-5" id="text-orgc7957ab">
<ul class="org-ul">
<li>MissionName<br />
<ul class="org-ul">
<li>A filepath to the new mission<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd9677ca" class="outline-5">
<h5 id="orgd9677ca">Example</h5>
<div class="outline-text-5" id="text-orgd9677ca">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">LoadMission</span> <span style="color: #cae682;">MissionName</span>=<span style="color: #95e454;">"Missions/ExampleMission.xml"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org42b7b57" class="outline-4">
<h4 id="org42b7b57">AddAsset</h4>
<div class="outline-text-4" id="text-org42b7b57">
<p>
Creates a file with the listed content in the denoted location.<br />
This cannot create subfolders - the folder must already exist.<br />
For longer files, use CopyAsset and copy from a secret computer.<br />
</p>
</div>
<div id="outline-container-orgca9fdde" class="outline-5">
<h5 id="orgca9fdde">Attributes</h5>
<div class="outline-text-5" id="text-orgca9fdde">
<ul class="org-ul">
<li>FileName<br />
<ul class="org-ul">
<li>The name of the file on the system<br /></li>
</ul></li>
<li>FileContents<br />
<ul class="org-ul">
<li>The contents of the file<br /></li>
<li><b>Does not support multiple lines</b> - useful for wildcards<br /></li>
<li>For longer files, use CopyAsset<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>TargetFolderpath<br />
<ul class="org-ul">
<li>The path to the folder into which the asset is added<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3ad0d17" class="outline-5">
<h5 id="org3ad0d17">Example</h5>
<div class="outline-text-5" id="text-org3ad0d17">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">AddAsset</span>
    <span style="color: #cae682;">FileName</span>=<span style="color: #95e454;">"MemForensics.exe"</span>
    <span style="color: #cae682;">FileContents</span>=<span style="color: #95e454;">"#MEM_FORENSICS_EXE#"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">TargetFolderpath</span>=<span style="color: #95e454;">"bin"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7e907b6" class="outline-4">
<h4 id="org7e907b6">CopyAsset</h4>
<div class="outline-text-4" id="text-org7e907b6">
<p>
Copies a file from one computer to another.<br />
This cannot create subfolders - the folder must already exist.<br />
Also used for "creating" multi-line files if needed.<br />
</p>
</div>
<div id="outline-container-org25cc046" class="outline-5">
<h5 id="org25cc046">Attributes</h5>
<div class="outline-text-5" id="text-org25cc046">
<ul class="org-ul">
<li>DestFilePath<br />
<ul class="org-ul">
<li>A filepath to the copied file on the destination computer<br /></li>
</ul></li>
<li>DestComp<br />
<ul class="org-ul">
<li>The ID of the destination computer<br /></li>
</ul></li>
<li>SourceComp<br />
<ul class="org-ul">
<li>The ID of the source computer<br /></li>
</ul></li>
<li>SourceFileName<br />
<ul class="org-ul">
<li>The name of the file to be copied on the source computer<br /></li>
</ul></li>
<li>SourceFilePath<br />
<ul class="org-ul">
<li>A filepath to the copied file on the source computer<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org65e7d7a" class="outline-5">
<h5 id="org65e7d7a">Example</h5>
<div class="outline-text-5" id="text-org65e7d7a">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">CopyAsset</span>
    <span style="color: #cae682;">DestFilePath</span>=<span style="color: #95e454;">"linkNode1"</span>
    <span style="color: #cae682;">DestComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">SourceComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">SourceFileName</span>=<span style="color: #95e454;">"Test_File.txt"</span>
    <span style="color: #cae682;">SourceFilePath</span>=<span style="color: #95e454;">"home"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2e74167" class="outline-4">
<h4 id="org2e74167">AddMissionToHubServer</h4>
<div class="outline-text-4" id="text-org2e74167">
<p>
Adds a new mission to the hub server.<br />
Supports missionHubServer, missionListingServer, and DHSDaemon servers.<br />
</p>
</div>
<div id="outline-container-org7bd3e59" class="outline-5">
<h5 id="org7bd3e59">Attributes</h5>
<div class="outline-text-5" id="text-org7bd3e59">
<ul class="org-ul">
<li>MissionFilepath<br />
<ul class="org-ul">
<li>A filepath to the mission xml file to be added<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the hub server<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga2d2fe6" class="outline-5">
<h5 id="orga2d2fe6">Example</h5>
<div class="outline-text-5" id="text-orga2d2fe6">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">AddMissionToHubServer</span>
    <span style="color: #cae682;">MissionFilepath</span>=<span style="color: #95e454;">"Missions/TestExtensionMission1.xml"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3ef539f" class="outline-4">
<h4 id="org3ef539f">RemoveMissionFromHubServer</h4>
<div class="outline-text-4" id="text-org3ef539f">
<p>
Removes a mission from the hub server, if it exists.<br />
Supports missionHubServer, missionListingServer, and DHSDaemon servers.<br />
</p>
</div>
<div id="outline-container-orgd07c234" class="outline-5">
<h5 id="orgd07c234">Attributes</h5>
<div class="outline-text-5" id="text-orgd07c234">
<ul class="org-ul">
<li>MissionFilepath<br />
<ul class="org-ul">
<li>A filepath to the mission xml file to be removed<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the hub server<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5274daf" class="outline-5">
<h5 id="org5274daf">Example</h5>
<div class="outline-text-5" id="text-org5274daf">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">RemoveMissionFromHubServer</span>
    <span style="color: #cae682;">MissionFilepath</span>=<span style="color: #95e454;">"Missions/TestExtensionMission1.xml"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7443f84" class="outline-4">
<h4 id="org7443f84">AddThreadToMissionBoard</h4>
<div class="outline-text-4" id="text-org7443f84">
<p>
Adds a thread to a /el-style message board.<br />
The thread should be properly formatted in UTF-8 plaintext.<br />
</p>
</div>
<div id="outline-container-orgf72d162" class="outline-5">
<h5 id="orgf72d162">Attributes</h5>
<div class="outline-text-5" id="text-orgf72d162">
<ul class="org-ul">
<li>ThreadFilepath<br />
<ul class="org-ul">
<li>A filepath to the thread file<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the message board<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgef568ac" class="outline-5">
<h5 id="orgef568ac">Example</h5>
<div class="outline-text-5" id="text-orgef568ac">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">AddThreadToMissionBoard</span>
    <span style="color: #cae682;">ThreadFilepath</span>=<span style="color: #95e454;">"Nodes/MessageBoardThreads/ExampleThread1.txt"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga7b9e00" class="outline-4">
<h4 id="orga7b9e00">AddIRCMessage</h4>
<div class="outline-text-4" id="text-orga7b9e00">
<p>
Adds a message to a DHSDaemon or IRCDaemon IRC.<br />
Use @#PLAYERNAME# to notify the player, and @channel to notify everyone.<br />
See the example for syntax on adding attachments as IRC messages.<br />
</p>
</div>
<div id="outline-container-orgb67d66d" class="outline-5">
<h5 id="orgb67d66d">Attributes</h5>
<div class="outline-text-5" id="text-orgb67d66d">
<ul class="org-ul">
<li>Author<br />
<ul class="org-ul">
<li>The username of the person sending the message<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the IRC server<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds until the post appears in the IRC<br /></li>
<li>Use this functionality to chain messages at the start/end of a mission<br /></li>
</ul></li>
</ul>
</div>
</div>
