FeatureList.org
**** Example
     #+BEGIN_SRC nxml
       <AddIRCMessage Author="HA0" TargetComp="advExamplePC" Delay="3.0">
       Hey @#PLAYERNAME# - check out the new asset that got added a few lines ago.
       </AddIRCMessage>

       <AddIRCMessage Author="DependableSkeleton" TargetComp="advExamplePC"
		      Delay="8.0">@channel this notifies everyone!</AddIRCMessage>

       <AddIRCMessage Author="P4rt1cul4rity" TargetComp="advExamplePC" Delay="3.0">
       !ATTACHMENT:note#%#Note Title#%#Note Content
       Note line 2
       etc</AddIRCMessage>

       <AddIRCMessage Author="P4rt1cul4rity" TargetComp="advExamplePC" Delay="3.0">
       !ATTACHMENT:link#%#ComputerName#%#123.123.123.123</AddIRCMessage>

       <AddIRCMessage Author="P4rt1cul4rity" TargetComp="advExamplePC" Delay="3.0">
	 !ATTACHMENT:account#%#TargetCompID#%#69.58.186.118#%#username#%#password
       </AddIRCMessage>
     #+END_SRC
*** CrashComputer
    Crashes the computer with TargetComp ID.
    If the target computer is the player's, it will bluescreen it instantly.
    Other computers will be removed from the netmap for ~15 seconds and DC the player.
    Leaves a log of who did it - use for secrets, generally, since people will rm * log folders.
**** Attributes
     + TargetComp
       - The ID of the target computer
     + CrashSource
       - The ID of the computer that caused the crash
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the crash occurs
**** Example
     #+BEGIN_SRC nxml
       <CrashComputer
	   TargetComp="linkNode1"
	   CrashSource="advExamplePC"
	   DelayHost="advExamplePC"
	   Delay="5.5" />
     #+END_SRC
*** DeleteFile
    Deletes a file from the target computer, doing nothing if the file does not exist.
**** Attributes
     + TargetComp
       - The ID of the target computer
     + FilePath
       - A filepath to the file to be removed
     + FileName
       - The name of the file to be removed
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the file is deleted
**** Example
     #+BEGIN_SRC nxml
       <DeleteFile
	   TargetComp="advExamplePC"
	   FilePath="bin"
	   FileName="Binary_File"
	   DelayHost="advExamplePC"
	   Delay="5.5"/>
     #+END_SRC
*** AddConditionalActions
    Loads in a new set of conditional actions from a file.
**** Attributes
     + Filepath
       - A filepath to the conditional action set xml file
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the conditional actions are added
**** Example
     #+BEGIN_SRC nxml
       <AddConditionalActions
	   ilepath="ExampleConditionalActionSet.xml"
	   DelayHost="advExamplePC"
	   Delay="5.5"/>
     #+END_SRC
*** SaveGame
    Saves the game for the player.
    Do this during extremely long missions without other save triggers!
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the crash occurs
**** Example
     #+BEGIN_SRC nxml
       <SaveGame DelayHost="advExamplePC" Delay="20.5"/>
     #+END_SRC
*** LaunchHackScript
    Launches the Hacker script defined. Can be friend or foe.
    See the Hacker Scripts section for more details on the hacker script itself.
**** Attributes
     + Filepath
       - A filepath to the hacker script to be run
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the script launches
     + SourceComp
       - The ID or IP of the computer running the script
     + TargetComp
       - The ID or IP of the computer targeted by the script
     + RequireLogsOnSource
       - If true, the script only runs if the source computer has logs of activity by the player
     + RequireSourceIntact
       - If true, the script only runs if it has its networking file in /sys
**** Example
     #+BEGIN_SRC nxml
       <LaunchHackScript
	   Filepath="HackerScripts/ExampleHack.txt"
	   DelayHost="advExamplePC"
	   Delay="5.5"
	   SourceComp="advExamplePC"
	   TargetComp="playerComp"
	   RequireLogsOnSource="false"
	   RequireSourceIntact="true"/>
     #+END_SRC
