index.html
<div id="outline-container-org5d0bf5b" class="outline-5">
<h5 id="org5d0bf5b">Example</h5>
<div class="outline-text-5" id="text-org5d0bf5b">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"HA0"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.0"</span>&gt;
Hey @#PLAYERNAME# - check out the new asset that got added a few lines ago.
&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;

&lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
               <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"8.0"</span>&gt;@channel this notifies everyone!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;

&lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"P4rt1cul4rity"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.0"</span>&gt;
!ATTACHMENT:note#%#Note Title#%#Note Content
Note line 2
etc&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;

&lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"P4rt1cul4rity"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.0"</span>&gt;
!ATTACHMENT:link#%#ComputerName#%#123.123.123.123&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;

&lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"P4rt1cul4rity"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.0"</span>&gt;
  !ATTACHMENT:account#%#TargetCompID#%#69.58.186.118#%#username#%#password
&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org03a88e3" class="outline-4">
<h4 id="org03a88e3">CrashComputer</h4>
<div class="outline-text-4" id="text-org03a88e3">
<p>
Crashes the computer with TargetComp ID.<br />
If the target computer is the player's, it will bluescreen it instantly.<br />
Other computers will be removed from the netmap for ~15 seconds and DC the player.<br />
Leaves a log of who did it - use for secrets, generally, since people will rm * log folders.<br />
</p>
</div>
<div id="outline-container-org66a90ee" class="outline-5">
<h5 id="org66a90ee">Attributes</h5>
<div class="outline-text-5" id="text-org66a90ee">
<ul class="org-ul">
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>CrashSource<br />
<ul class="org-ul">
<li>The ID of the computer that caused the crash<br /></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the crash occurs<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7955841" class="outline-5">
<h5 id="org7955841">Example</h5>
<div class="outline-text-5" id="text-org7955841">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">CrashComputer</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"linkNode1"</span>
    <span style="color: #cae682;">CrashSource</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge3b9b4d" class="outline-4">
<h4 id="orge3b9b4d">DeleteFile</h4>
<div class="outline-text-4" id="text-orge3b9b4d">
<p>
Deletes a file from the target computer, doing nothing if the file does not exist.<br />
</p>
</div>
<div id="outline-container-org8a02ea1" class="outline-5">
<h5 id="org8a02ea1">Attributes</h5>
<div class="outline-text-5" id="text-org8a02ea1">
<ul class="org-ul">
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>FilePath<br />
<ul class="org-ul">
<li>A filepath to the file to be removed<br /></li>
</ul></li>
<li>FileName<br />
<ul class="org-ul">
<li>The name of the file to be removed<br /></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the file is deleted<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga1cf5a1" class="outline-5">
<h5 id="orga1cf5a1">Example</h5>
<div class="outline-text-5" id="text-orga1cf5a1">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">DeleteFile</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">FilePath</span>=<span style="color: #95e454;">"bin"</span>
    <span style="color: #cae682;">FileName</span>=<span style="color: #95e454;">"Binary_File"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaf7295a" class="outline-4">
<h4 id="orgaf7295a">AddConditionalActions</h4>
<div class="outline-text-4" id="text-orgaf7295a">
<p>
Loads in a new set of conditional actions from a file.<br />
</p>
</div>
<div id="outline-container-org6e2defe" class="outline-5">
<h5 id="org6e2defe">Attributes</h5>
<div class="outline-text-5" id="text-org6e2defe">
<ul class="org-ul">
<li>Filepath<br />
<ul class="org-ul">
<li>A filepath to the conditional action set xml file<br /></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the conditional actions are added<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3dd4ca1" class="outline-5">
<h5 id="org3dd4ca1">Example</h5>
<div class="outline-text-5" id="text-org3dd4ca1">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">AddConditionalActions</span>
    <span style="color: #cae682;">ilepath</span>=<span style="color: #95e454;">"ExampleConditionalActionSet.xml"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org940e7f4" class="outline-4">
<h4 id="org940e7f4">SaveGame</h4>
<div class="outline-text-4" id="text-org940e7f4">
<p>
Saves the game for the player.<br />
Do this during extremely long missions without other save triggers!<br />
</p>
</div>
<div id="outline-container-org5805ca8" class="outline-5">
<h5 id="org5805ca8">Attributes</h5>
<div class="outline-text-5" id="text-org5805ca8">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the crash occurs<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org72a7dac" class="outline-5">
<h5 id="org72a7dac">Example</h5>
<div class="outline-text-5" id="text-org72a7dac">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">SaveGame</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"20.5"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga5e9cf3" class="outline-4">
<h4 id="orga5e9cf3">LaunchHackScript</h4>
<div class="outline-text-4" id="text-orga5e9cf3">
<p>
Launches the Hacker script defined. Can be friend or foe.<br />
See the Hacker Scripts section for more details on the hacker script itself.<br />
</p>
</div>
<div id="outline-container-org919af02" class="outline-5">
<h5 id="org919af02">Attributes</h5>
<div class="outline-text-5" id="text-org919af02">
<ul class="org-ul">
<li>Filepath<br />
<ul class="org-ul">
<li>A filepath to the hacker script to be run<br /></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the script launches<br /></li>
</ul></li>
<li>SourceComp<br />
<ul class="org-ul">
<li>The ID or IP of the computer running the script<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID or IP of the computer targeted by the script<br /></li>
</ul></li>
<li>RequireLogsOnSource<br />
<ul class="org-ul">
<li>If true, the script only runs if the source computer has logs of activity by the player<br /></li>
</ul></li>
<li>RequireSourceIntact<br />
<ul class="org-ul">
<li>If true, the script only runs if it has its networking file in /sys<br /></li>
</ul></li>
</ul>
</div>
</div>
