FeatureList.org
*** SwitchToTheme
    Switches the player to the listed themes.
    Themes can be referenced directly (see Computer -> Files -> Wildcard List -> Main Game) or by a path to a custom theme file.
**** Attributes
     + ThemePathOrName
       - Either the direct name of the theme or a path to a custom theme
     + FlickerInDuration
       - How long it takes for the new theme to flicker into existence
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the theme transition begins
**** Example
     #+BEGIN_SRC nxml
       <SwitchToTheme
	   ThemePathOrName="Themes/ExampleTheme.xml"
	   FlickerInDuration="3.0"
	   DelayHost="advExamplePC"
	   Delay="15.5" />
     #+END_SRC
*** StartScreenBleedEffect
    Begins the screen bleed effect (as the end of the main game)
    Title and first three lines are shown in alert window.
    If the screenbleed effect ends, an action can be triggered.
**** Attributes
     + AlertTitle
       - The title associated with the screen bleed effect
     + CompleteAction
       - The filepath to an Action XML file
       - Runs if the screenbleed effect finishes normally
     + TotalDurationSeconds
       - How long the effect lasts
       - Also determines when CompleteAction will run
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the screenbleed begins
**** Example
     #+BEGIN_SRC nxml
       <StartScreenBleedEffect
	   AlertTitle="Title"
	   CompleteAction="Actions/HackerScriptActions.xml"
	   TotalDurationSeconds="12.5"
	   DelayHost="advExamplePC"
	   Delay="3.5">Line one
       Line two
       Line Three!</StartScreenBleedEffect>
     #+END_SRC
*** CancelScreenBleedEffect
    Kills an ongoing screenbleed effect.
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the screenbleed ends
**** Example
     #+BEGIN_SRC nxml
       <CancelScreenBleedEffect DelayHost="advExamplePC" Delay="9.5" />
     #+END_SRC
*** AppendToFile
    Appends the tag's contents to the specified files.
    Useful for adding people to whitelists (#PLAYER_IP#)
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the file is appended to
     + TargetComp
       - The ID of the target computer
     + TargetFolderpath
       - The folder in which the file is stored
     + TargetFilename
       - The name of the file to be appended to
**** Example
     #+BEGIN_SRC nxml
       <AppendToFile
	   DelayHost="advExamplePC"
	   Delay="12.5"
	   TargetComp="advExamplePC"
	   TargetFolderpath="Whitelist"
	   TargetFilename="list.txt">#PLAYER_IP#</AppendToFile>
     #+END_SRC
*** KillExe
    Kills all exes that contain the string mentioned.
    Useful for killing ESequencer (or shells by rival hacker)
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the exe is killed
     + ExeName
       - A string contained in the exe name
       - Use * to kill all running programs
**** Example
     #+BEGIN_SRC nxml
       <KillExe DelayHost="advExamplePC" Delay="15.5" ExeName="ssh" />
     #+END_SRC
*** HideNode
    Hides the target computer node from the netmap if it's visible
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the node is hidden
     + TargetComp
       - The ID of the computer to be hidden
**** Example
     #+BEGIN_SRC nxml
       <HideNode DelayHost="advExamplePC" Delay="15.5" TargetComp="advExamplePC" />
     #+END_SRC
*** GivePlayerUserAccount
    Reveals this user account to the player for the purpose of autocomplete
