index.html
<div id="outline-container-org8dd3fdc" class="outline-5">
<h5 id="org8dd3fdc">Example</h5>
<div class="outline-text-5" id="text-org8dd3fdc">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">LaunchHackScript</span>
    <span style="color: #cae682;">Filepath</span>=<span style="color: #95e454;">"HackerScripts/ExampleHack.txt"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span>
    <span style="color: #cae682;">SourceComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"playerComp"</span>
    <span style="color: #cae682;">RequireLogsOnSource</span>=<span style="color: #95e454;">"false"</span>
    <span style="color: #cae682;">RequireSourceIntact</span>=<span style="color: #95e454;">"true"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb087dd9" class="outline-4">
<h4 id="orgb087dd9">SwitchToTheme</h4>
<div class="outline-text-4" id="text-orgb087dd9">
<p>
Switches the player to the listed themes.<br />
Themes can be referenced directly (see Computer -&gt; Files -&gt; Wildcard List -&gt; Main Game) or by a path to a custom theme file.<br />
</p>
</div>
<div id="outline-container-orgd625ff8" class="outline-5">
<h5 id="orgd625ff8">Attributes</h5>
<div class="outline-text-5" id="text-orgd625ff8">
<ul class="org-ul">
<li>ThemePathOrName<br />
<ul class="org-ul">
<li>Either the direct name of the theme or a path to a custom theme<br /></li>
</ul></li>
<li>FlickerInDuration<br />
<ul class="org-ul">
<li>How long it takes for the new theme to flicker into existence<br /></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the theme transition begins<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org83f0d21" class="outline-5">
<h5 id="org83f0d21">Example</h5>
<div class="outline-text-5" id="text-org83f0d21">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">SwitchToTheme</span>
    <span style="color: #cae682;">ThemePathOrName</span>=<span style="color: #95e454;">"Themes/ExampleTheme.xml"</span>
    <span style="color: #cae682;">FlickerInDuration</span>=<span style="color: #95e454;">"3.0"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org658ddfd" class="outline-4">
<h4 id="org658ddfd">StartScreenBleedEffect</h4>
<div class="outline-text-4" id="text-org658ddfd">
<p>
Begins the screen bleed effect (as the end of the main game)<br />
Title and first three lines are shown in alert window.<br />
If the screenbleed effect ends, an action can be triggered.<br />
</p>
</div>
<div id="outline-container-orgd4a94e8" class="outline-5">
<h5 id="orgd4a94e8">Attributes</h5>
<div class="outline-text-5" id="text-orgd4a94e8">
<ul class="org-ul">
<li>AlertTitle<br />
<ul class="org-ul">
<li>The title associated with the screen bleed effect<br /></li>
</ul></li>
<li>CompleteAction<br />
<ul class="org-ul">
<li>The filepath to an Action XML file<br /></li>
<li>Runs if the screenbleed effect finishes normally<br /></li>
</ul></li>
<li>TotalDurationSeconds<br />
<ul class="org-ul">
<li>How long the effect lasts<br /></li>
<li>Also determines when CompleteAction will run<br /></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the screenbleed begins<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbf50083" class="outline-5">
<h5 id="orgbf50083">Example</h5>
<div class="outline-text-5" id="text-orgbf50083">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">StartScreenBleedEffect</span>
    <span style="color: #cae682;">AlertTitle</span>=<span style="color: #95e454;">"Title"</span>
    <span style="color: #cae682;">CompleteAction</span>=<span style="color: #95e454;">"Actions/HackerScriptActions.xml"</span>
    <span style="color: #cae682;">TotalDurationSeconds</span>=<span style="color: #95e454;">"12.5"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.5"</span>&gt;Line one
Line two
Line Three!&lt;/<span style="color: #cae682;">StartScreenBleedEffect</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4084d12" class="outline-4">
<h4 id="org4084d12">CancelScreenBleedEffect</h4>
<div class="outline-text-4" id="text-org4084d12">
<p>
Kills an ongoing screenbleed effect.<br />
</p>
</div>
<div id="outline-container-org5ee75b3" class="outline-5">
<h5 id="org5ee75b3">Attributes</h5>
<div class="outline-text-5" id="text-org5ee75b3">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the screenbleed ends<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1d91c5e" class="outline-5">
<h5 id="org1d91c5e">Example</h5>
<div class="outline-text-5" id="text-org1d91c5e">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">CancelScreenBleedEffect</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"9.5"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8d02810" class="outline-4">
<h4 id="org8d02810">AppendToFile</h4>
<div class="outline-text-4" id="text-org8d02810">
<p>
Appends the tag's contents to the specified files.<br />
Useful for adding people to whitelists (#PLAYER_IP#)<br />
</p>
</div>
<div id="outline-container-org1e58649" class="outline-5">
<h5 id="org1e58649">Attributes</h5>
<div class="outline-text-5" id="text-org1e58649">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the file is appended to<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>TargetFolderpath<br />
<ul class="org-ul">
<li>The folder in which the file is stored<br /></li>
</ul></li>
<li>TargetFilename<br />
<ul class="org-ul">
<li>The name of the file to be appended to<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org06f651d" class="outline-5">
<h5 id="org06f651d">Example</h5>
<div class="outline-text-5" id="text-org06f651d">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">AppendToFile</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"12.5"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">TargetFolderpath</span>=<span style="color: #95e454;">"Whitelist"</span>
    <span style="color: #cae682;">TargetFilename</span>=<span style="color: #95e454;">"list.txt"</span>&gt;#PLAYER_IP#&lt;/<span style="color: #cae682;">AppendToFile</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb0a8610" class="outline-4">
<h4 id="orgb0a8610">KillExe</h4>
<div class="outline-text-4" id="text-orgb0a8610">
<p>
Kills all exes that contain the string mentioned.<br />
Useful for killing ESequencer (or shells by rival hacker)<br />
</p>
</div>
<div id="outline-container-orgd299852" class="outline-5">
<h5 id="orgd299852">Attributes</h5>
<div class="outline-text-5" id="text-orgd299852">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the exe is killed<br /></li>
</ul></li>
<li>ExeName<br />
<ul class="org-ul">
<li>A string contained in the exe name<br /></li>
<li>Use * to kill all running programs<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgeb4a16d" class="outline-5">
<h5 id="orgeb4a16d">Example</h5>
<div class="outline-text-5" id="text-orgeb4a16d">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">KillExe</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> <span style="color: #cae682;">ExeName</span>=<span style="color: #95e454;">"ssh"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org06220d8" class="outline-4">
<h4 id="org06220d8">HideNode</h4>
<div class="outline-text-4" id="text-org06220d8">
<p>
Hides the target computer node from the netmap if it's visible<br />
</p>
</div>
<div id="outline-container-org4cbf8ff" class="outline-5">
<h5 id="org4cbf8ff">Attributes</h5>
<div class="outline-text-5" id="text-org4cbf8ff">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the node is hidden<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the computer to be hidden<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5eaf625" class="outline-5">
<h5 id="org5eaf625">Example</h5>
<div class="outline-text-5" id="text-org5eaf625">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">HideNode</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgae1b4a1" class="outline-4">
<h4 id="orgae1b4a1">GivePlayerUserAccount</h4>
<div class="outline-text-4" id="text-orgae1b4a1">
<p>
Reveals this user account to the player for the purpose of autocomplete<br />
</p>
</div>
