FeatureList.org
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the player gains access to the account
     + TargetComp
       - The ID of the target computer
     + Username
       - The username of the account the player gains access to
**** Example
     #+BEGIN_SRC nxml
       <GivePlayerUserAccount
	   DelayHost="advExamplePC"
	   Delay="15.5"
	   TargetComp="advExamplePC"
	   Username="mailGuy" />
     #+END_SRC
*** ChangeIP
    Changes the IP of the target computer to the new address
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the IP is changed
     + TargetComp
       - The ID of the computer whose IP is changed
     + NewIP
       - The new IP address for the target computer
       - Set to be blank or use #RANDOM_IP# for a random one
**** Example
     #+BEGIN_SRC nxml
       <ChangeIP
	   DelayHost="advExamplePC"
	   Delay="15.5"
	   TargetComp="advExamplePC"
	   NewIP="111.111.123.124" />
     #+END_SRC
*** HideAllNodes
    Hides all visible nodes from the netmap
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the nodes are hidden
**** Example
     #+BEGIN_SRC nxml
       <HideAllNodes DelayHost="advExamplePC" Delay="21.5"/>
     #+END_SRC
*** ShowNode
    Reveals the target node on the netmap
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the node is revealed
     + Target
       - The ID of the computer to be revealed
**** Example
     #+BEGIN_SRC nxml
       <ShowNode DelayHost="advExamplePC" Delay="21.5" Target="advExamplePC" />
     #+END_SRC
*** SetLock
    Locks a UI module, making it hidden/visible or not.
**** Attributes
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the module is locked
     + Module
       - The UI module being locked
       - Options:
	 * terminal
	 * ram
	 * netmap
	 * display
     + isLocked
       - Whether the module is locked
     + isHidden
       - Whether the module is hidden
**** Example
     #+BEGIN_SRC nxml
       <SetLock
	   DelayHost="advExamplePC"
	   Delay="21.5"
	   Module="terminal"
	   IsLocked="true"
	   IsHidden="false" />
     #+END_SRC
*** ChangeAlertIcon
    Changes the alert icon to point to a new server.
    Note that only Labyrinths can support anything other than a mail server.
    It can point to a mail server, a message board, or either type of IRC server.
**** Attributes
     + Target
       - The ID of the new server that will send notifications
     + Type
       - The type of server that is now being used
       - Options:
	 * mail
	 * irc
	 * irchub
	 * board
     + DelayHost
       - ID of a computer than can host delayable actions
       - Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost
     + Delay
       - The number of seconds before the icon is changed
**** Example
     #+BEGIN_SRC nxml
       <ChangeAlertIcon
	   Target="advExamplePC"
	   Type="irc"
	   DelayHost="advExamplePC"
	   Delay="9.5"/>
     #+END_SRC
** ConditionalActionSets
   Conditional action sets can be loaded in two ways:
   1) AddConditionalActions action
   2) loadConditionalActions mission function
*** OnConnect
    Triggers when the player connects to the target PC.
**** Attributes
     + target
       - The ID of the machine to connect to
     + needsMissionComplete
       - Whether the mission needs to be complete 
     + requiredFlags
       - A list of any flags needed as well
**** Example
     #+BEGIN_SRC nxml
       <OnConnect
	   target="advExamplePC"
	   needsMissionComplete="true"
	   requiredFlags="decypher">
	   <!-- You can put any action that was described in the Actions section here -->
       </OnConnect>
     #+END_SRC
