index.html
<div id="outline-container-org1734918" class="outline-5">
<h5 id="org1734918">Attributes</h5>
<div class="outline-text-5" id="text-org1734918">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the player gains access to the account<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the target computer<br /></li>
</ul></li>
<li>Username<br />
<ul class="org-ul">
<li>The username of the account the player gains access to<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgae30203" class="outline-5">
<h5 id="orgae30203">Example</h5>
<div class="outline-text-5" id="text-orgae30203">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">GivePlayerUserAccount</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Username</span>=<span style="color: #95e454;">"mailGuy"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgedba595" class="outline-4">
<h4 id="orgedba595">ChangeIP</h4>
<div class="outline-text-4" id="text-orgedba595">
<p>
Changes the IP of the target computer to the new address<br />
</p>
</div>
<div id="outline-container-orgad3ba4a" class="outline-5">
<h5 id="orgad3ba4a">Attributes</h5>
<div class="outline-text-5" id="text-orgad3ba4a">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the IP is changed<br /></li>
</ul></li>
<li>TargetComp<br />
<ul class="org-ul">
<li>The ID of the computer whose IP is changed<br /></li>
</ul></li>
<li>NewIP<br />
<ul class="org-ul">
<li>The new IP address for the target computer<br /></li>
<li>Set to be blank or use #RANDOM_IP# for a random one<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc58762" class="outline-5">
<h5 id="orgbc58762">Example</h5>
<div class="outline-text-5" id="text-orgbc58762">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">ChangeIP</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span>
    <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">NewIP</span>=<span style="color: #95e454;">"111.111.123.124"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1461a06" class="outline-4">
<h4 id="org1461a06">HideAllNodes</h4>
<div class="outline-text-4" id="text-org1461a06">
<p>
Hides all visible nodes from the netmap<br />
</p>
</div>
<div id="outline-container-org8340aec" class="outline-5">
<h5 id="org8340aec">Attributes</h5>
<div class="outline-text-5" id="text-org8340aec">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the nodes are hidden<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org50d3abb" class="outline-5">
<h5 id="org50d3abb">Example</h5>
<div class="outline-text-5" id="text-org50d3abb">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">HideAllNodes</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"21.5"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org82d34ef" class="outline-4">
<h4 id="org82d34ef">ShowNode</h4>
<div class="outline-text-4" id="text-org82d34ef">
<p>
Reveals the target node on the netmap<br />
</p>
</div>
<div id="outline-container-orgcf8b1e7" class="outline-5">
<h5 id="orgcf8b1e7">Attributes</h5>
<div class="outline-text-5" id="text-orgcf8b1e7">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the node is revealed<br /></li>
</ul></li>
<li>Target<br />
<ul class="org-ul">
<li>The ID of the computer to be revealed<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1f49c10" class="outline-5">
<h5 id="org1f49c10">Example</h5>
<div class="outline-text-5" id="text-org1f49c10">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">ShowNode</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"21.5"</span> <span style="color: #cae682;">Target</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgabb01ff" class="outline-4">
<h4 id="orgabb01ff">SetLock</h4>
<div class="outline-text-4" id="text-orgabb01ff">
<p>
Locks a UI module, making it hidden/visible or not.<br />
</p>
</div>
<div id="outline-container-org793ffd7" class="outline-5">
<h5 id="org793ffd7">Attributes</h5>
<div class="outline-text-5" id="text-org793ffd7">
<ul class="org-ul">
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the module is locked<br /></li>
</ul></li>
<li>Module<br />
<ul class="org-ul">
<li>The UI module being locked<br /></li>
<li>Options:<br />
<ul class="org-ul">
<li>terminal<br /></li>
<li>ram<br /></li>
<li>netmap<br /></li>
<li>display<br /></li>
</ul></li>
</ul></li>
<li>isLocked<br />
<ul class="org-ul">
<li>Whether the module is locked<br /></li>
</ul></li>
<li>isHidden<br />
<ul class="org-ul">
<li>Whether the module is hidden<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga3114e3" class="outline-5">
<h5 id="orga3114e3">Example</h5>
<div class="outline-text-5" id="text-orga3114e3">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">SetLock</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"21.5"</span>
    <span style="color: #cae682;">Module</span>=<span style="color: #95e454;">"terminal"</span>
    <span style="color: #cae682;">IsLocked</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">IsHidden</span>=<span style="color: #95e454;">"false"</span> /&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf1a7b82" class="outline-4">
<h4 id="orgf1a7b82">ChangeAlertIcon</h4>
<div class="outline-text-4" id="text-orgf1a7b82">
<p>
Changes the alert icon to point to a new server.<br />
Note that only Labyrinths can support anything other than a mail server.<br />
It can point to a mail server, a message board, or either type of IRC server.<br />
</p>
</div>
<div id="outline-container-orgd5e5390" class="outline-5">
<h5 id="orgd5e5390">Attributes</h5>
<div class="outline-text-5" id="text-orgd5e5390">
<ul class="org-ul">
<li>Target<br />
<ul class="org-ul">
<li>The ID of the new server that will send notifications<br /></li>
</ul></li>
<li>Type<br />
<ul class="org-ul">
<li>The type of server that is now being used<br /></li>
<li>Options:<br />
<ul class="org-ul">
<li>mail<br /></li>
<li>irc<br /></li>
<li>irchub<br /></li>
<li>board<br /></li>
</ul></li>
</ul></li>
<li>DelayHost<br />
<ul class="org-ul">
<li>ID of a computer than can host delayable actions<br /></li>
<li>Must be an IRCDaemon or DLCHubServer daemon computer OR FastActionHost<br /></li>
</ul></li>
<li>Delay<br />
<ul class="org-ul">
<li>The number of seconds before the icon is changed<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3564a61" class="outline-5">
<h5 id="org3564a61">Example</h5>
<div class="outline-text-5" id="text-org3564a61">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">ChangeAlertIcon</span>
    <span style="color: #cae682;">Target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Type</span>=<span style="color: #95e454;">"irc"</span>
    <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"9.5"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org06a24c0" class="outline-3">
<h3 id="org06a24c0">ConditionalActionSets</h3>
<div class="outline-text-3" id="text-org06a24c0">
<p>
Conditional action sets can be loaded in two ways:<br />
</p>
<ol class="org-ol">
<li>AddConditionalActions action<br /></li>
<li>loadConditionalActions mission function<br /></li>
</ol>
</div>
<div id="outline-container-org822132c" class="outline-4">
<h4 id="org822132c">OnConnect</h4>
<div class="outline-text-4" id="text-org822132c">
<p>
Triggers when the player connects to the target PC.<br />
</p>
</div>
<div id="outline-container-orgaa38b1b" class="outline-5">
<h5 id="orgaa38b1b">Attributes</h5>
<div class="outline-text-5" id="text-orgaa38b1b">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the machine to connect to<br /></li>
</ul></li>
<li>needsMissionComplete<br />
<ul class="org-ul">
<li>Whether the mission needs to be complete<br /></li>
</ul></li>
<li>requiredFlags<br />
<ul class="org-ul">
<li>A list of any flags needed as well<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9bd7292" class="outline-5">
<h5 id="org9bd7292">Example</h5>
<div class="outline-text-5" id="text-org9bd7292">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">OnConnect</span>
    <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>
    <span style="color: #cae682;">needsMissionComplete</span>=<span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">requiredFlags</span>=<span style="color: #95e454;">"decypher"</span>&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">You can put any action that was described in the Actions section here </span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">OnConnect</span>&gt;
</pre>
</div>
</div>
</div>
</div>
