FeatureList.org
*** HasFlags
    Triggers when the player has all required flags.
**** Attributes
     + requiredFlags
       - A comma-separated list of necessary flags.
**** Example
     #+BEGIN_SRC nxml
       <HasFlags requiredFlags="decypher,otherFlag">
	   <!-- Actions here -->
       </HasFlags>
     #+END_SRC
*** OnAdminGained
    Triggers when the player achieves admin access to the target machine.
**** Attributes
     + target
       - The ID of the machine which requires admin access
**** Example
     #+BEGIN_SRC nxml
       <OnAdminGained target="advExamplePC">
	   <!-- Actions here -->
       </OnAdminGained>
     #+END_SRC
*** Instantly
    Triggers immediately.
    Actions occur in the order they appear in the file.
**** Attributes
     + needsMissionComplete
       - Whether the mission needs to be complete 
**** Example
     #+BEGIN_SRC nxml
       <Instantly>
	   <!-- Actions here -->
       </Instantly>

       <Instantly needsMissionComplete="true">
	   <!--You can also have the needs mission complete flag on instantly actions-->
	   <AddIRCMessage
	       Author="DependableSkeleton"
	       TargetComp="advExamplePC"
	       Delay="0.3">Second, if mission complete!</AddIRCMessage>
	 </Instantly>
     #+END_SRC
*** DoesNotHaveFlags
    Triggers when the player has none of the listed flags.
**** Attributes
     + Flags
       - A comma-separated list of flags the player must not have
**** Example
     #+BEGIN_SRC nxml
       <DoesNotHaveFlags Flags="SomeFlag,MoreFlags">
	   <!-- Actions here -->
       </DoesNotHaveFlags>
     #+END_SRC
*** OnDisconnect
    Triggers when the player disconnects from the machine.
    If target is unspecified or set to "NONE", triggers on any disconnect.
**** Attributes
     + target
       - The ID of the computer that the player must disconnect from
       - If unspecified or "NONE", allows any computer
**** Example
     #+BEGIN_SRC nxml
       <OnDisconnect target="advExamplePC">
	   <!--Actions here-->
       </OnDisconnect>
     #+END_SRC
*** Example 
    Hastebin link: https://hastebin.com/rodiyumepa.xml
    Simplified contents: 
    #+BEGIN_SRC nxml
      <ConditionalActions>
	<OnConnect target="advExamplePC" needsMissionComplete="true"
		   requiredFlags="decypher">
	  <AddIRCMessage Author="DependableSkeleton" TargetComp="advExamplePC"
			 Delay="2.1">
	  Hey, you're back, having just completed your mission.</AddIRCMessage>
	</OnConnect>

	<HasFlags requiredFlags="decypher,otherFlag">
	  <AddIRCMessage Author="DependableSkeleton"
			 TargetComp="advExamplePC"
			 Delay="0.1">has some flags!</AddIRCMessage>
	</HasFlags>

	<OnAdminGained target="advExamplePC">
	  <AddIRCMessage Author="DependableSkeleton"
			 TargetComp="advExamplePC"
			 Delay="2.1">
	  Wow, nice! You got admin on the example server.</AddIRCMessage>
	  </OnAdminGained>

	  <Instantly>
	    <AddIRCMessage Author="DependableSkeleton"
			   TargetComp="advExamplePC"
			   Delay="0.1">First!</AddIRCMessage>
	  </Instantly>

	  <DoesNotHaveFlags Flags="SomeFlag,MoreFlags">
	    <AddIRCMessage Author="DependableSkeleton"
			   TargetComp="advExamplePC"
			   Delay="0.1">doesn't have some other flags!</AddIRCMessage>
	  </DoesNotHaveFlags>

	  <OnDisconnect>
	    <AddIRCMessage Author="DependableSkeleton"
			   TargetComp="advExamplePC"
			   Delay="0.1">Disconnected!</AddIRCMessage>
	  </OnDisconnect>

      </ConditionalActions>
    #+END_SRC
* TODO Factions
