index.html
<div id="outline-container-org42fcf5a" class="outline-4">
<h4 id="org42fcf5a">HasFlags</h4>
<div class="outline-text-4" id="text-org42fcf5a">
<p>
Triggers when the player has all required flags.<br />
</p>
</div>
<div id="outline-container-orgca4375b" class="outline-5">
<h5 id="orgca4375b">Attributes</h5>
<div class="outline-text-5" id="text-orgca4375b">
<ul class="org-ul">
<li>requiredFlags<br />
<ul class="org-ul">
<li>A comma-separated list of necessary flags.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org55b4fc4" class="outline-5">
<h5 id="org55b4fc4">Example</h5>
<div class="outline-text-5" id="text-org55b4fc4">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">HasFlags</span> <span style="color: #cae682;">requiredFlags</span>=<span style="color: #95e454;">"decypher,otherFlag"</span>&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Actions here </span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">HasFlags</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4ead8ee" class="outline-4">
<h4 id="org4ead8ee">OnAdminGained</h4>
<div class="outline-text-4" id="text-org4ead8ee">
<p>
Triggers when the player achieves admin access to the target machine.<br />
</p>
</div>
<div id="outline-container-orgaccc5e4" class="outline-5">
<h5 id="orgaccc5e4">Attributes</h5>
<div class="outline-text-5" id="text-orgaccc5e4">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the machine which requires admin access<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdda5384" class="outline-5">
<h5 id="orgdda5384">Example</h5>
<div class="outline-text-5" id="text-orgdda5384">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">OnAdminGained</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Actions here </span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">OnAdminGained</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbe53526" class="outline-4">
<h4 id="orgbe53526">Instantly</h4>
<div class="outline-text-4" id="text-orgbe53526">
<p>
Triggers immediately.<br />
Actions occur in the order they appear in the file.<br />
</p>
</div>
<div id="outline-container-orgceb0082" class="outline-5">
<h5 id="orgceb0082">Attributes</h5>
<div class="outline-text-5" id="text-orgceb0082">
<ul class="org-ul">
<li>needsMissionComplete<br />
<ul class="org-ul">
<li>Whether the mission needs to be complete<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaf53130" class="outline-5">
<h5 id="orgaf53130">Example</h5>
<div class="outline-text-5" id="text-orgaf53130">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">Instantly</span>&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Actions here </span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">Instantly</span>&gt;

&lt;<span style="color: #cae682;">Instantly</span> <span style="color: #cae682;">needsMissionComplete</span>=<span style="color: #95e454;">"true"</span>&gt;
    <span style="color: #99968b;">&lt;!--</span><span style="color: #99968b;">You can also have the needs mission complete flag on instantly actions</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddIRCMessage</span>
        <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
        <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
        <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"0.3"</span>&gt;Second, if mission complete!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
  &lt;/<span style="color: #cae682;">Instantly</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbb413b9" class="outline-4">
<h4 id="orgbb413b9">DoesNotHaveFlags</h4>
<div class="outline-text-4" id="text-orgbb413b9">
<p>
Triggers when the player has none of the listed flags.<br />
</p>
</div>
<div id="outline-container-orgb3529af" class="outline-5">
<h5 id="orgb3529af">Attributes</h5>
<div class="outline-text-5" id="text-orgb3529af">
<ul class="org-ul">
<li>Flags<br />
<ul class="org-ul">
<li>A comma-separated list of flags the player must not have<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4531b91" class="outline-5">
<h5 id="org4531b91">Example</h5>
<div class="outline-text-5" id="text-org4531b91">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">DoesNotHaveFlags</span> <span style="color: #cae682;">Flags</span>=<span style="color: #95e454;">"SomeFlag,MoreFlags"</span>&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Actions here </span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">DoesNotHaveFlags</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgca4c88f" class="outline-4">
<h4 id="orgca4c88f">OnDisconnect</h4>
<div class="outline-text-4" id="text-orgca4c88f">
<p>
Triggers when the player disconnects from the machine.<br />
If target is unspecified or set to "NONE", triggers on any disconnect.<br />
</p>
</div>
<div id="outline-container-orgfa9ead3" class="outline-5">
<h5 id="orgfa9ead3">Attributes</h5>
<div class="outline-text-5" id="text-orgfa9ead3">
<ul class="org-ul">
<li>target<br />
<ul class="org-ul">
<li>The ID of the computer that the player must disconnect from<br /></li>
<li>If unspecified or "NONE", allows any computer<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga28aad6" class="outline-5">
<h5 id="orga28aad6">Example</h5>
<div class="outline-text-5" id="text-orga28aad6">
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">OnDisconnect</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>&gt;
    <span style="color: #99968b;">&lt;!--</span><span style="color: #99968b;">Actions here</span><span style="color: #99968b;">--&gt;</span>
&lt;/<span style="color: #cae682;">OnDisconnect</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5fa60b8" class="outline-4">
<h4 id="org5fa60b8">Example</h4>
<div class="outline-text-4" id="text-org5fa60b8">
<p>
Hastebin link: <a href="https://hastebin.com/rodiyumepa.xml">https://hastebin.com/rodiyumepa.xml</a><br />
Simplified contents:<br />
</p>
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #cae682;">ConditionalActions</span>&gt;
  &lt;<span style="color: #cae682;">OnConnect</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">needsMissionComplete</span>=<span style="color: #95e454;">"true"</span>
             <span style="color: #cae682;">requiredFlags</span>=<span style="color: #95e454;">"decypher"</span>&gt;
    &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
                   <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"2.1"</span>&gt;
    Hey, you're back, having just completed your mission.&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
  &lt;/<span style="color: #cae682;">OnConnect</span>&gt;

  &lt;<span style="color: #cae682;">HasFlags</span> <span style="color: #cae682;">requiredFlags</span>=<span style="color: #95e454;">"decypher,otherFlag"</span>&gt;
    &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
                   <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
                   <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"0.1"</span>&gt;has some flags!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
  &lt;/<span style="color: #cae682;">HasFlags</span>&gt;

  &lt;<span style="color: #cae682;">OnAdminGained</span> <span style="color: #cae682;">target</span>=<span style="color: #95e454;">"advExamplePC"</span>&gt;
    &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
                   <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
                   <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"2.1"</span>&gt;
    Wow, nice! You got admin on the example server.&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
    &lt;/<span style="color: #cae682;">OnAdminGained</span>&gt;

    &lt;<span style="color: #cae682;">Instantly</span>&gt;
      &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
                     <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
                     <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"0.1"</span>&gt;First!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
    &lt;/<span style="color: #cae682;">Instantly</span>&gt;

    &lt;<span style="color: #cae682;">DoesNotHaveFlags</span> <span style="color: #cae682;">Flags</span>=<span style="color: #95e454;">"SomeFlag,MoreFlags"</span>&gt;
      &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
                     <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
                     <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"0.1"</span>&gt;doesn't have some other flags!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
    &lt;/<span style="color: #cae682;">DoesNotHaveFlags</span>&gt;

    &lt;<span style="color: #cae682;">OnDisconnect</span>&gt;
      &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span>
                     <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span>
                     <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"0.1"</span>&gt;Disconnected!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
    &lt;/<span style="color: #cae682;">OnDisconnect</span>&gt;

&lt;/<span style="color: #cae682;">ConditionalActions</span>&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
