index.html
<div id="outline-container-org10c4097" class="outline-2">
<h2 id="org10c4097">Factions</h2>
<div class="outline-text-2" id="text-org10c4097">
</div>
<div id="outline-container-orgb02f9e1" class="outline-3">
<h3 id="orgb02f9e1">Example</h3>
<div class="outline-text-3" id="text-orgb02f9e1">
<p>
Pastebin link:<br />
Simplified contents:<br />
</p>
<div class="org-src-container">
<pre class="src src-nxml">   &lt;<span style="color: #cae682;">CustomFaction</span> <span style="color: #cae682;">name</span>=<span style="color: #95e454;">"Example Faction"</span> <span style="color: #cae682;">id</span>=<span style="color: #95e454;">"examplefaction"</span> <span style="color: #cae682;">playerVal</span>=<span style="color: #95e454;">"0"</span>&gt;
  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">You can change the starting player value with the playerVal field above. </span><span style="color: #99968b;">--&gt;</span>

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">A faction is basically just a few things:</span>
<span style="color: #99968b;">  A name, a number representing the player's position in the faction,</span>
<span style="color: #99968b;">  and a set of actions that can trigger to make changes to the game state in response to actions.</span><span style="color: #99968b;">--&gt;</span>

  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">The value required conditional action is the most basic one. This triggers once the player's value moves from below this number to equal to or more than it. </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">Action</span> <span style="color: #cae682;">ValueRequired</span>=<span style="color: #95e454;">"1"</span>&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Runs a 'mission function' - for a list of these and how to use them, see the example mission file </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">RunFunction</span> <span style="color: #cae682;">FunctionName</span>=<span style="color: #95e454;">"changeSong"</span> <span style="color: #cae682;">FunctionValue</span>=<span style="color: #95e454;">"6"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Immediately loads a mission, replacing whatever's currently there and sending the email. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">LoadMission</span> <span style="color: #cae682;">MissionName</span>=<span style="color: #95e454;">"Missions/ExampleMission.xml"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Creates a file with the listed content on the computer with ID targetComp, in the folder path specified.</span>
<span style="color: #99968b;">    The folder specified must exist before this runs!</span>
<span style="color: #99968b;">    The file contents field here doesn't support newlines or super long content - this is recommended for just creating items with wildcard data (like programs)</span>
<span style="color: #99968b;">    For a complete list of wildcards, see the example computer file</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddAsset</span> <span style="color: #cae682;">FileName</span>=<span style="color: #95e454;">"MemForensics.exe"</span> <span style="color: #cae682;">FileContents</span>=<span style="color: #95e454;">"#MEM_FORENSICS_EXE#"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">TargetFolderpath</span>=<span style="color: #95e454;">"bin"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This copies a file from one computer to another.</span>
<span style="color: #99968b;">    DestFilePath + DestComp are the DESTINATION computer - where the file will end up</span>
<span style="color: #99968b;">    SourceFileName, SourceFilePath and SourceComp are the SOURCE computer - where the file exists and is taken from</span>
<span style="color: #99968b;">    This will do nothing if the file does not exist to be copied.</span>

<span style="color: #99968b;">    This is very useful for adding complex files to a server after the session is created - create a new hidden server that's impossible to</span>
<span style="color: #99968b;">    find, define all the files you want on there, then copy them over to where you want later. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">CopyAsset</span> <span style="color: #cae682;">DestFilePath</span>=<span style="color: #95e454;">"linkNode1"</span> <span style="color: #cae682;">DestComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">SourceComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">SourceFileName</span>=<span style="color: #95e454;">"Test_File.txt"</span> <span style="color: #cae682;">SourceFilePath</span>=<span style="color: #95e454;">"home"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This adds a new mission to a hub server. This works for both missionHubServer servers (CSEC Style), missionListingServers (Entropy style)</span>
<span style="color: #99968b;">    and also DHSDaemon servers (Bibliotheque style)</span><span style="color: #99968b;">--&gt;</span>
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">CSEC Style: </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddMissionToHubServer</span> <span style="color: #cae682;">MissionFilepath</span>=<span style="color: #95e454;">"Missions/TestExtensionMission1.xml"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Bibliotheque Style: Assignment tag is who the mission starts assigned to of the server's user list. If this tag exists, the player cant claim the mission! </span><span style="color: #99968b;">--&gt;</span>
    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">note that adding a mission to an entropy style server, you can set the AssignmentTag to be "top" to add to the top of the list. Otherwise it'll be added to the bottom.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddMissionToHubServer</span> <span style="color: #cae682;">MissionFilepath</span>=<span style="color: #95e454;">"Missions/TestExtensionMission1.xml"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">AssignmentTag</span>=<span style="color: #95e454;">"HA0"</span>/&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This removes the mission from the hub server, if it exists. Works for all three specified above. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">RemoveMissionFromHubServer</span> <span style="color: #cae682;">MissionFilepath</span>=<span style="color: #95e454;">"Missions/TestExtensionMission1.xml"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Adds a thread to a /el message board - thread file should be a UFT-8 plaintext document. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddThreadToMissionBoard</span> <span style="color: #cae682;">ThreadFilepath</span>=<span style="color: #95e454;">"Nodes/MessageBoardThreads/ExampleThread1.txt"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Adds a message to a DHSDaemon or IRCDaemon IRC. Delay is seconds until the post appears. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"HA0"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.0"</span>&gt;Hey @#PLAYERNAME# - check out the new asset that got added a few lines ago.&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
    &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"8.0"</span>&gt;@channel this notifies everyone!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Crashes computer with the ID TargetComp. If this is "playerComp" it will crash the player's own computer (bluscreening it) instantly.</span>
<span style="color: #99968b;">    If it's another computer, this will remove it from the netmap for 15 seconds or so, and disconnect the player if they were connected to it.</span>
<span style="color: #99968b;">    The CrashSource is the ID of a computer that the crash log will point to.</span>
<span style="color: #99968b;">    NOTE: Players are very likely to rm * entire log folders, so don't make this part of any critical path - it's almost impossible to find. Secrets only!</span>

<span style="color: #99968b;">    **** DelayHost is the ID of a computer that can host delayable actions. Valid computers need to have one of these daemons on them:</span>
<span style="color: #99968b;">    IRCDaemon or DLCHubServer </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">CrashComputer</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"linkNode1"</span> <span style="color: #cae682;">CrashSource</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Deletes a file from the target computer. Does nothing if that file does not exist. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">DeleteFile</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">FilePath</span>=<span style="color: #95e454;">"bin"</span> <span style="color: #cae682;">FileName</span>=<span style="color: #95e454;">"Binary_File"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span>/&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Loads in a new set of conditional actions from a file. Check out the file listed here for an explanation on what you can do with that </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AddConditionalActions</span> <span style="color: #cae682;">Filepath</span>=<span style="color: #95e454;">"ExampleConditionalActionSet.xml"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span>/&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Loads in the Hacker script defined below to execute 5.5 seconds from now, coming from source advExamplePC and targeting playerComp (The player node ID).</span>
<span style="color: #99968b;">    These can target whatever you like, and be ally scripts! RequireLogsOnSource means that this will only execute if the source comp has logs on it from the player </span>
<span style="color: #99968b;">    deleting, moving, or copying a file. You can use the ID or the IP for the source and target - either works.</span>
<span style="color: #99968b;">    RequireSourceIntact means that if the target is missing it's networking file from /sys, the hack wont happen. This means a crippled computer cant hack you back.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">LaunchHackScript</span> <span style="color: #cae682;">Filepath</span>=<span style="color: #95e454;">"HackerScripts/ExampleHack.txt"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"5.5"</span> <span style="color: #cae682;">SourceComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"playerComp"</span> <span style="color: #cae682;">RequireLogsOnSource</span>=<span style="color: #95e454;">"false"</span> <span style="color: #cae682;">RequireSourceIntact</span>=<span style="color: #95e454;">"true"</span>/&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Switches to the listed theme. You can specify any of the core Hacknet themes by name directly :</span>
<span style="color: #99968b;">    TerminalOnlyBlack, HacknetBlue, HacknetTeal, HacknetYellow, HacknetWhite, HacknetPurple, HacknetMint, HackerGreen </span>
<span style="color: #99968b;">    Or you can specify a path to a custom theme file.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">SwitchToTheme</span> <span style="color: #cae682;">ThemePathOrName</span>=<span style="color: #95e454;">"Themes/ExampleTheme.xml"</span> <span style="color: #cae682;">FlickerInDuration</span>=<span style="color: #95e454;">"3.0"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Starts a 'screen bleed' effect! This is where the red line moves down from the top of the screen dramatically</span>
<span style="color: #99968b;">    The title and the first 3 lines of the content of this tag are what's shown in the bottom left alert window.</span>
<span style="color: #99968b;">    The CompleteAction conditional action set is run *only if* the red hits the bottom of the screen and the player runs out of time.</span>
<span style="color: #99968b;">    "TotalDurationSeconds" is the total time it takes for the screen bleed to go from top to bottom.</span>

<span style="color: #99968b;">    I recommend syncing this up with various other conditions that allow you to cancel the effect if the player completes some task.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">StartScreenBleedEffect</span> <span style="color: #cae682;">AlertTitle</span>=<span style="color: #95e454;">"Title"</span> <span style="color: #cae682;">CompleteAction</span>=<span style="color: #95e454;">"Actions/HackerScriptActions.xml"</span> <span style="color: #cae682;">TotalDurationSeconds</span>=<span style="color: #95e454;">"12.5"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"3.5"</span>&gt;Line one
Line two
Line Three!&lt;/<span style="color: #cae682;">StartScreenBleedEffect</span>&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Cancels a screen bleed effect started with the tag above </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">CancelScreenBleedEffect</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"9.5"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Appends the content of the tag onto the file specified. Useful for adding extra data into things, making the world feel more dynamic, adding people to whitelists etc. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">AppendToFile</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"12.5"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">TargetFolderpath</span>=<span style="color: #95e454;">"Whitelist"</span> <span style="color: #cae682;">TargetFilename</span>=<span style="color: #95e454;">"list.txt"</span>&gt;#PLAYER_IP#&lt;/<span style="color: #cae682;">AppendToFile</span>&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Kills all exes that contain the string mentioned, or * for all.</span>
<span style="color: #99968b;">    This is case insensitive. So the following would kill "SSHCrackExe",</span>
<span style="color: #99968b;">    but changing it to "s" would kill all exes with an s in their name.</span>

<span style="color: #99968b;">    This is useful for doing things like killing ESequencer.exe once it's running,</span>
<span style="color: #99968b;">    or having a rival hacker close all of the player's shells.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">KillExe</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> <span style="color: #cae682;">ExeName</span>=<span style="color: #95e454;">"ssh"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This is a big one - Changes the alert icon (top right) to point to a new server!</span>
<span style="color: #99968b;">    Target is the ID of the server it should connect to.</span>
<span style="color: #99968b;">    Type can be one of 4 options:</span>
<span style="color: #99968b;">    mail, irc, irchub, board</span>

<span style="color: #99968b;">    Mail is a mail server, like Jmail. If you use this, the mail server that it points to *MUST HAVE A MAIL ACCOUNT FOR THE PLAYER*</span>
<span style="color: #99968b;">    If it doesn't, it will crash when the player clicks on the icon and tries to go to their non-existent account.</span>

<span style="color: #99968b;">    irc is a standard IRC server. Whenever an IRC log with @#PLAYERNAME# or @Channel in it is added, the player will get a notification.</span>
<span style="color: #99968b;">    Labyrinths users only.</span>

<span style="color: #99968b;">    irchub is a DLCHubServer like Labyrinths uses. Labyrinths players only.</span>

<span style="color: #99968b;">    board is a /el style message board. Whenever a message or thread is added that contains any other the above IRC mention strings, the player will be notified.</span>

<span style="color: #99968b;">    IMPORTANT NOTE: Changing the type to anything other than mail is only supported with the Hacknet Labyrinths DLC installed.</span>
<span style="color: #99968b;">    </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">ChangeAlertIcon</span> <span style="color: #cae682;">Target</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Type</span>=<span style="color: #95e454;">"mail"</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"9.5"</span>/&gt;


    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Hides the target computer node from the netmap if it's visible </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">HideNode</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Reveals this user account to the player so it's details show up in the autocomplete options when the player goes to log in. </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">GivePlayerUserAccount</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Username</span>=<span style="color: #95e454;">"mailGuy"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Changes the IP Address of the computer with ID in targetComp to the new IP address provided </span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">ChangeIP</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"15.5"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">NewIP</span>=<span style="color: #95e454;">"111.111.123.124"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Changes the player's netmap sorting method, as if they had used NetmapOrganizer. Valid methods are:</span>
<span style="color: #99968b;">    scatter,grid,seqgrid,CHAOS</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">ChangeNetmapSortMethod</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"18.5"</span> <span style="color: #cae682;">Method</span>=<span style="color: #95e454;">"grid"</span> /&gt;

    <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">Saves the game! The player should be saved frequently, just incase their power dies or something. If you have extremely long missions</span>
<span style="color: #99968b;">    without email replies or any other save triggers, use this to keep the player saved and up to date.</span><span style="color: #99968b;">--&gt;</span>
    &lt;<span style="color: #cae682;">SaveGame</span> <span style="color: #cae682;">DelayHost</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"20.5"</span>/&gt;

  &lt;/<span style="color: #cae682;">Action</span>&gt;


  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">This action trigger as soon as the player is given the "decypher" flag </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">Action</span> <span style="color: #cae682;">Flags</span>=<span style="color: #95e454;">"decypher"</span>&gt;
    &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"8.0"</span>&gt;decypher flag was added!&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
  &lt;/<span style="color: #cae682;">Action</span>&gt;


  <span style="color: #99968b;">&lt;!-- </span><span style="color: #99968b;">And this one only triggers once both the player has the flag, and the score is greater than or equal to the required value </span><span style="color: #99968b;">--&gt;</span>
  &lt;<span style="color: #cae682;">Action</span> <span style="color: #cae682;">ValueRequired</span>=<span style="color: #95e454;">"5"</span> <span style="color: #cae682;">Flags</span>=<span style="color: #95e454;">"decypher"</span>&gt;
     &lt;<span style="color: #cae682;">AddIRCMessage</span> <span style="color: #cae682;">Author</span>=<span style="color: #95e454;">"DependableSkeleton"</span> <span style="color: #cae682;">TargetComp</span>=<span style="color: #95e454;">"advExamplePC"</span> <span style="color: #cae682;">Delay</span>=<span style="color: #95e454;">"-8.0"</span>&gt;negative delay adds it instantly, and backdates the time to make it all fit.&lt;/<span style="color: #cae682;">AddIRCMessage</span>&gt;
  &lt;/<span style="color: #cae682;">Action</span>&gt;


&lt;/<span style="color: #cae682;">CustomFaction</span>&gt;
</pre>
</div>
</div>
</div>
</div>
